       $SET ANS85 MF DEFAULTBYTE"00" CASE CALLFH"MFFH" REMOVE(BEEP)
       $SET SQL
000100*===============================*
000200 IDENTIFICATION   DIVISION.
000300*===============================*
000400 PROGRAM-ID.      S01U034.
000500 DATE-WRITTEN.    30/07/2007.
000600 AUTHOR.          ADRIANO TIRABASSO.
000700*----------------------------------------------------------------*
000800* OBJETIVO:      ( ) CONSISTENCIA  ( ) MANUTENCAO ( ) LISTAGEM   *
000900*                ( ) SELECAO       ( ) CONVERSAO  (X) UTILITARIO *
001000*                                                                *
001100* PERIODICIDADE: (X) DIARIA        ( ) SEMANAL    ( ) QUINZENAL  *
001200*                ( ) MENSAL        ( ) BIMESTRAL  ( ) TRIMESTRAL *
001300*                ( ) QUADRIMESTRAL ( ) SEMESTRAL  ( ) ANUAL      *
001400*                ( ) EVENTUAL      (X) ON-LINE    (X) BATCH      *
001500*                                                                *
001600*                                                                *
001700* DESCRICAO:     PROGRAMA RESPONSAVEL PELO CONTROLE DE ACEITACAO *
001800*                DE PRODUTO DE RAMOS DIVERSOS CONFORME NORMA  DE *
001900*                COMERCIALIZACAO.                                *
002000*                                                                *
002100* UTILIZADO POR: P01B008  (GEM)                                  *
002200*                P01B043  (GEM)                                  *
002300*---------------*----------------*---------------*---------------*
002400* COD-IDEN-STAT * AUTOMOVEL      * COD-IDEN-STAT * MULTI         *
002500*---------------*----------------*---------------*---------------*
002600*     10        * PRODUTO        *     10        * PRODUTO       *
002700*     20        * VIST. PREV.    *     20        *               *
002800*     30        * ANUENCIA       *     35        * RESSEGURO     *
002900*     40        * G. ANALISE     *     40        * G. ANALISE    *
003000*     50        * CENT. BONUS    *     55        * INSPECAO      *
003100*     60        * TRIAGEM        *     60        * TRIAGEM       *
003200*               *                *     65        * ESPECIFICACAO *
003300*     70        * AP. CANC.      *     70        * AP. CANC.     *
003400*     80        * RECUSA         *     80        * RECUSA        *
003500*     81        * CANC. ERRO OPE *     81        * CANC. ERRO OPE*
003600*     90        * EMISSAO OK     *     90        * EMISSAO OK    *
003700*---------------*----------------*---------------*---------------*
003800
003900*===============================*
004000 ENVIRONMENT      DIVISION.
004100*===============================*
004200 CONFIGURATION    SECTION.
004300 SOURCE-COMPUTER. FACOM-M360.
004400 OBJECT-COMPUTER. FACOM-M360.
004500 SPECIAL-NAMES.   DECIMAL-POINT IS      COMMA,
004600                  CONSOLE       IS      CRT,
004700      EXCLUIR ESSA LINHA E A LINHA ABAIXO
004800                  CONSOLE       IS      CRT,
004900                  SYSOUT        IS      SYSOUT.
005000 INPUT-OUTPUT     SECTION.
005100 FILE-CONTROL.
005200
005300*=======================================*
005400 DATA             DIVISION.
005500*=======================================*
005600 FILE             SECTION.
005700
005800*=======================================*
005900 WORKING-STORAGE  SECTION.
           EXEC SQL INCLUDE SQLCA END-EXEC.
       01   PROGRAM-STA-WS              PIC 9(02) VALUE 0.
       01   P99B004-IND-SQL-WS PIC 9(005).
       01   QTD-CONTEUDO-SQL-WS PIC 9(005).
       01   TAB-CONTEUDO-SQL-WS.
           03   FILLER OCCURS 500 TIMES.
              05   DSC-CONTEUDO-SQL-WS PIC X(65).
       01   TAB-MOSTRA-HOST.
           03 FILLER OCCURS            00176     TIMES.
              05  COD-IDEN-MOSTRA-HOST PIC 9(01).
006000*=======================================*
006100 77  SUB-WS                     PIC  9(003)     VALUE ZEROS.
006200 77  IND-WS                     PIC  9(003)     VALUE ZEROS.
006300 77  IND-2                      PIC  9(003)     VALUE ZEROS.
006400 77  IND-ERR                    PIC  9(003)     VALUE ZEROS.
006500 77  VAL-IS-4-1-1-WS            PIC S9(013)V99  VALUE ZEROS.
006600 77  VAL-IS-4-2-1-WS            PIC S9(013)V99  VALUE ZEROS.
006700 77  VAL-IS-4-3-1-WS            PIC S9(013)V99  VALUE ZEROS.
006800 77  VAL-IS-4-3-9-WS            PIC S9(013)V99  VALUE ZEROS.
006900 77  VAL-IS-4-4-1-WS            PIC S9(013)V99  VALUE ZEROS.
007000 77  VAL-IS-4-4-2-WS            PIC S9(013)V99  VALUE ZEROS.
007100 77  VAL-IS-4-4-3-WS            PIC S9(013)V99  VALUE ZEROS.
007200 77  VAL-IS-4-4-4-WS            PIC S9(013)V99  VALUE ZEROS.
007300 77  VAL-IS-4-4-5-WS            PIC S9(013)V99  VALUE ZEROS.
007400 77  VAL-IS-4-4-6-WS            PIC S9(013)V99  VALUE ZEROS.
007500 77  VAL-IS-4-4-7-WS            PIC S9(013)V99  VALUE ZEROS.
007600 77  VAL-IS-4-4-8-WS            PIC S9(013)V99  VALUE ZEROS.
007700 77  VAL-IS-4-4-9-WS            PIC S9(013)V99  VALUE ZEROS.
007800 77  VAL-IS-4-5-0-WS            PIC S9(013)V99  VALUE ZEROS.
007900 77  VAL-IS-4-5-1-WS            PIC S9(013)V99  VALUE ZEROS.
008000 77  VAL-IS-4-5-2-WS            PIC S9(013)V99  VALUE ZEROS.
008100 77  VAL-IS-4-5-3-WS            PIC S9(013)V99  VALUE ZEROS.
008200 77  VAL-IS-4-5-4-WS            PIC S9(013)V99  VALUE ZEROS.
008300 77  VAL-IS-4-5-5-WS            PIC S9(013)V99  VALUE ZEROS.
008400 77  VAL-IS-4-5-6-WS            PIC S9(013)V99  VALUE ZEROS.
008500 77  VAL-IS-4-5-7-WS            PIC S9(013)V99  VALUE ZEROS.
008600 77  VAL-IS-4-5-8-WS            PIC S9(013)V99  VALUE ZEROS.
008700 77  VAL-IS-4-5-9-WS            PIC S9(013)V99  VALUE ZEROS.
008800 77  VAL-IS-4-6-0-WS            PIC S9(013)V99  VALUE ZEROS.
008900 77  VAL-IS-4-6-1-WS            PIC S9(013)V99  VALUE ZEROS.
009000 77  VAL-IS-4-6-2-WS            PIC S9(013)V99  VALUE ZEROS.
009100 77  VAL-IS-4-6-3-WS            PIC S9(013)V99  VALUE ZEROS.
009200 77  VAL-IS-4-6-4-WS            PIC S9(013)V99  VALUE ZEROS.
009300 77  VAL-IS-4-6-5-WS            PIC S9(013)V99  VALUE ZEROS.
009400 77  VAL-IS-4-6-6-WS            PIC S9(013)V99  VALUE ZEROS.
009500 77  VAL-IS-4-6-7-WS            PIC S9(013)V99  VALUE ZEROS.
009600 77  VAL-IS-4-4-1-1-WS          PIC S9(013)V99  VALUE ZEROS.
009700 77  VAL-IS-4-4-1-2-WS          PIC S9(013)V99  VALUE ZEROS.
009800 77  VAL-IS-4-4-1-3-WS          PIC S9(013)V99  VALUE ZEROS.
009900 77  VAL-IS-4-4-1-4-WS          PIC S9(013)V99  VALUE ZEROS.
010000 77  VAL-IS-4-4-1-5-WS          PIC S9(013)V99  VALUE ZEROS.
010100 77  VAL-IS-4-4-1-6-WS          PIC S9(013)V99  VALUE ZEROS.
010200 77  VAL-IS-4-4-1-7-WS          PIC S9(013)V99  VALUE ZEROS.
010300 77  VAL-IS-4-4-1-8-WS          PIC S9(013)V99  VALUE ZEROS.
010400 77  VAL-IS-4-4-1-9-WS          PIC S9(013)V99  VALUE ZEROS.
010500 77  VAL-IS-4-4-1-10-WS         PIC S9(013)V99  VALUE ZEROS.
010600 77  VAL-IS-4-4-1-11-WS         PIC S9(013)V99  VALUE ZEROS.
010700 77  VAL-IS-4-4-2-1-WS          PIC S9(013)V99  VALUE ZEROS.
010800 77  VAL-IS-4-4-2-2-WS          PIC S9(013)V99  VALUE ZEROS.
010900 77  VAL-IS-4-4-2-3-WS          PIC S9(013)V99  VALUE ZEROS.
011000 77  VAL-IS-4-4-2-4-WS          PIC S9(013)V99  VALUE ZEROS.
011100 77  VAL-IS-4-4-2-5-WS          PIC S9(013)V99  VALUE ZEROS.
011200 77  VAL-IS-4-4-2-6-WS          PIC S9(013)V99  VALUE ZEROS.
011300 77  VAL-IS-4-4-2-7-WS          PIC S9(013)V99  VALUE ZEROS.
011400 77  VAL-IS-4-4-2-8-WS          PIC S9(013)V99  VALUE ZEROS.
011500 77  VAL-IS-4-4-2-9-WS          PIC S9(013)V99  VALUE ZEROS.
011600 77  VAL-IS-4-4-2-10-WS         PIC S9(013)V99  VALUE ZEROS.
011700 77  VAL-IS-4-4-2-11-WS         PIC S9(013)V99  VALUE ZEROS.
011800 77  VAL-IS-4-4-3-1-WS          PIC S9(013)V99  VALUE ZEROS.
011900 77  VAL-IS-4-4-3-2-WS          PIC S9(013)V99  VALUE ZEROS.
012000 77  VAL-IS-4-4-3-3-WS          PIC S9(013)V99  VALUE ZEROS.
012100 77  VAL-IS-4-4-3-4-WS          PIC S9(013)V99  VALUE ZEROS.
012200 77  VAL-IS-4-4-3-5-WS          PIC S9(013)V99  VALUE ZEROS.
012300 77  VAL-IS-4-4-3-6-WS          PIC S9(013)V99  VALUE ZEROS.
012400 77  VAL-IS-4-4-3-7-WS          PIC S9(013)V99  VALUE ZEROS.
012500 77  VAL-IS-4-4-3-8-WS          PIC S9(013)V99  VALUE ZEROS.
012600 77  VAL-IS-4-4-3-9-WS          PIC S9(013)V99  VALUE ZEROS.
012700 77  VAL-IS-4-4-4-1-WS          PIC S9(013)V99  VALUE ZEROS.
012800 77  VAL-IS-4-4-4-2-WS          PIC S9(013)V99  VALUE ZEROS.
012900 77  VAL-IS-4-4-4-3-WS          PIC S9(013)V99  VALUE ZEROS.
013000 77  VAL-IS-4-4-4-4-WS          PIC S9(013)V99  VALUE ZEROS.
013100 77  VAL-IS-4-4-4-5-WS          PIC S9(013)V99  VALUE ZEROS.
013200 77  VAL-IS-4-4-4-6-WS          PIC S9(013)V99  VALUE ZEROS.
013300 77  VAL-IS-4-4-4-7-WS          PIC S9(013)V99  VALUE ZEROS.
013400 77  VAL-IS-4-4-4-8-WS          PIC S9(013)V99  VALUE ZEROS.
013500 77  VAL-IS-4-4-4-9-WS          PIC S9(013)V99  VALUE ZEROS.
013600 77  VAL-IS-4-4-5-1-WS          PIC S9(013)V99  VALUE ZEROS.
013700 77  VAL-IS-4-4-6-1-WS          PIC S9(013)V99  VALUE ZEROS.
013800 77  VAL-IS-4-3-1-1-WS          PIC S9(013)V99  VALUE ZEROS.
013900 77  VAL-IS-4-3-1-2-WS          PIC S9(013)V99  VALUE ZEROS.
014000 77  VAL-IS-4-3-1-3-WS          PIC S9(013)V99  VALUE ZEROS.
014100 77  VAL-IS-4-3-1-4-WS          PIC S9(013)V99  VALUE ZEROS.
014200 77  VAL-IS-4-3-1-5-WS          PIC S9(013)V99  VALUE ZEROS.
014300 77  VAL-IS-4-3-1-6-WS          PIC S9(013)V99  VALUE ZEROS.
014400 77  VAL-IS-4-3-1-7-WS          PIC S9(013)V99  VALUE ZEROS.
014500 77  VAL-IS-4-3-1-8-WS          PIC S9(013)V99  VALUE ZEROS.
014600 77  VAL-IS-4-3-1-9-WS          PIC S9(013)V99  VALUE ZEROS.
014700 77  VAL-IS-4-3-1-1-0-WS        PIC S9(013)V99  VALUE ZEROS.
014800 77  VAL-IS-4-3-2-1-WS          PIC S9(013)V99  VALUE ZEROS.
014900 77  VAL-IS-4-3-2-2-WS          PIC S9(013)V99  VALUE ZEROS.
015000 77  VAL-IS-4-3-2-3-WS          PIC S9(013)V99  VALUE ZEROS.
015100 77  VAL-IS-4-3-2-4-WS          PIC S9(013)V99  VALUE ZEROS.
015200 77  VAL-IS-4-3-2-5-WS          PIC S9(013)V99  VALUE ZEROS.
015300 77  VAL-IS-4-3-2-6-WS          PIC S9(013)V99  VALUE ZEROS.
015400 77  VAL-IS-4-3-3-1-WS          PIC S9(013)V99  VALUE ZEROS.
015500 77  VAL-IS-4-3-3-2-WS          PIC S9(013)V99  VALUE ZEROS.
015600 77  VAL-IS-4-3-3-3-WS          PIC S9(013)V99  VALUE ZEROS.
015700 77  VAL-IS-4-3-3-4-WS          PIC S9(013)V99  VALUE ZEROS.
015800 77  VAL-IS-4-3-3-5-WS          PIC S9(013)V99  VALUE ZEROS.
015900 77  VAL-IS-4-3-3-6-WS          PIC S9(013)V99  VALUE ZEROS.
016000 77  VAL-IS-4-3-3-7-WS          PIC S9(013)V99  VALUE ZEROS.
016100 77  VAL-IS-4-3-4-1-WS          PIC S9(013)V99  VALUE ZEROS.
016200 77  VAL-IS-4-3-4-2-WS          PIC S9(013)V99  VALUE ZEROS.
016300 77  VAL-IS-4-3-4-3-WS          PIC S9(013)V99  VALUE ZEROS.
016400 77  VAL-IS-4-3-4-4-WS          PIC S9(013)V99  VALUE ZEROS.
016500 77  VAL-IS-4-3-4-5-WS          PIC S9(013)V99  VALUE ZEROS.
016600 77  VAL-IS-4-3-4-6-WS          PIC S9(013)V99  VALUE ZEROS.
016700 77  VAL-IS-4-3-4-7-WS          PIC S9(013)V99  VALUE ZEROS.
016800 77  VAL-IS-4-3-5-1-WS          PIC S9(013)V99  VALUE ZEROS.
016900 77  VAL-IS-4-3-5-2-WS          PIC S9(013)V99  VALUE ZEROS.
017000 77  VAL-IS-4-3-5-3-WS          PIC S9(013)V99  VALUE ZEROS.
017100 77  VAL-IS-4-3-5-4-WS          PIC S9(013)V99  VALUE ZEROS.
017200 77  VAL-IS-4-3-5-5-WS          PIC S9(013)V99  VALUE ZEROS.
017300 77  VAL-IS-4-3-5-6-WS          PIC S9(013)V99  VALUE ZEROS.
017400 77  VAL-IS-4-3-5-7-WS          PIC S9(013)V99  VALUE ZEROS.
017500 77  VAL-IS-4-3-7-1-WS          PIC S9(013)V99  VALUE ZEROS.
017600 77  VAL-IS-4-3-7-2-WS          PIC S9(013)V99  VALUE ZEROS.
017700 77  VAL-IS-4-3-7-3-WS          PIC S9(013)V99  VALUE ZEROS.
017800 77  VAL-IS-4-3-7-4-WS          PIC S9(013)V99  VALUE ZEROS.
017900 77  VAL-IS-4-3-7-5-WS          PIC S9(013)V99  VALUE ZEROS.
018000 77  VAL-IS-4-3-7-6-WS          PIC S9(013)V99  VALUE ZEROS.
018100 77  VAL-IS-4-3-7-7-WS          PIC S9(013)V99  VALUE ZEROS.
018200 77  VAL-IS-4-3-7-8-WS          PIC S9(013)V99  VALUE ZEROS.
018300 77  VAL-IS-AUX                 PIC S9(013)V99  VALUE ZEROS.
018400 77  VAL-IS-AUX2                PIC S9(013)V99  VALUE ZEROS.
018500 77  VAL-IS-AUX3                PIC S9(013)V99  VALUE ZEROS.
018600 77  VAL-IS-COBERT-BAS          PIC S9(013)V99  VALUE ZEROS.
018700 77  VAL-IS-CALC-COBERT         PIC S9(013)V99  VALUE ZEROS.
018800*** 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
018900 77  VAL-IS-COB-112-003         PIC S9(013)V99  VALUE ZEROS.
019000 77  VAL-IS-COB-112-007         PIC S9(013)V99  VALUE ZEROS.
019100 77  VAL-IS-COB-112-009         PIC S9(013)V99  VALUE ZEROS.
019200*77  VAL-IS-COB-112-010         PIC S9(013)V99  VALUE ZEROS.
019300 77  VAL-IS-COB-112-011         PIC S9(013)V99  VALUE ZEROS.
019400 77  VAL-IS-COB-112-012         PIC S9(013)V99  VALUE ZEROS.
019500 77  VAL-IS-COB-112-013         PIC S9(013)V99  VALUE ZEROS.
019600 77  VAL-IS-COB-112-014         PIC S9(013)V99  VALUE ZEROS.
019700 77  VAL-IS-COB-112-015         PIC S9(013)V99  VALUE ZEROS.
019800 77  VAL-IS-COB-112-016         PIC S9(013)V99  VALUE ZEROS.
019900 77  VAL-IS-COB-112-017         PIC S9(013)V99  VALUE ZEROS.
020000 77  VAL-IS-COB-112-021         PIC S9(013)V99  VALUE ZEROS.
020100***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
020200 77  VAL-IS-COB-112-028         PIC S9(013)V99  VALUE ZEROS.
020300 77  VAL-IS-COB-112-035         PIC S9(013)V99  VALUE ZEROS.
020400 77  VAL-IS-COB-112-038         PIC S9(013)V99  VALUE ZEROS.
020500 77  VAL-IS-COB-112-040         PIC S9(013)V99  VALUE ZEROS.
020600 77  VAL-IS-COB-112-043         PIC S9(013)V99  VALUE ZEROS.
020700 77  VAL-IS-COB-112-044         PIC S9(013)V99  VALUE ZEROS.
020800 77  VAL-IS-COB-112-054         PIC S9(013)V99  VALUE ZEROS.
020900 77  VAL-IS-COB-112-055         PIC S9(013)V99  VALUE ZEROS.
021000 77  VAL-IS-COB-112-063         PIC S9(013)V99  VALUE ZEROS.
021100 77  COD-COB-AUX                PIC  9(004)     VALUE ZEROS.
021200 77  COD-TIP-AUX                PIC  X(001)     VALUE SPACES.
021300 77  COD-IDEN-STAT-WS           PIC  9(002)     VALUE ZEROS.
021400 77  COD-ERR-NORMA-WS           PIC  9(010)     VALUE ZEROS.
021500 77  DSC-ERR-NORMA-WS           PIC  X(060)     VALUE SPACES.
021600 77  CUMPRE-NORMA               PIC  X(003)     VALUE SPACES.
021700 77  CONSTA-CANC-WS             PIC  X(001)     VALUE SPACES.
021800 77  COD-ESPEC-WS               PIC  X(001)     VALUE SPACES.
021900 77  INSP-OBRIG-WS              PIC  X(003)     VALUE SPACES.
022000 77  LMG-WS                     PIC  X(003)     VALUE SPACES.
022100 01  VAL-LIM-MAX-WS             PIC S9(013)V99  VALUE ZEROS.
022200 01  COD-IDEN-ACES-WS           PIC  9(002)     VALUE ZEROS.
022300 01  DAT-INI-VIG-WS             PIC  9(008)     VALUE ZEROS.
022400 01  DAT-TER-VIG-WS             PIC  9(008)     VALUE ZEROS.
022500 01  DAT-EMIS-WS                PIC  9(008)     VALUE ZEROS.
022600 01  DAT-PARC-WS                PIC  9(008)     VALUE ZEROS.
022700 01  DAT-COMPARA-WS             PIC  9(004)     VALUE ZEROS.
022800 01  PERC-DSC-CML-WS            PIC  9(002)V99  VALUE ZEROS.
022900 01  PERC-CORR-WS               PIC  9(002)V99  VALUE ZEROS.
023000 77  VAL-IS-COMPARAR            PIC S9(013)V99  VALUE ZEROS.
023100 77  NUM-ITEM-AUX               PIC  9(005)     VALUE ZEROS.
023200***FICHA 1100589
023300 77  FLG-LIBERADO               PIC  X(003)     VALUES 'NAO'.
023400
023500 01  DAT-HOJE-WS                PIC S9(008).
023600 01  DAT-HOJE-WS-R    REDEFINES DAT-HOJE-WS.
023700     03  ANO-HOJE-WS            PIC S9(004).
023800     03  MES-HOJE-WS            PIC S9(002).
023900     03  DIA-HOJE-WS            PIC S9(002).
024000
024100 01  DAT-COMP-WS                 PIC 9(06).
024200 01  FILLER  REDEFINES  DAT-COMP-WS.
024300     05  ANO-COMP-WS             PIC 9(02).
024400     05  MES-COMP-WS             PIC 9(02).
024500     05  DIA-COMP-WS             PIC 9(02).
024600
024700 01  DAT-CANC-WS                 PIC 9(08).
024800 01  FILLER  REDEFINES  DAT-CANC-WS.
024900     05  ANO-CANC-WS             PIC 9(04).
025000     05  MES-CANC-WS             PIC 9(02).
025100     05  DIA-CANC-WS             PIC 9(02).
025200
025300 01  TAB-COD-SIT                PIC  9(001).
025400     88  SEGURO-NOVO            VALUE 1.
025500     88  ENDOSSO                VALUE 2.
025600     88  RENOVA                 VALUE 3.
025700
025800 01  TAB-COBERT-WS.
025900     03  TAB-COBERT      OCCURS 150  TIMES.
026000         05  TAB-COD-COBERT-WS  PIC  9(004).
026100         05  TAB-VAL-IS-WS      PIC  9(015).
026200         05  TAB-VAL-IS-WS-R
026300                      REDEFINES TAB-VAL-IS-WS   PIC  9(013)V99.
026400         05  TAB-PER-TAXA-WS    PIC  9(007).
026500         05  TAB-PER-TAXA-WS-R
026600                      REDEFINES TAB-PER-TAXA-WS PIC  9(002)V9(5).
026700         05  TAB-VAL-PR-WS      PIC S9(015).
026800         05  TAB-VAL-PR-WS-R
026900                      REDEFINES TAB-VAL-PR-WS   PIC S9(013)V99.
027000         05  TAB-PER-DESC-COML-WS    PIC  9(004).
027100         05  TAB-PER-DESC-COML-WS-R
027200                    REDEFINES  TAB-PER-DESC-COML-WS PIC 9(002)V99.
027300         05  TAB-PER-DESC-EXP-WS     PIC  9(004).
027400         05  TAB-PER-DESC-EXP-WS-R
027500                    REDEFINES   TAB-PER-DESC-EXP-WS PIC 9(002)V99.
027600         05  TAB-PER-LIM-MAX-WS      PIC  9(007).
027700         05  TAB-PER-LIM-MAX-WS-R
027800             REDEFINES   TAB-PER-LIM-MAX-WS  PIC 9(003)V9(4).
027900         05  TAB-COD-LIM-WS     PIC  9(004).
028000 01  NUM-OCOR-COBERT-WS         PIC  9(003)     VALUE 150.
028100
028200 01  TAB-COBERT-SIN-WS.
028300     03  TAB-NUM-ITEM-SIN-WS        PIC  9(005).
028400     03  TAB-COBERT-SIN  OCCURS 150  TIMES.
028500         05  TAB-COD-COBERT-SIN-WS  PIC  9(004).
028600         05  TAB-COD-COBERT-SIN-WS-R
028700                      REDEFINES TAB-COD-COBERT-SIN-WS PIC X(004).
028800         05  TAB-VAL-PAG-SIN-WS     PIC  9(015).
028900         05  TAB-VAL-PAG-SIN-WS-R
029000                      REDEFINES TAB-VAL-PAG-SIN-WS PIC  9(013)V99.
029100 01  NUM-OCOR-COB-SIN-WS        PIC  9(003)     VALUE 150.
029200
029300 01  TAB-CORR-WS.
029400     03  TAB-CORR       OCCURS  03   TIMES.
029500         05  COD-CORR-WS        PIC  9(007).
029600         05  PER-CORR-WS        PIC  9(002)V99.
029700 01  NUM-OCOR-CORR-WS           PIC  9(002)     VALUE 03.
029800
029900 01  TAB-VENC-WS.
030000     03  TAB-VENC       OCCURS  12   TIMES.
030100         05  DAT-VENC-WS         PIC  9(008).
030200 01  NUM-OCOR-VENC-WS            PIC  9(002)    VALUE 12.
030300
030400 01  TAB-CLAU-WS.
030500     03  TAB-CLAU       OCCURS  50   TIMES.
030600         05  COD-CLAU-WS         PIC  9(005).
030700 01  NUM-OCOR-CLAU-WS            PIC  9(003)    VALUE 50.
030800
030900*================================================================*
031000**                     CLASSE DE CONSTRUCAO                     **
031100*================================================================*
031200*  CONFORME NORMA 112 => 4.2
031300*                 113 => 4.2
031400*                 114 => 3.2
031500*                 912 => 3.2
031600*
031700*  OS QUE ESTAO NA TABELA SAO ACEITOS
031800
031900 01  TAB-CONSTR-ACEIT.
032000     03  FILLER    PIC  X(019) VALUE  '112 0000 9999 01   '.
032100     03  FILLER    PIC  X(019) VALUE  '113 0000 9999 01   '.
032200     03  FILLER    PIC  X(019) VALUE  '113 0000 9999 02 PR'.
032300     03  FILLER    PIC  X(019) VALUE  '113 0000 9999 02 RS'.
032400     03  FILLER    PIC  X(019) VALUE  '113 0000 9999 02 SC'.
032500     03  FILLER    PIC  X(019) VALUE  '113 0000 9999 02 SP'.
032600     03  FILLER    PIC  X(019) VALUE  '114 0000 9999 00   '.
032700     03  FILLER    PIC  X(019) VALUE  '114 0000 9999 01   '.
032800     03  FILLER    PIC  X(019) VALUE  '912 0000 9999 01   '.
032900
033000 01  TAB-CONSTR-ACEIT-X REDEFINES  TAB-CONSTR-ACEIT.
033100     03  TAB-CONSTR-ACEIT-Y  OCCURS  09   TIMES.
033200         05  COD-RAMO-CONST-A     PIC  9(003).
033300         05  FILLER               PIC  X(001).
033400         05  COD-TARF-I-CONST-A   PIC  9(004).
033500         05  FILLER               PIC  X(001).
033600         05  COD-TARF-F-CONST-A   PIC  9(004).
033700         05  FILLER               PIC  X(001).
033800         05  COD-CONSTR-CONST-A   PIC  9(002).
033900         05  FILLER               PIC  X(001).
034000         05  COD-UF-CONST-A       PIC  X(002).
034100 01  NUM-OCOR-CONST-A           PIC  9(003)     VALUE 09.
034200
034300*================================================================*
034400**                      C O B E R T U R A S                     **
034500*================================================================*
034600*  CONFORME NORMA 112 => 4-3-X
034700*                 113 => 3-3 E 4-3-1
034800*                 114 => 4-2
034900*
035000*  TIP-ACEIT-COB-A
035100*        R - ACEITACAO RESTRITA
035200*        N - NAO SERA ACEITA
035300*
035400*  CASO NAO ESTEJA NESSA LISTA EH ACEITO
035500
035600 01  TAB-COB-ACEIT.
035700******* EMPRESARIAL *******
035800**COBERTURA 33 - CLASSE 4
035900*****03  FIL  PIC X(031) VALUE '112 1224310 0000 9999 99 0033 R'.
036000**COBERTURA 34 - CLASSE 4
036100*****03  FIL  PIC X(031) VALUE '112 1224311 0000 9999 99 0034 R'.
036200**COBERTURA 35 - CLASSE 4
036300*****03  FIL  PIC X(031) VALUE '112 1224312 0000 9999 99 0035 R'.
036400**COBERTURA 51 - CLASSE 4
036500     03  FIL  PIC X(031) VALUE '112 1224313 0000 9999 99 0051 R'.
036600**COBERTURA 53 - CLASSE 4
036700*****03  FIL  PIC X(031) VALUE '112 1224314 0000 9999 99 0053 R'.
036800**COBERTURA 59 - CLASSE 4
036900*****03  FIL  PIC X(031) VALUE '112 1224315 0000 9999 99 0059 R'.
037000**COBERTURA 60 - CLASSE 4
037100*****03  FIL  PIC X(031) VALUE '112 1224316 0000 9999 99 0060 R'.
037200**COBERTURA 61 - CLASSE 4
037300     03  FIL  PIC X(031) VALUE '112 1224317 0000 9999 99 0061 R'.
037400**COBERTURA 62 - CLASSE 4
037500*****03  FIL  PIC X(031) VALUE '112 1224318 0000 9999 99 0062 R'.
037600**COBERTURA 76 - CLASSE 4
037700*****03  FIL  PIC X(031) VALUE '112 1224319 0000 9999 99 0076 R'.
037800**COBERTURA 78 - CLASSE 4
037900*****03  FIL  PIC X(031) VALUE '112 1224320 0000 9999 99 0078 R'.
038000**COBERTURA 80 - CLASSE 4
038100*****03  FIL  PIC X(031) VALUE '112 1224321 0000 9999 99 0080 R'.
038200**COBERTURA 82 - CLASSE 4
038300*****03  FIL  PIC X(031) VALUE '112 1224322 0000 9999 99 0082 R'.
038400**COBERTURA 83 - CLASSE 4
038500*****03  FIL  PIC X(031) VALUE '112 1224323 0000 9999 99 0083 R'.
038600**COBERTURA 88 - CLASSE 4
038700     03  FIL  PIC X(031) VALUE '112 1224324 0000 9999 99 0088 R'.
038800**COBERTURA 89 - CLASSE 4
038900     03  FIL  PIC X(031) VALUE '112 1224325 0000 9999 99 0089 R'.
039000**COBERTURA 90 - CLASSE 4
039100     03  FIL  PIC X(031) VALUE '112 1224326 0000 9999 99 0090 R'.
039200**COBERTURA 91 - CLASSE 4
039300     03  FIL  PIC X(031) VALUE '112 1224327 0000 9999 99 0091 R'.
039400**COBERTURA 92 - CLASSE 4
039500     03  FIL  PIC X(031) VALUE '112 1224328 0000 9999 99 0092 R'.
039600**COBERTURA 93 - CLASSE 4
039700     03  FIL  PIC X(031) VALUE '112 1224329 0000 9999 99 0093 R'.
039800**COBERTURA 94 - CLASSE 4
039900** FICHA 1001146
040000*****03  FIL  PIC X(031) VALUE '112 1224330 0000 9999 99 0094 R'.
040100**COBERTURA 95 - CLASSE 4
040200**   03  FIL  PIC X(031) VALUE '112 1224331 0000 9999 99 0095 R'.
040300**COBERTURA 99 - CLASSE 4
040400     03  FIL  PIC X(031) VALUE '112 1224332 0000 9999 99 0099 R'.
040500**COBERTURA 114 - CLASSE 4
040600     03  FIL  PIC X(031) VALUE '112 1224333 0000 9999 99 0114 R'.
040700**COBERTURA 115 - CLASSE 4
040800     03  FIL  PIC X(031) VALUE '112 1224334 0000 9999 99 0115 R'.
040900**COBERTURA 117 - CLASSE 4
041000     03  FIL  PIC X(031) VALUE '112 1224335 0000 9999 99 0117 R'.
041100**COBERTURA 118 - CLASSE 4
041200     03  FIL  PIC X(031) VALUE '112 1224336 0000 9999 99 0118 R'.
041300**COBERTURA 119 - CLASSE 4
041400**   03  FIL  PIC X(031) VALUE '112 1224337 0000 9999 99 0119 R'.
041500**COBERTURA 126 - CLASSE 4
041600     03  FIL  PIC X(031) VALUE '112 1224338 0000 9999 99 0126 R'.
041700**COBERTURA 127 - CLASSE 4
041800     03  FIL  PIC X(031) VALUE '112 1224339 0000 9999 99 0127 R'.
041900**COBERTURA 128 - CLASSE 4
042000     03  FIL  PIC X(031) VALUE '112 1224340 0000 9999 99 0128 R'.
042100**COBERTURA 129 - CLASSE 4
042200     03  FIL  PIC X(031) VALUE '112 1224341 0000 9999 99 0129 R'.
042300**COBERTURA 130 - CLASSE 4
042400     03  FIL  PIC X(031) VALUE '112 1224342 0000 9999 99 0130 R'.
042500**COBERTURA 131 - CLASSE 4
042600     03  FIL  PIC X(031) VALUE '112 1224343 0000 9999 99 0131 R'.
042700**COBERTURA 132 - CLASSE 4
042800     03  FIL  PIC X(031) VALUE '112 1224344 0000 9999 99 0132 R'.
042900**COBERTURA 133 - CLASSE 4
043000     03  FIL  PIC X(031) VALUE '112 1224345 0000 9999 99 0133 R'.
043100**COBERTURA 134 - CLASSE 4
043200     03  FIL  PIC X(031) VALUE '112 1224346 0000 9999 99 0134 R'.
043300**COBERTURA 135 - CLASSE 4
043400     03  FIL  PIC X(031) VALUE '112 1224347 0000 9999 99 0135 R'.
043500**COBERTURA 136 - CLASSE 4
043600     03  FIL  PIC X(031) VALUE '112 1224348 0000 9999 99 0136 R'.
043700**COBERTURA 137 - CLASSE 4
043800     03  FIL  PIC X(031) VALUE '112 1224349 0000 9999 99 0137 R'.
043900**COBERTURA 138 - CLASSE 4
044000     03  FIL  PIC X(031) VALUE '112 1224350 0000 9999 99 0138 R'.
044100**COBERTURA 139 - CLASSE 4
044200     03  FIL  PIC X(031) VALUE '112 1224351 0000 9999 99 0139 R'.
044300**COBERTURA 140 - CLASSE 4
044400     03  FIL  PIC X(031) VALUE '112 1224352 0000 9999 99 0140 R'.
044500**COBERTURA 141 - CLASSE 4
044600     03  FIL  PIC X(031) VALUE '112 1224353 0000 9999 99 0141 R'.
044700**COBERTURA 142 - CLASSE 4
044800     03  FIL  PIC X(031) VALUE '112 1224354 0000 9999 99 0142 R'.
044900**COBERTURA 143 - CLASSE 4
045000     03  FIL  PIC X(031) VALUE '112 1224355 0000 9999 99 0143 R'.
045100**COBERTURA 144 - CLASSE 4
045200     03  FIL  PIC X(031) VALUE '112 1224356 0000 9999 99 0144 R'.
045300**COBERTURA 145 - CLASSE 4
045400     03  FIL  PIC X(031) VALUE '112 1224357 0000 9999 99 0145 R'.
045500**COBERTURA 146 - CLASSE 4
045600     03  FIL  PIC X(031) VALUE '112 1224358 0000 9999 99 0146 R'.
045700**COBERTURA 147 - CLASSE 4
045800     03  FIL  PIC X(031) VALUE '112 1224359 0000 9999 99 0147 R'.
045900**COBERTURA 148 - CLASSE 4
046000     03  FIL  PIC X(031) VALUE '112 1224360 0000 9999 99 0148 R'.
046100**COBERTURA 149 - CLASSE 4
046200     03  FIL  PIC X(031) VALUE '112 1224361 0000 9999 99 0149 R'.
046300**COBERTURA 150 - CLASSE 4
046400     03  FIL  PIC X(031) VALUE '112 1224362 0000 9999 99 0150 R'.
046500**COBERTURA 151 - CLASSE 4
046600     03  FIL  PIC X(031) VALUE '112 1224363 0000 9999 99 0151 R'.
046700**COBERTURA 97 - CLASSE 4
046800*****03  FIL  PIC X(031) VALUE '112 1224364 0000 9999 99 0097 R'.
046900**COBERTURA 152 - CLASSE 4
047000     03  FIL  PIC X(031) VALUE '112 1224365 0000 9999 99 0152 R'.
047100**COBERTURA 153 - CLASSE 4
047200     03  FIL  PIC X(031) VALUE '112 1224366 0000 9999 99 0153 R'.
047300**COBERTURA 154 - CLASSE 4
047400     03  FIL  PIC X(031) VALUE '112 1224367 0000 9999 99 0154 R'.
047500**COBERTURA 155 - CLASSE 4
047600**   03  FIL  PIC X(031) VALUE '112 1224368 0000 9999 99 0155 R'.
047700**COBERTURA 156 - CLASSE 4
047800     03  FIL  PIC X(031) VALUE '112 1224369 0000 9999 99 0156 R'.
047900**COBERTURA 157 - CLASSE 4
048000     03  FIL  PIC X(031) VALUE '112 1224370 0000 9999 99 0157 R'.
048100**COBERTURA 158 - CLASSE 4
048200     03  FIL  PIC X(031) VALUE '112 1224371 0000 9999 99 0158 R'.
048300**COBERTURA 159 - CLASSE 4
048400     03  FIL  PIC X(031) VALUE '112 1224372 0000 9999 99 0159 R'.
048500**COBERTURA 22 - CLASSE 3
048600**   03  FIL  PIC X(031) VALUE '112 0122391 0000 9999 99 0022 R'.
048700**COBERTURA 23 - CLASSE 3
048800**   03  FIL  PIC X(031) VALUE '112 0122392 0000 9999 99 0023 R'.
048900**COBERTURA 28 - CLASSE 3
049000**   03  FIL  PIC X(031) VALUE '112 0122393 0000 9999 99 0028 R'.
049100**COBERTURA 33 - CLASSE 3
049200**   03  FIL  PIC X(031) VALUE '112 0122394 0000 9999 99 0033 R'.
049300**COBERTURA 41 - CLASSE 3
049400**   03  FIL  PIC X(031) VALUE '112 0122395 0000 9999 99 0041 R'.
049500**COBERTURA 44 - CLASSE 3
049600**   03  FIL  PIC X(031) VALUE '112 0122396 0000 9999 99 0044 R'.
049700**COBERTURA 55 - CLASSE 3
049800**   03  FIL  PIC X(031) VALUE '112 0122397 0000 9999 99 0055 R'.
049900**COBERTURA 56 - CLASSE 3
050000**   03  FIL  PIC X(031) VALUE '112 0122398 0000 9999 99 0056 R'.
050100**COBERTURA 122 - CLASSE 3
050200**   03  FIL  PIC X(031) VALUE '112 0122399 0000 9999 99 0122 R'.
050300**COBERTURA 123 - CLASSE 3
050400**   03  FIL  PIC X(031) VALUE '112 1223910 0000 9999 99 0123 R'.
050500**COBERTURA 57 - CLASSE 3
050600**   03  FIL  PIC X(031) VALUE '112 1223911 0000 9999 99 0057 R'.
050700**COBERTURA 124 - CLASSE 3
050800**   03  FIL  PIC X(031) VALUE '112 1223912 0000 9999 99 0124 R'.
050900**COBERTURA 125 - CLASSE 3
051000**   03  FIL  PIC X(031) VALUE '112 1223913 0000 9999 99 0125 R'.
051100**COBERTURA 120 - CLASSE 3
051200     03  FIL  PIC X(031) VALUE '112 1223914 0000 9999 99 0120 R'.
051300**COBERTURA 121 - CLASSE 3
051400     03  FIL  PIC X(031) VALUE '112 1223915 0000 9999 99 0121 R'.
051500**COBERTURA 098 - CLASSE 3
051600**   03  FIL  PIC X(031) VALUE '112 1223916 0000 9999 99 0098 R'.
051700**COBERTURA 064 - CLASSE 3
051800**   03  FIL  PIC X(031) VALUE '112 1223917 0000 9999 99 0064 R'.
051900**COBERTURA 066 - CLASSE 3
052000**   03  FIL  PIC X(031) VALUE '112 1223918 0000 9999 99 0066 R'.
052100**COBERTURA 068 - CLASSE 3
052200**   03  FIL  PIC X(031) VALUE '112 1223919 0000 9999 99 0068 R'.
052300**COBERTURA 070 - CLASSE 3
052400**   03  FIL  PIC X(031) VALUE '112 1223920 0000 9999 99 0070 R'.
052500**COBERTURA 126 - CLASSE 3
052600**   03  FIL  PIC X(031) VALUE '112 1223921 0000 9999 99 0126 R'.
052700**COBERTURA 127 - CLASSE 3
052800**   03  FIL  PIC X(031) VALUE '112 1223922 0000 9999 99 0127 R'.
052900**COBERTURA 137 - CLASSE 3
053000**   03  FIL  PIC X(031) VALUE '112 1223923 0000 9999 99 0137 R'.
053100**COBERTURA 138 - CLASSE 3
053200**   03  FIL  PIC X(031) VALUE '112 1223924 0000 9999 99 0138 R'.
053300******* RESIDENCIAL *******
053400**COBERTURA 13 - CLASSE 3
053500     03  FIL  PIC X(031) VALUE '113 0123331 0000 9999 02 0013 N'.
053600**COBERTURA 11 - CLASSE 3
053700     03  FIL  PIC X(031) VALUE '113 0123332 0000 9999 02 0011 N'.
053800**COBERTURA 19 - CLASSE 3
053900*****03  FIL  PIC X(031) VALUE '113 0123333 0000 9999 99 0019 N'.
054000**COBERTURA 22 - CLASSE 3
054100*****03  FIL  PIC X(031) VALUE '113 0123334 0000 9999 99 0022 N'.
054200**COBERTURA 23 - CLASSE 3
054300*****03  FIL  PIC X(031) VALUE '113 0123335 0000 9999 99 0023 N'.
054400**COBERTURA 25 - CLASSE 3
054500*****03  FIL  PIC X(031) VALUE '113 0123336 0000 9999 99 0025 N'.
054600**COBERTURA 26 - CLASSE 3
054700     03  FIL  PIC X(031) VALUE '113 0123337 0000 9999 99 0026 N'.
054800**COBERTURA 27 - CLASSE 3
054900*****03  FIL  PIC X(031) VALUE '113 0123338 0000 9999 99 0027 N'.
055000**COBERTURA 28 - CLASSE 3
055100*****03  FIL  PIC X(031) VALUE '113 0123339 0000 9999 99 0028 N'.
055200**COBERTURA 29 - CLASSE 3
055300*****03  FIL  PIC X(031) VALUE '113 0123340 0000 9999 99 0029 N'.
055400**COBERTURA 30 - CLASSE 3
055500*****03  FIL  PIC X(031) VALUE '113 0123342 0000 9999 99 0030 N'.
055600**COBERTURA 31 - CLASSE 3
055700*****03  FIL  PIC X(031) VALUE '113 0123343 0000 9999 99 0031 N'.
055800**COBERTURA 16 - CLASSE 3
055900*****03  FIL  PIC X(031) VALUE '113 0123344 0000 9999 99 0016 N'.
056000**COBERTURA 13 - CLASSE 4
056100*****03  FIL  PIC X(031) VALUE '113 0123431 0000 9999 01 0013 R'.
056200**COBERTURA 11 - CLASSE 4
056300*****03  FIL  PIC X(031) VALUE '113 0123432 0000 9999 01 0011 R'.
056400**COBERTURA 16 - CLASSE 4
056500*****03  FIL  PIC X(031) VALUE '113 0123433 0000 9999 99 0016 R'.
056600******* CONDOMINIO *******
056700**COBERTURA 10 - CLASSE 4
056800     03  FIL  PIC X(031) VALUE '114 0124421 0000 9999 99 0010 R'.
056900**COBERTURA 13 - CLASSE 4
057000     03  FIL  PIC X(031) VALUE '114 0124422 0000 9999 99 0013 R'.
057100******* EMPRESARIAL *******
057200** OCUPACAO/RUBRICA VR SUPERIOR A 1.500.000,00
057300** 122451 A 1224528 - CLASSE 4
057400*
057500** OCUPACAO/RUBRICA
057600** 122491 A 122515 - CLASSE 4
057700** 1224100 A 1224118 - CLASSE 4
057800
057900 01  TAB-COB-ACEIT-X  REDEFINES  TAB-COB-ACEIT.
058000     03  TAB-COB-ACEIT-Y     OCCURS  53   TIMES.
058100         05  COD-RAMO-COB-A       PIC  9(003).
058200         05  FILLER               PIC  X(001).
058300         05  COD-NORMA-COB-A      PIC  9(007).
058400         05  FILLER               PIC  X(001).
058500         05  COD-TARF-I-COB-A     PIC  9(004).
058600         05  FILLER               PIC  X(001).
058700         05  COD-TARF-F-COB-A     PIC  9(004).
058800         05  FILLER               PIC  X(001).
058900         05  COD-CONSTR-COB-A     PIC  9(002).
059000         05  FILLER               PIC  X(001).
059100         05  COD-COB-A            PIC  9(004).
059200         05  FILLER               PIC  X(001).
059300         05  TIP-ACEIT-COB-A      PIC  X(001).
059400************ INDEXADOR DESTA TABELA : NUM-OCOR-COB-A ***********
059500 01  NUM-OCOR-COB-A             PIC  9(003)     VALUE 53.
059600
059700*================================================================*
059800**                      C O B E R T U R A S                     **
059900*================================================================*
060000*  CONFORME NORMA 113 => 3-3-X E 4-3-4
060100*                 114 => 3-3
060200*
060300*  TIP-ACEIT-COB-B
060400*        R - ACEITACAO RESTRITA
060500*        N - NAO SERA ACEITA
060600*
060700*  CASO NAO ESTEJA NESSA LISTA EH ACEITO
060800
060900 01  TAB-COB-ACEIT-2.
061000******* EMPRESARIAL *******
061100** OCUPACAO/RUBRICA 122321 A 1223254 - CLASSE 3
061200******* RESIDENCIAL *******
061300**COBERTURA 15 - CLASF. 001-12 - CLASSE 3
061400     03  FIL  PIC X(027) VALUE '113 01233331 001  12 0015 N'.
061500**COBERTURA 20 - CLASF. 001-12 - CLASSE 3
061600     03  FIL  PIC X(027) VALUE '113 01233332 001  12 0020 N'.
061700**COBERTURA 15 - CLASF. 001-22 - CLASSE 3
061800     03  FIL  PIC X(027) VALUE '113 01233341 001  22 0015 N'.
061900**COBERTURA 20 - CLASF. 001-22 - CLASSE 3
062000     03  FIL  PIC X(027) VALUE '113 01233342 001  22 0020 N'.
062100**COBERTURA 15 - CLASF. 001-13 - CLASSE 3
062200     03  FIL  PIC X(027) VALUE '113 01233351 001  13 0015 N'.
062300**COBERTURA 16 - CLASF. 001-13 - CLASSE 3
062400*****03  FIL  PIC X(027) VALUE '113 01233352 001  13 0016 N'.
062500**COBERTURA 07 - CLASF. 001-13 - CLASSE 3
062600     03  FIL  PIC X(027) VALUE '113 01233353 001  13 0007 N'.
062700**COBERTURA 08 - CLASF. 001-13 - CLASSE 3
062800     03  FIL  PIC X(027) VALUE '113 01233354 001  13 0008 N'.
062900**COBERTURA 15 - CLASF. 001-23 - CLASSE 3
063000     03  FIL  PIC X(027) VALUE '113 01233361 001  23 0015 N'.
063100**COBERTURA 16 - CLASF. 001-23 - CLASSE 3
063200*****03  FIL  PIC X(027) VALUE '113 01233362 001  23 0016 N'.
063300**COBERTURA 07 - CLASF. 001-23 - CLASSE 3
063400     03  FIL  PIC X(027) VALUE '113 01233363 001  23 0007 N'.
063500**COBERTURA 08 - CLASF. 001-23 - CLASSE 3
063600     03  FIL  PIC X(027) VALUE '113 01233364 001  23 0008 N'.
063700**COBERTURA 04 - CLASF. 001-13 - CLASSE 4
063800     03  FIL  PIC X(027) VALUE '113 01234341 001  13 0004 R'.
063900**COBERTURA 05 - CLASF. 001-13 - CLASSE 4
064000     03  FIL  PIC X(027) VALUE '113 01234342 001  13 0005 R'.
064100**COBERTURA 06 - CLASF. 001-13 - CLASSE 4
064200     03  FIL  PIC X(027) VALUE '113 01234343 001  13 0006 R'.
064300**COBERTURA 04 - CLASF. 001-23 - CLASSE 4
064400     03  FIL  PIC X(027) VALUE '113 01234351 001  23 0004 R'.
064500**COBERTURA 05 - CLASF. 001-23 - CLASSE 4
064600     03  FIL  PIC X(027) VALUE '113 01234352 001  23 0005 R'.
064700**COBERTURA 06 - CLASF. 001-23 - CLASSE 4
064800     03  FIL  PIC X(027) VALUE '113 01234353 001  23 0006 R'.
064900******* CONDOMINIO *******
065000**COBERTURA 02 - CLASF. 001-17 - CLASSE 3
065100     03  FIL  PIC X(027) VALUE '114 01243311 001  17 0002 N'.
065200**COBERTURA 04 - CLASF. 001-17 - CLASSE 3
065300     03  FIL  PIC X(027) VALUE '114 01243312 001  17 0004 N'.
065400**COBERTURA 07 - CLASF. 001-17 - CLASSE 3
065500     03  FIL  PIC X(027) VALUE '114 01243313 001  17 0007 N'.
065600**COBERTURA 08 - CLASF. 001-17 - CLASSE 3
065700     03  FIL  PIC X(027) VALUE '114 01243314 001  17 0008 N'.
065800**COBERTURA 14 - CLASF. 001-17 - CLASSE 3
065900     03  FIL  PIC X(027) VALUE '114 01243315 001  17 0014 N'.
066000**COBERTURA 19 - CLASF. 001-17 - CLASSE 3
066100     03  FIL  PIC X(027) VALUE '114 01243316 001  17 0019 N'.
066200**COBERTURA 21 - CLASF. 001-17 - CLASSE 3
066300     03  FIL  PIC X(027) VALUE '114 01243317 001  17 0021 N'.
066400**COBERTURA 22 - CLASF. 001-17 - CLASSE 3
066500     03  FIL  PIC X(027) VALUE '114 01243318 001  17 0022 N'.
066600**COBERTURA 24 - CLASF. 001-17 - CLASSE 3
066700     03  FIL  PIC X(027) VALUE '114 01243319 001  17 0024 N'.
066800**COBERTURA 25 - CLASF. 001-17 - CLASSE 3
066900     03  FIL  PIC X(027) VALUE '114 12433110 001  17 0025 N'.
067000**COBERTURA 02 - CLASF. 001-12 - CLASSE 3
067100     03  FIL  PIC X(027) VALUE '114 01243321 001  12 0002 N'.
067200**COBERTURA 23 - CLASF. 001-12 - CLASSE 3
067300     03  FIL  PIC X(027) VALUE '114 01243322 001  12 0023 N'.
067400**COBERTURA 24 - CLASF. 001-12 - CLASSE 3
067500     03  FIL  PIC X(027) VALUE '114 01243323 001  12 0024 N'.
067600**COBERTURA 02 - CLASF. 001-13 - CLASSE 3
067700     03  FIL  PIC X(027) VALUE '114 01243331 001  13 0002 N'.
067800**COBERTURA 23 - CLASF. 001-13 - CLASSE 3
067900     03  FIL  PIC X(027) VALUE '114 01243332 001  13 0023 N'.
068000**COBERTURA 24 - CLASF. 001-13 - CLASSE 3
068100     03  FIL  PIC X(027) VALUE '114 01243333 001  13 0024 N'.
068200**COBERTURA 02 - CLASF. 001-14 - CLASSE 3
068300     03  FIL  PIC X(027) VALUE '114 01243341 001  14 0002 N'.
068400**COBERTURA 21 - CLASF. 001-14 - CLASSE 3
068500     03  FIL  PIC X(027) VALUE '114 01243342 001  14 0021 N'.
068600**COBERTURA 23 - CLASF. 001-14 - CLASSE 3
068700     03  FIL  PIC X(027) VALUE '114 01243343 001  14 0023 N'.
068800**COBERTURA 24 - CLASF. 001-14 - CLASSE 3
068900     03  FIL  PIC X(027) VALUE '114 01243344 001  14 0024 N'.
069000**COBERTURA 02 - CLASF. 001-15 - CLASSE 3
069100     03  FIL  PIC X(027) VALUE '114 01243351 001  15 0002 N'.
069200**COBERTURA 23 - CLASF. 001-15 - CLASSE 3
069300     03  FIL  PIC X(027) VALUE '114 01243352 001  15 0023 N'.
069400**COBERTURA 24 - CLASF. 001-15 - CLASSE 3
069500     03  FIL  PIC X(027) VALUE '114 01243353 001  15 0024 N'.
069600**COBERTURA 02 - CLASF. 001-16 - CLASSE 3
069700     03  FIL  PIC X(027) VALUE '114 01243361 001  16 0002 N'.
069800**COBERTURA 07 - CLASF. 001-16 - CLASSE 3
069900     03  FIL  PIC X(027) VALUE '114 01243362 001  16 0007 N'.
070000**COBERTURA 20 - CLASF. 001-16 - CLASSE 3
070100     03  FIL  PIC X(027) VALUE '114 01243363 001  16 0020 N'.
070200**COBERTURA 23 - CLASF. 001-16 - CLASSE 3
070300     03  FIL  PIC X(027) VALUE '114 01243364 001  16 0023 N'.
070400**COBERTURA 24 - CLASF. 001-16 - CLASSE 3
070500     03  FIL  PIC X(027) VALUE '114 01243365 001  16 0024 N'.
070600
070700 01  TAB-COB-ACEIT-2-X  REDEFINES  TAB-COB-ACEIT-2.
070800     03  TAB-COB-ACEIT-Z     OCCURS  44   TIMES.
070900         05  COD-RAMO-COB-B       PIC  9(003).
071000         05  FILLER               PIC  X(001).
071100         05  COD-NORMA-COB-B      PIC  9(008).
071200         05  FILLER               PIC  X(001).
071300         05  COD-CLASF-B          PIC  X(004).
071400         05  FILLER               PIC  X(001).
071500         05  COD-COMPL-CLASF-B    PIC  X(002).
071600         05  FILLER               PIC  X(001).
071700         05  COD-COB-B            PIC  9(004).
071800         05  FILLER               PIC  X(001).
071900         05  TIP-ACEIT-COB-B      PIC  X(001).
072000************ INDEXADOR DESTA TABELA : NUM-OCOR-COB-B ***********
072100 01  NUM-OCOR-COB-B             PIC  9(003)     VALUE 44.
072200
072300*============================================================*
072400*             CRITERIOS DE INSPECAO OBRIGATORIA              *
072500*============================================================*
072600
072700 01  TAB-INSP-OBRIG-WS.
072800     03 FIL PIC X(30) VALUE '112 999999 99 0001 00040000000'.
072900     03 FIL PIC X(30) VALUE '112 999999 99 0005 00004000000'.
073000     03 FIL PIC X(30) VALUE '112 999999 99 0009 00004000000'.
073100     03 FIL PIC X(30) VALUE '112 999999 99 0010 00004000000'.
073200     03 FIL PIC X(30) VALUE '112 999999 99 0028 00020000000'.
073300     03 FIL PIC X(30) VALUE '112 999999 99 0029 00020000000'.
073400     03 FIL PIC X(30) VALUE '112 999999 99 0035 00020000000'.
073500     03 FIL PIC X(30) VALUE '112 999999 99 0051 00020000000'.
073600     03 FIL PIC X(30) VALUE '112 999999 99 0033 00000000000'.
073700     03 FIL PIC X(30) VALUE '112 999999 99 0034 00000000000'.
073800     03 FIL PIC X(30) VALUE '112 999999 99 0038 00020000000'.
073900     03 FIL PIC X(30) VALUE '112 999999 99 0053 00005000000'.
074000     03 FIL PIC X(30) VALUE '112 999999 99 0055 00000000000'.
074100     03 FIL PIC X(30) VALUE '112 999999 99 0076 00004000000'.
074200     03 FIL PIC X(30) VALUE '112 999999 02 9999 00000000000'.
074300     03 FIL PIC X(30) VALUE '113 001 11 99 0001 00070000000'.
074400     03 FIL PIC X(30) VALUE '113 001 11 99 0005 00003500000'.
074500     03 FIL PIC X(30) VALUE '113 001 11 99 0020 00003500000'.
074600     03 FIL PIC X(30) VALUE '113 001 11 99 0022 00000000000'.
074700     03 FIL PIC X(30) VALUE '113 001 12 99 0001 00070000000'.
074800     03 FIL PIC X(30) VALUE '113 001 12 99 0005 00003500000'.
074900     03 FIL PIC X(30) VALUE '113 001 12 99 0025 00003500000'.
075000     03 FIL PIC X(30) VALUE '113 001 21 99 0001 00070000000'.
075100     03 FIL PIC X(30) VALUE '113 001 21 99 0005 00006000000'.
075200     03 FIL PIC X(30) VALUE '113 001 21 99 0020 00006000000'.
075300     03 FIL PIC X(30) VALUE '113 001 21 99 0022 00000000000'.
075400     03 FIL PIC X(30) VALUE '113 001 22 99 0001 00070000000'.
075500     03 FIL PIC X(30) VALUE '113 001 22 99 0005 00006000000'.
075600     03 FIL PIC X(30) VALUE '113 001 22 99 0025 00006000000'.
075700     03 FIL PIC X(30) VALUE '113 001 13 99 0001 00000000000'.
075800     03 FIL PIC X(30) VALUE '113 001 23 99 0001 00000000000'.
075900     03 FIL PIC X(30) VALUE '113 999999 01 0011 00000000000'.
076000     03 FIL PIC X(30) VALUE '113 999999 01 0013 00000000000'.
076100     03 FIL PIC X(30) VALUE '113 001 11 02 9999 00000000000'.
076200     03 FIL PIC X(30) VALUE '113 001 12 02 9999 00000000000'.
076300     03 FIL PIC X(30) VALUE '113 001 13 02 9999 00000000000'.
076400     03 FIL PIC X(30) VALUE '114 999999 99 0010 00000000000'.
076500     03 FIL PIC X(30) VALUE '114 999999 99 0013 00000000000'.
076600     03 FIL PIC X(30) VALUE '114 001 11 99 0001 01500000000'.
076700     03 FIL PIC X(30) VALUE '114 001 12 99 0001 01500000000'.
076800     03 FIL PIC X(30) VALUE '114 001 13 99 0001 00500000000'.
076900     03 FIL PIC X(30) VALUE '114 001 14 99 0001 01500000000'.
077000     03 FIL PIC X(30) VALUE '114 001 15 99 0001 00500000000'.
077100     03 FIL PIC X(30) VALUE '114 001 16 99 9999 00000000000'.
077200     03 FIL PIC X(30) VALUE '114 001 17 99 0001 01500000000'.
077300
077400 01  TAB-INSP-OBRIG-WSR REDEFINES TAB-INSP-OBRIG-WS.
077500     03  TAB-INSP       OCCURS  045  TIMES.
077600         05  COD-RAMO-INSP      PIC  9(003).
077700         05  FILLER             PIC  X(001).
077800         05  COD-CLASF-INSP     PIC  X(004).
077900         05  COD-COMPL-INSP     PIC  X(002).
078000         05  FILLER             PIC  X(001).
078100         05  COD-CONSTR-INSP    PIC  9(002).
078200         05  FILLER             PIC  X(001).
078300         05  COD-COBERT-INSP    PIC  9(004).
078400         05  FILLER             PIC  X(001).
078500         05  VAL-IS-DE-INSP     PIC  9(009)V99.
078600************ INDEXADOR DESTA TABELA : NUM-OCOR-INSP ***********
078700 01  NUM-OCOR-INSP              PIC  9(003)     VALUE 045.
078800
078900 01  TAB-INSP-OBRIG-SIN-WS.
079000     03 FIL PIC X(20) VALUE '112 0001 00001000000'.
079100     03 FIL PIC X(20) VALUE '112 0005 00001000000'.
079200     03 FIL PIC X(20) VALUE '112 0033 00000000000'.
079300     03 FIL PIC X(20) VALUE '112 0034 00000000000'.
079400     03 FIL PIC X(20) VALUE '112 0038 00001000000'.
079500     03 FIL PIC X(20) VALUE '112 0078 00001000000'.
079600     03 FIL PIC X(20) VALUE '112 0053 00001000000'.
079700     03 FIL PIC X(20) VALUE '112 0009 00001000000'.
079800     03 FIL PIC X(20) VALUE '112 0010 00001000000'.
079900     03 FIL PIC X(20) VALUE '112 0011 00001000000'.
080000     03 FIL PIC X(20) VALUE '112 0012 00001000000'.
080100     03 FIL PIC X(20) VALUE '112 0013 00001000000'.
080200     03 FIL PIC X(20) VALUE '112 0014 00001000000'.
080300     03 FIL PIC X(20) VALUE '112 0015 00001000000'.
080400     03 FIL PIC X(20) VALUE '112 0016 00001000000'.
080500     03 FIL PIC X(20) VALUE '112 0017 00001000000'.
080600     03 FIL PIC X(20) VALUE '112 0018 00001000000'.
080700     03 FIL PIC X(20) VALUE '112 0077 00001000000'.
080800     03 FIL PIC X(20) VALUE '113 0001 00001000000'.
080900     03 FIL PIC X(20) VALUE '113 0005 00001000000'.
081000     03 FIL PIC X(20) VALUE '113 0011 00000000000'.
081100     03 FIL PIC X(20) VALUE '113 0013 00000000000'.
081200     03 FIL PIC X(20) VALUE '114 0001 00001000000'.
081300     03 FIL PIC X(20) VALUE '114 0005 00001000000'.
081400     03 FIL PIC X(20) VALUE '114 0009 00001000000'.
081500     03 FIL PIC X(20) VALUE '114 0010 00000000000'.
081600     03 FIL PIC X(20) VALUE '114 0013 00000000000'.
081700
081800 01  TAB-INSP-OBRIG-SIN-WSR REDEFINES TAB-INSP-OBRIG-SIN-WS.
081900     03  TAB-INSP       OCCURS  027  TIMES.
082000         05  COD-RAMO-INSP-SIN      PIC  9(003).
082100         05  FILLER                 PIC  X(001).
082200         05  COD-COBERT-INSP-SIN    PIC  9(004).
082300         05  FILLER                 PIC  X(001).
082400         05  VAL-IS-DE-INSP-SIN     PIC  9(009)V99.
082500*********** INDEXADOR DESTA TABELA : NUM-OCOR-INSP-SIN ***********
082600 01  NUM-OCOR-INSP-SIN          PIC  9(003)     VALUE 027.
082700
082800 01  TAB-LIM-RESEG.
082900     03 FIL PIC X(032) VALUE '112 0001 0010000000000 0000 9999'.
083000     03 FIL PIC X(032) VALUE '112 0003 0005000000000 0000 9999'.
083100     03 FIL PIC X(032) VALUE '112 0007 0000312500000 0000 9999'.
083200     03 FIL PIC X(032) VALUE '112 0009 0000625000000 0000 9999'.
083300     03 FIL PIC X(032) VALUE '112 0010 0000125000000 0000 9999'.
083400     03 FIL PIC X(032) VALUE '112 0011 0000312500000 0000 9999'.
083500     03 FIL PIC X(032) VALUE '112 0012 0000312500000 0000 9999'.
083600     03 FIL PIC X(032) VALUE '112 0013 0000125000000 0000 9999'.
083700     03 FIL PIC X(032) VALUE '112 0014 0000125000000 0000 9999'.
083800     03 FIL PIC X(032) VALUE '112 0015 0000125000000 0000 9999'.
083900     03 FIL PIC X(032) VALUE '112 0016 0000125000000 0000 9999'.
084000     03 FIL PIC X(032) VALUE '112 0017 0000125000000 0000 9999'.
084100     03 FIL PIC X(032) VALUE '112 0018 0000125000000 0000 9999'.
084200     03 FIL PIC X(032) VALUE '112 0019 0000025000000 0000 9999'.
084300     03 FIL PIC X(032) VALUE '112 0020 0005000000000 0000 9999'.
084400     03 FIL PIC X(032) VALUE '112 0021 0000312500000 0000 9999'.
084500     03 FIL PIC X(032) VALUE '112 0022 0000250000000 0000 9999'.
084600     03 FIL PIC X(032) VALUE '112 0023 0000125000000 0000 9999'.
084700     03 FIL PIC X(032) VALUE '112 0024 0000048800000 0000 9999'.
084800     03 FIL PIC X(032) VALUE '112 0025 0000240000000 0000 9999'.
084900     03 FIL PIC X(032) VALUE '112 0026 0000240000000 0000 9999'.
085000     03 FIL PIC X(032) VALUE '112 0027 0005000000000 0000 9999'.
085100     03 FIL PIC X(032) VALUE '112 0028 0005000000000 0000 9999'.
085200     03 FIL PIC X(032) VALUE '112 0029 0005000000000 0000 9999'.
085300     03 FIL PIC X(032) VALUE '112 0030 0000017500000 0000 9999'.
085400     03 FIL PIC X(032) VALUE '112 0031 0005000000000 0000 9999'.
085500     03 FIL PIC X(032) VALUE '112 0032 0001250000000 0000 9999'.
085600     03 FIL PIC X(032) VALUE '112 0033 0000312500000 0000 9999'.
085700     03 FIL PIC X(032) VALUE '112 0034 0000312500000 0000 9999'.
085800     03 FIL PIC X(032) VALUE '112 0035 0001000000000 0000 9999'.
085900     03 FIL PIC X(032) VALUE '112 0038 0002000000000 0000 9999'.
086000     03 FIL PIC X(032) VALUE '112 0039 0001250000000 0000 9999'.
086100     03 FIL PIC X(032) VALUE '112 0040 0001250000000 0000 9999'.
086200     03 FIL PIC X(032) VALUE '112 0041 0001250000000 0000 9999'.
086300     03 FIL PIC X(032) VALUE '112 0042 0001250000000 0000 9999'.
086400     03 FIL PIC X(032) VALUE '112 0043 0001250000000 0000 9999'.
086500     03 FIL PIC X(032) VALUE '112 0044 0001250000000 0000 9999'.
086600     03 FIL PIC X(032) VALUE '112 0047 0001250000000 0000 9999'.
086700     03 FIL PIC X(032) VALUE '112 0050 0001250000000 0000 9999'.
086800     03 FIL PIC X(032) VALUE '112 0051 0001000000000 0000 9999'.
086900     03 FIL PIC X(032) VALUE '112 0053 0000312500000 0000 9999'.
087000     03 FIL PIC X(032) VALUE '112 0054 0000312500000 0000 9999'.
087100     03 FIL PIC X(032) VALUE '112 0055 0000312500000 0000 9999'.
087200     03 FIL PIC X(032) VALUE '112 0056 0000312500000 0000 9999'.
087300     03 FIL PIC X(032) VALUE '112 0057 0000250000000 0000 9999'.
087400     03 FIL PIC X(032) VALUE '112 0058 0000125000000 0000 9999'.
087500     03 FIL PIC X(032) VALUE '112 0059 0000250000000 0000 9999'.
087600     03 FIL PIC X(032) VALUE '112 0060 0000250000000 0000 9999'.
087700     03 FIL PIC X(032) VALUE '112 0061 0000125000000 0000 9999'.
087800     03 FIL PIC X(032) VALUE '112 0062 0000125000000 0000 9999'.
087900     03 FIL PIC X(032) VALUE '112 0063 0000125000000 0000 9999'.
088000     03 FIL PIC X(032) VALUE '112 0064 0003000000000 0000 9999'.
088100     03 FIL PIC X(032) VALUE '112 0065 0003000000000 0000 9999'.
088200     03 FIL PIC X(032) VALUE '112 0066 0003000000000 0000 9999'.
088300     03 FIL PIC X(032) VALUE '112 0067 0003000000000 0000 9999'.
088400     03 FIL PIC X(032) VALUE '112 0068 0001250000000 0000 9999'.
088500     03 FIL PIC X(032) VALUE '112 0069 0001250000000 0000 9999'.
088600     03 FIL PIC X(032) VALUE '112 0070 0001250000000 0000 9999'.
088700     03 FIL PIC X(032) VALUE '112 0071 0001250000000 0000 9999'.
088800     03 FIL PIC X(032) VALUE '112 0072 0001250000000 0000 9999'.
088900     03 FIL PIC X(032) VALUE '112 0073 0001250000000 0000 9999'.
089000     03 FIL PIC X(032) VALUE '112 0074 0001250000000 0000 9999'.
089100     03 FIL PIC X(032) VALUE '112 0075 0001250000000 0000 9999'.
089200     03 FIL PIC X(032) VALUE '112 0076 0000125000000 0000 9999'.
089300     03 FIL PIC X(032) VALUE '112 0077 0000312500000 0000 9999'.
089400     03 FIL PIC X(032) VALUE '112 0078 0000100000000 0000 9999'.
089500     03 FIL PIC X(032) VALUE '112 0079 0000100000000 0000 9999'.
089600     03 FIL PIC X(032) VALUE '112 0080 0000625000000 0000 9999'.
089700     03 FIL PIC X(032) VALUE '112 0081 0000050000000 0000 9999'.
089800     03 FIL PIC X(032) VALUE '112 0082 0000500000000 0000 9999'.
089900     03 FIL PIC X(032) VALUE '112 0083 0000500000000 0000 9999'.
090000     03 FIL PIC X(032) VALUE '112 0084 0001250000000 0000 9999'.
090100     03 FIL PIC X(032) VALUE '112 0085 0001250000000 0000 9999'.
090200     03 FIL PIC X(032) VALUE '112 0086 0001250000000 0000 9999'.
090300     03 FIL PIC X(032) VALUE '112 0087 0001250000000 0000 9999'.
090400     03 FIL PIC X(032) VALUE '112 0088 0001250000000 0000 9999'.
090500     03 FIL PIC X(032) VALUE '112 0094 0000125000000 0000 9999'.
090600     03 FIL PIC X(032) VALUE '112 0095 0000100000000 0000 9999'.
090700     03 FIL PIC X(032) VALUE '112 0097 0000500000000 0000 9999'.
090800     03 FIL PIC X(032) VALUE '112 0098 0001250000000 0000 9999'.
090900     03 FIL PIC X(032) VALUE '112 0099 0001250000000 0000 9999'.
091000     03 FIL PIC X(032) VALUE '112 0100 0001250000000 0000 9999'.
091100     03 FIL PIC X(032) VALUE '112 0101 0001250000000 0000 9999'.
091200     03 FIL PIC X(032) VALUE '112 0102 0000312500000 0000 9999'.
091300     03 FIL PIC X(032) VALUE '112 0103 0000625000000 0000 9999'.
091400     03 FIL PIC X(032) VALUE '112 0104 0000312500000 0000 9999'.
091500     03 FIL PIC X(032) VALUE '112 0105 0000312500000 0000 9999'.
091600     03 FIL PIC X(032) VALUE '112 0106 0000312500000 0000 9999'.
091700     03 FIL PIC X(032) VALUE '112 0107 0000125000000 0000 9999'.
091800     03 FIL PIC X(032) VALUE '112 0108 0000125000000 0000 9999'.
091900     03 FIL PIC X(032) VALUE '112 0109 0000125000000 0000 9999'.
092000     03 FIL PIC X(032) VALUE '112 0110 0000125000000 0000 9999'.
092100     03 FIL PIC X(032) VALUE '112 0111 0000125000000 0000 9999'.
092200     03 FIL PIC X(032) VALUE '112 0112 0000125000000 0000 9999'.
092300     03 FIL PIC X(032) VALUE '112 0113 0000125000000 0000 9999'.
092400     03 FIL PIC X(032) VALUE '112 0114 0001250000000 0000 9999'.
092500     03 FIL PIC X(032) VALUE '112 0115 0001250000000 0000 9999'.
092600     03 FIL PIC X(032) VALUE '112 0116 0005000000000 0000 9999'.
092700     03 FIL PIC X(032) VALUE '112 0117 0000100000000 0000 9999'.
092800     03 FIL PIC X(032) VALUE '112 0118 0000000000100 0000 9999'.
092900     03 FIL PIC X(032) VALUE '112 0119 0000250000000 0000 9999'.
093000     03 FIL PIC X(032) VALUE '112 0120 0000000000100 0000 9999'.
093100     03 FIL PIC X(032) VALUE '112 0121 0000100000000 0000 9999'.
093200     03 FIL PIC X(032) VALUE '112 0122 0000312500000 0000 9999'.
093300     03 FIL PIC X(032) VALUE '112 0123 0000312500000 0000 9999'.
093400     03 FIL PIC X(032) VALUE '112 0124 0000250000000 0000 9999'.
093500     03 FIL PIC X(032) VALUE '112 0125 0000250000000 0000 9999'.
093600     03 FIL PIC X(032) VALUE '112 0126 0001250000000 0000 9999'.
093700     03 FIL PIC X(032) VALUE '112 0127 0001250000000 0000 9999'.
093800     03 FIL PIC X(032) VALUE '112 0128 0001250000000 0000 9999'.
093900     03 FIL PIC X(032) VALUE '112 0129 0001250000000 0000 9999'.
094000     03 FIL PIC X(032) VALUE '112 0130 0001250000000 0000 9999'.
094100     03 FIL PIC X(032) VALUE '112 0131 0001250000000 0000 9999'.
094200     03 FIL PIC X(032) VALUE '112 0132 0001250000000 0000 9999'.
094300     03 FIL PIC X(032) VALUE '112 0133 0001250000000 0000 9999'.
094400     03 FIL PIC X(032) VALUE '112 0134 0001250000000 0000 9999'.
094500     03 FIL PIC X(032) VALUE '112 0135 0001250000000 0000 9999'.
094600     03 FIL PIC X(032) VALUE '112 0136 0001250000000 0000 9999'.
094700     03 FIL PIC X(032) VALUE '112 0137 0001250000000 0000 9999'.
094800     03 FIL PIC X(032) VALUE '112 0138 0001250000000 0000 9999'.
094900     03 FIL PIC X(032) VALUE '112 0139 0001250000000 0000 9999'.
095000     03 FIL PIC X(032) VALUE '112 0140 0001250000000 0000 9999'.
095100     03 FIL PIC X(032) VALUE '112 0141 0001250000000 0000 9999'.
095200     03 FIL PIC X(032) VALUE '112 0142 0001250000000 0000 9999'.
095300     03 FIL PIC X(032) VALUE '112 0143 0001250000000 0000 9999'.
095400     03 FIL PIC X(032) VALUE '112 0144 0001250000000 0000 9999'.
095500     03 FIL PIC X(032) VALUE '112 0145 0001250000000 0000 9999'.
095600     03 FIL PIC X(032) VALUE '112 0146 0001250000000 0000 9999'.
095700     03 FIL PIC X(032) VALUE '112 0147 0001250000000 0000 9999'.
095800     03 FIL PIC X(032) VALUE '112 0148 0001250000000 0000 9999'.
095900     03 FIL PIC X(032) VALUE '112 0149 0001250000000 0000 9999'.
096000     03 FIL PIC X(032) VALUE '112 0150 0001250000000 0000 9999'.
096100     03 FIL PIC X(032) VALUE '112 0151 0001250000000 0000 9999'.
096200     03 FIL PIC X(032) VALUE '112 0152 0000250000000 0000 9999'.
096300     03 FIL PIC X(032) VALUE '112 0153 0000250000000 0000 9999'.
096400     03 FIL PIC X(032) VALUE '112 0154 0000250000000 0000 9999'.
096500     03 FIL PIC X(032) VALUE '112 0155 0000250000000 0000 9999'.
096600     03 FIL PIC X(032) VALUE '112 0156 0000250000000 0000 9999'.
096700     03 FIL PIC X(032) VALUE '112 0157 0000250000000 0000 9999'.
096800     03 FIL PIC X(032) VALUE '112 0158 0000250000000 0000 9999'.
096900     03 FIL PIC X(032) VALUE '112 0159 0000250000000 0000 9999'.
097000     03 FIL PIC X(032) VALUE '113 0001 0000180000000 0000 9999'.
097100     03 FIL PIC X(032) VALUE '113 0002 0000090000000 0000 9999'.
097200     03 FIL PIC X(032) VALUE '113 0003 0000180000000 0000 9999'.
097300     03 FIL PIC X(032) VALUE '113 0004 0000017500000 0000 9999'.
097400     03 FIL PIC X(032) VALUE '113 0005 0000036000000 0000 9999'.
097500     03 FIL PIC X(032) VALUE '113 0006 0000090000000 0000 9999'.
097600     03 FIL PIC X(032) VALUE '113 0007 0000018000000 0000 9999'.
097700     03 FIL PIC X(032) VALUE '113 0008 0000018000000 0000 9999'.
097800     03 FIL PIC X(032) VALUE '113 0009 0000036000000 0000 9999'.
097900     03 FIL PIC X(032) VALUE '113 0010 0000036000000 0000 9999'.
098000     03 FIL PIC X(032) VALUE '113 0011 0000090000000 0000 9999'.
098100     03 FIL PIC X(032) VALUE '113 0012 0000036000000 0000 9999'.
098200     03 FIL PIC X(032) VALUE '113 0013 0000036000000 0000 9999'.
098300     03 FIL PIC X(032) VALUE '113 0014 0000180000000 0000 9999'.
098400     03 FIL PIC X(032) VALUE '113 0015 0000036000000 0000 9999'.
098500     03 FIL PIC X(032) VALUE '113 0016 0000018000000 0000 9999'.
098600     03 FIL PIC X(032) VALUE '113 0018 0000090000000 0000 9999'.
098700     03 FIL PIC X(032) VALUE '113 0024 0000036000000 0000 9999'.
098800     03 FIL PIC X(032) VALUE '113 0025 0000036000000 0000 9999'.
098900     03 FIL PIC X(032) VALUE '113 0026 0000036000000 0000 9999'.
099000     03 FIL PIC X(032) VALUE '113 0027 0000036000000 0000 9999'.
099100     03 FIL PIC X(032) VALUE '114 0001 0006000000000 0000 9999'.
099200     03 FIL PIC X(032) VALUE '114 0002 0000600000000 0000 9999'.
099300     03 FIL PIC X(032) VALUE '114 0003 0003000000000 0000 9999'.
099400     03 FIL PIC X(032) VALUE '114 0004 0000017500000 0000 9999'.
099500     03 FIL PIC X(032) VALUE '114 0005 0000025000000 0000 9999'.
099600     03 FIL PIC X(032) VALUE '114 0006 0000250000000 0000 9999'.
099700     03 FIL PIC X(032) VALUE '114 0007 0000250000000 0000 9999'.
099800     03 FIL PIC X(032) VALUE '114 0008 0000250000000 0000 9999'.
099900     03 FIL PIC X(032) VALUE '114 0009 0000600000000 0000 9999'.
100000     03 FIL PIC X(032) VALUE '114 0010 0000312500000 0000 9999'.
100100     03 FIL PIC X(032) VALUE '114 0013 0000312500000 0000 9999'.
100200     03 FIL PIC X(032) VALUE '114 0014 0003000000000 0000 9999'.
100300     03 FIL PIC X(032) VALUE '114 0015 0000040000000 0000 9999'.
100400     03 FIL PIC X(032) VALUE '114 0016 0000040000000 0000 9999'.
100500     03 FIL PIC X(032) VALUE '114 0017 0000040000000 0000 9999'.
100600     03 FIL PIC X(032) VALUE '114 0018 0003000000000 0000 9999'.
100700     03 FIL PIC X(032) VALUE '114 0019 0000100000000 0000 9999'.
100800     03 FIL PIC X(032) VALUE '114 0020 0000250000000 0000 9999'.
100900     03 FIL PIC X(032) VALUE '114 0021 0000031200000 0000 9999'.
101000     03 FIL PIC X(032) VALUE '114 0022 0000312500000 0000 9999'.
101100     03 FIL PIC X(032) VALUE '114 0023 0001800000000 0000 9999'.
101200     03 FIL PIC X(032) VALUE '114 0024 0000012500000 0000 9999'.
101300     03 FIL PIC X(032) VALUE '114 0025 0000312500000 0000 9999'.
101400
101500 01  TAB-LIM-RESEG-R    REDEFINES TAB-LIM-RESEG.
101600     03  TAB-LIM        OCCURS  185  TIMES.
101700         05  COD-RAMO-LIM       PIC  9(003).
101800         05  FILLER             PIC  X(001).
101900         05  COD-COBERT-LIM     PIC  9(004).
102000         05  FILLER             PIC  X(001).
102100         05  VAL-IS-LIM         PIC  9(011)V99.
102200         05  FILLER             PIC  X(001).
102300         05  COD-TARF-I-LIM     PIC  9(004).
102400         05  FILLER             PIC  X(001).
102500         05  COD-TARF-F-LIM     PIC  9(004).
102600************ INDEXADOR DESTA TABELA : NUM-OCOR-INSP ***********
102700 01  NUM-OCOR-RESS              PIC  9(003)     VALUE 185.
102800
102900 01  TAB-CLASSE-112             PIC  9(001).
103000     88  CLASSE-4-112           VALUE 1.
103100     88  CLASSE-1-112           VALUE 2.
103200
103300 01  TAB-COB-LIB                PIC  9(004).
103400     88  COB-LIB                VALUE 0056 0057 0059 0060 0063
103500                                      0064 0066 0072 0074.
103600 01  CORR-LIB                   PIC  X(003) VALUES 'NAO'.
103700 01  CORR-LIB2                  PIC  X(003) VALUES 'NAO'.
103800 01  CORR-LIB-HELLNER           PIC  X(003) VALUES 'NAO'.
103900 01  CORR-LIB-AON               PIC  X(003) VALUES 'NAO'.
104000 01  CORR-LIB-PROSER-ACF        PIC  X(003) VALUES 'NAO'.
104100 01  CORR-LIB-APISUL            PIC  X(003) VALUES 'NAO'.
104200 01  CORR-LIB-SOS               PIC  X(003) VALUES 'NAO'.
104300 01  CORR-LIB-RESIDENCIAL       PIC  X(003) VALUES 'NAO'.
104400 01  CORR-LIB-MARSH             PIC  X(003) VALUES 'NAO'.
104500 01  CORR-LIB-MERCEDES          PIC  X(003) VALUES 'NAO'.
104600 01  CORR-LIB-MARINE            PIC  X(003) VALUES 'NAO'.
104700 01  CORR-LIB-PUNCH             PIC  X(003) VALUES 'NAO'.
104800 01  CORR-LIB-GANDINI           PIC  X(003) VALUES 'NAO'.
104900 01  CORR-LIB-AON-HOLD          PIC  X(003) VALUES 'NAO'.
105000 01  CORR-LIB-RUBR-019          PIC  X(003) VALUES 'NAO'.
105100 01  CORR-LIB-JUL-09            PIC  X(003) VALUES 'NAO'.
105200 01  CORR-LIB-VOLKS-RES         PIC  X(003) VALUES 'NAO'.
105300 01  CORR-LIB-AON-HOLD-RS       PIC  X(003) VALUES 'NAO'.
105400 01  CORR-LIB-AON-HOLD-SP       PIC  X(003) VALUES 'NAO'.
105500 01  CORR-LIB-ADD               PIC  X(003) VALUES 'NAO'.
105600 01  CORR-LIB-LOCK              PIC  X(003) VALUES 'NAO'.
105700 01  CORR-LIB-LAZAM             PIC  X(003) VALUES 'NAO'.
105800 01  CORR-LIB-MAHESO            PIC  X(003) VALUES 'NAO'.
105900 01  CORR-LIB-AON-HOLD-PR       PIC  X(003) VALUES 'NAO'.
106000 01  CORR-LIB-RECIFE            PIC  X(003) VALUES 'NAO'.
106100 01  CORR-LIB-SEKURIT           PIC  X(003) VALUES 'NAO'.
106200 01  CORR-LIB-AON-HOLD-RJ       PIC  X(003) VALUES 'NAO'.
106300**FICHA 1001144
106400 01  CORR-LIB-AON-HOLD-MACAE    PIC  X(003) VALUES 'NAO'.
106500**FICHA 1000655
106600 01  CORR-LIB-SCAVASEG          PIC  X(003) VALUES 'NAO'.
106700 01  CORR-LIB-SEGURALTA         PIC  X(003) VALUES 'NAO'.
106800 01  CORR-LIB-TONETTE           PIC  X(003) VALUES 'NAO'.
106900 01  CORR-LIB-LARES             PIC  X(003) VALUES 'NAO'.
107000 01  CORR-LIB-ASSIS             PIC  X(003) VALUES 'NAO'.
107100 01  CORR-LIB-GARSEG            PIC  X(003) VALUES 'NAO'.
107200 01  CORR-LIB-INVEST            PIC  X(003) VALUES 'NAO'.
107300 01  CORR-LIB-DL                PIC  X(003) VALUES 'NAO'.
107400**FICHA 1000744
107500 01  CORR-LIB-ENSEG             PIC  X(003) VALUES 'NAO'.
107600 01  CORR-LIB-HONDA             PIC  X(003) VALUES 'NAO'.
107700**FICHA 1000851
107800 01  CORR-LIB-WALKER            PIC  X(003) VALUES 'NAO'.
107900**FICHA 1000970
108000 01  CORR-LIB-AON-HOLD-ES       PIC  X(003) VALUES 'NAO'.
108100
108300     COPY         C00W004A.CPY.
108500
108600*----------------------------------------------------------------*
108700*                  DEFINICAO DAS VARIAVEIS HOST                  *
108800*----------------------------------------------------------------*
108900
109000     EXEC SQL  BEGIN DECLARE SECTION  END-EXEC.
109100
109200*----------------------------------------------------------------*
109300*    TAB_PED                                                     *
109400*----------------------------------------------------------------*
109500 01  COD-ORG                    PIC S9(002)     PACKED-DECIMAL.
109600 01  COD-RAMO                   PIC S9(003)     PACKED-DECIMAL.
109700 01  NUM-PED                    PIC S9(006)     PACKED-DECIMAL.
109800 01  NUM-BILHETE                PIC S9(010)     PACKED-DECIMAL.
109900 01  NUM-APOL                   PIC S9(010)     PACKED-DECIMAL.
110000 01  COD-REG                    PIC S9(003)     PACKED-DECIMAL.
110100 01  COD-BCO-COBR               PIC S9(003)     PACKED-DECIMAL.
110200 01  COD-AGEN-ANGAR             PIC S9(004)     PACKED-DECIMAL.
110300 01  COD-AGEN-INDICR            PIC S9(004)     PACKED-DECIMAL.
110400 01  NUM-CTA-INDICR             PIC S9(007)     PACKED-DECIMAL.
110500 01  COD-UNID-PROD              PIC S9(004)     PACKED-DECIMAL.
110600 01  COD-PROD                   PIC S9(004)     PACKED-DECIMAL.
110700 01  COD-AGEN-BAS-COR           PIC S9(004)     PACKED-DECIMAL.
110800 01  NUM-CTA-BAS-COR            PIC S9(007)     PACKED-DECIMAL.
110900 01  COD-SEGURADO               PIC S9(010)     PACKED-DECIMAL.
111000 01  NOM-SEGURADO               PIC  X(060).
111100 01  DSC-COMPL-SEGURADO         PIC  X(060).
111200 01  NUM-CGC-CPF                PIC S9(014)     PACKED-DECIMAL.
111300 01  COD-TIP-LOGR               PIC  X(003).
111400 01  NOM-LOGR                   PIC  X(050).
111500 01  DSC-COMPL-LOGR             PIC  X(020).
111600 01  NOM-BAIRRO                 PIC  X(030).
111700 01  NOM-CID                    PIC  X(030).
111800 01  SIG-UF                     PIC  X(002).
111900 01  NUM-CEP                    PIC S9(008)     PACKED-DECIMAL.
112000 01  NUM-FONE                   PIC S9(008)     PACKED-DECIMAL.
112100 01  COD-ESTIP                  PIC S9(010)     PACKED-DECIMAL.
112200 01  VAL-COEF-CMS-PAD           PIC S9(01)V9(4) PACKED-DECIMAL.
112300 01  DAT-INI-VIG                PIC S9(008)     PACKED-DECIMAL.
112400 01  DAT-TER-VIG                PIC S9(008)     PACKED-DECIMAL.
112500 01  DAT-EMIS                   PIC S9(008)     PACKED-DECIMAL.
112600 01  COD-MOED                   PIC S9(002).
112700 01  PER-JURO-FRAC              PIC S9(002)V99  PACKED-DECIMAL.
112800 01  QTD-PARC                   PIC S9(002).
112900 01  QTD-ANEXO                  PIC S9(004)     PACKED-DECIMAL.
113000 01  COD-IDEN-PRAZ              PIC S9(001).
113100 01  COD-PR-MIN-ENDO            PIC S9(001).
113200 01  COD-PR-MIN-PARC            PIC S9(001).
113300 01  VAL-PR-ANTEC               PIC S9(013)V99  PACKED-DECIMAL.
113400 01  PER-ADIC-FORM-PAG          PIC S9(002)V99  PACKED-DECIMAL.
113500 01  PER-DESC-FORM-PAG          PIC S9(002)V99  PACKED-DECIMAL.
113600 01  VAL-IS                     PIC S9(013)V99  PACKED-DECIMAL.
113700 01  VAL-PR                     PIC S9(013)V99  PACKED-DECIMAL.
113800 01  VAL-PR-REF-TARIF           PIC S9(013)V99  PACKED-DECIMAL.
113900 01  VAL-PR-REF-RESG            PIC S9(013)V99  PACKED-DECIMAL.
114000 01  DAT-INI-VIAG               PIC S9(008)     PACKED-DECIMAL.
114100 01  COD-TIP-LIBER              PIC S9(001).
114200 01  COD-IDEN-ALT-CORR          PIC  X(001).
114300 01  COD-USER-DIGIT             PIC  X(006).
114400 01  DAT-DIGIT                  PIC S9(008)     PACKED-DECIMAL.
114500 01  HOR-DIGIT                  PIC S9(004)     PACKED-DECIMAL.
114600 01  COD-USER-LIBER             PIC  X(006).
114700 01  DAT-LIBER                  PIC S9(008)     PACKED-DECIMAL.
114800 01  HOR-LIBER                  PIC S9(004)     PACKED-DECIMAL.
114900 01  COD-SIT-PED                PIC S9(002).
115000 01  COD-TIP-DOC                PIC S9(001).
115100 01  COD-DIZER                  PIC S9(002).
115200 01  QTD-COPIA                  PIC S9(003)     PACKED-DECIMAL.
115300 01  VAL-CUST-EMIS              PIC S9(13)V9(5) PACKED-DECIMAL.
115400 01  COD-POSI-ATUAL             PIC  X(001).
115500 01  TIP-CUST-EMIS              PIC S9(001).
115600 01  VAL-CAMBIO-EMIS            PIC S9(06)V9(5) PACKED-DECIMAL.
115700 01  IDEN                       PIC  X(005).
115800
115900*CONTROLE DE REGISTRO EM DUPLICIDADE TAB_PED NO NETCOBOL
116000 01  COUNT-NUM-PED-WS            PIC S9(006).
116100
116200*----------------------------------------------------------------*
116300*    TAB_PED_LOC                                                 *
116400*----------------------------------------------------------------*
116500 01  COD-TIP-LOGR-RISCO         PIC  X(003).
116600 01  NOM-LOGR-RISCO             PIC  X(050).
116700 01  DSC-COMPL-RISCO            PIC  X(020).
116800 01  NOM-BAIRRO-RISCO           PIC  X(030).
116900 01  NOM-CID-RISCO              PIC  X(030).
117000 01  SIG-UF-RISCO               PIC  X(002).
117100 01  NUM-CEP-RISCO              PIC S9(008)     PACKED-DECIMAL.
117200 01  PER-DESC-APAR              PIC S9(002)V99  PACKED-DECIMAL.
117300 01  PER-DESC-PROGRES           PIC S9(002)V99  PACKED-DECIMAL.
117400 01  PER-IS-VR                  PIC S9(003)V99  PACKED-DECIMAL.
117500 01  VAL-COEF-IS-VR             PIC S9(01)V9(4) PACKED-DECIMAL.
117600 01  VAL-VR                     PIC S9(013)V99  PACKED-DECIMAL.
117700 01  TAB-CLASF                  PIC S9(04)      PACKED-DECIMAL.
117800 01  COD-CLASF                  PIC  X(04).
117900 01  COD-COMPL-CLASF            PIC  X(02).
118000 01  COD-CLASSE-OCUP            PIC S9(02)      PACKED-DECIMAL.
118100 01  COD-CONSTR                 PIC S9(02)      PACKED-DECIMAL.
118200 01  COD-SIT-ITEM               PIC S9(02).
118300 01  PER-BONUS                  PIC S9(02)V99   PACKED-DECIMAL.
118400 01  QTD-EMPREG                 PIC S9(004)     PACKED-DECIMAL.
118500 01  DSC-CLASF                  PIC  X(060).
118600 01  NUM-INSP-TAB               PIC S9(007)     PACKED-DECIMAL.
118700 01  COD-IDEN-SEGUR-01          PIC  X(001).
118800 01  COD-IDEN-SEGUR-02          PIC  X(001).
118900 01  COD-IDEN-SEGUR-03          PIC  X(001).
119000 01  COD-IDEN-SEGUR-04          PIC  X(001).
119100 01  COD-IDEN-SEGUR-05          PIC  X(001).
119200 01  COD-IDEN-SEGUR-06          PIC  X(001).
119300 01  COD-IDEN-SEGUR-07          PIC  X(001).
119400 01  COD-IDEN-SEGUR-08          PIC  X(001).
119500 01  COD-IDEN-SEGUR-09          PIC  X(001).
119600 01  COD-IDEN-SEGUR-10          PIC  X(001).
119700 01  PER-TOT-SEGUR              PIC S9(002)V99  PACKED-DECIMAL.
119800 01  COD-IDEN-PROTEC-01         PIC  X(001).
119900 01  COD-IDEN-PROTEC-02         PIC  X(001).
120000 01  COD-IDEN-PROTEC-03         PIC  X(001).
120100 01  COD-IDEN-PROTEC-04         PIC  X(001).
120200 01  COD-IDEN-PROTEC-05         PIC  X(001).
120300 01  COD-IDEN-PROTEC-06         PIC  X(001).
120400 01  COD-IDEN-PROTEC-07         PIC  X(001).
120500 01  COD-IDEN-PROTEC-08         PIC  X(001).
120600 01  COD-IDEN-PROTEC-09         PIC  X(001).
120700 01  COD-IDEN-PROTEC-10         PIC  X(001).
120800 01  PER-TOT-PROTEC             PIC S9(002)V99  PACKED-DECIMAL.
120900 01  COD-PRODUTO                PIC S9(010)     PACKED-DECIMAL.
121000 01  COD-REGIAO                 PIC S9(003)     PACKED-DECIMAL.
121100 01  COD-IDEN-TARIF             PIC S9(004)     PACKED-DECIMAL.
121200 01  NUM-ITEM                   PIC S9(005)     PACKED-DECIMAL.
121300 01  NUM-ITEM-WS                PIC S9(005)     PACKED-DECIMAL.
121400
121500*----------------------------------------------------------------*
121600*    TAB_PED_CORR                                                *
121700*----------------------------------------------------------------*
121800 01  COD-ORG-COR                PIC S9(002).
121900 01  COD-RAMO-COR               PIC S9(003)     PACKED-DECIMAL.
122000 01  NUM-PED-COR                PIC S9(006)     PACKED-DECIMAL.
122100 01  NUM-APOL-COR               PIC S9(010)     PACKED-DECIMAL.
122200 01  NUM-ENDO-COR               PIC S9(006)     PACKED-DECIMAL.
122300 01  COD-CORR-COR               PIC S9(007)     PACKED-DECIMAL.
122400 01  PER-CORR-COR               PIC S9(002)V99  PACKED-DECIMAL.
122500 01  NUM-ORDEM-CORR-COR         PIC S9(002).
122600
122700*----------------------------------------------------------------*
122800*    TAB_PED_VENC                                                *
122900*----------------------------------------------------------------*
123000 01  COD-ORG-VENC               PIC S9(002).
123100 01  COD-RAMO-VENC              PIC S9(003)     PACKED-DECIMAL.
123200 01  NUM-PED-VENC               PIC S9(006)     PACKED-DECIMAL.
123300 01  NUM-APOL-VENC              PIC S9(010)     PACKED-DECIMAL.
123400 01  NUM-ENDO-VENC              PIC S9(006)     PACKED-DECIMAL.
123500 01  NUM-PARC-VENC              PIC S9(002).
123600 01  DAT-VENC-VENC              PIC S9(008)     PACKED-DECIMAL.
123700
123800*----------------------------------------------------------------*
123900*    TAB_PED_COBERT                                              *
124000*----------------------------------------------------------------*
124100 01  COD-COBERT-PD              PIC S9(004)     PACKED-DECIMAL.
124200 01  VAL-IS-PD                  PIC S9(013)V99  PACKED-DECIMAL.
124300 01  PER-TAXA-PD                PIC S9(02)V9(5) PACKED-DECIMAL.
124400 01  PER-DESC-COML-PD           PIC S9(002)V99  PACKED-DECIMAL.
124500 01  PER-DESC-EXP-PD            PIC S9(002)V99  PACKED-DECIMAL.
124600 01  VAL-PR-COBERT-PD           PIC S9(013)V99  PACKED-DECIMAL.
124700
124800*----------------------------------------------------------------*
124900*    TAB_COBERT                                                  *
125000*----------------------------------------------------------------*
125100 01  PER-LIM-MAX-COBERT         PIC S9(003)V9(04) PACKED-DECIMAL.
125200 01  COD-LIM-COBERT             PIC S9(004)       PACKED-DECIMAL.
125300 01  COD-GRUPO-COBERT           PIC S9(001).
125400
125500*----------------------------------------------------------------*
125600*    TAB_CTRL_EMIS                                               *
125700*----------------------------------------------------------------*
125800 01  NUM-PI-CTRL                PIC S9(010)    PACKED-DECIMAL.
125900 01  NUM-BLOQ-CTRL              PIC S9(007)    PACKED-DECIMAL.
126000 01  COD-UNID-CTRL              PIC S9(004)    PACKED-DECIMAL.
126100 01  COD-RAMO-CTRL              PIC S9(003)    PACKED-DECIMAL.
126200 01  DAT-INI-VIG-CTRL           PIC S9(008)    PACKED-DECIMAL.
126300 01  DAT-TER-VIG-CTRL           PIC S9(008)    PACKED-DECIMAL.
126400 01  COD-CORR-CTRL              PIC S9(007)    PACKED-DECIMAL.
126500 01  PER-CORR-CTRL              PIC S9(002)V99 PACKED-DECIMAL.
126600 01  COD-CORR-2-CTRL            PIC S9(007)    PACKED-DECIMAL.
126700 01  PER-CORR-2-CTRL            PIC S9(002)V99 PACKED-DECIMAL.
126800 01  COD-CORR-3-CTRL            PIC S9(007)    PACKED-DECIMAL.
126900 01  PER-CORR-3-CTRL            PIC S9(002)V99 PACKED-DECIMAL.
127000 01  NOM-SEG-CTRL               PIC  X(060).
127100 01  QTD-ANEX-CTRL              PIC S9(005)    PACKED-DECIMAL.
127200 01  NUM-APOL-ANT-CTRL          PIC S9(010)    PACKED-DECIMAL.
127300 01  DSC-OBS-PROP-CTRL          PIC  X(055).
127400 01  PER-JUROS-NEG-CTRL         PIC S9(002)V99 PACKED-DECIMAL.
127500 01  COD-ENVI-DOC-CTRL          PIC  X(001).
127600 01  DAT-DIGIT-CTRL             PIC S9(008)    PACKED-DECIMAL.
127700 01  HOR-DIGIT-CTRL             PIC S9(006)    PACKED-DECIMAL.
127800 01  COD-IDEN-STAT-ACAO-CTRL    PIC S9(002)    PACKED-DECIMAL.
127900 01  COD-USER-DIGIT-CTRL        PIC  X(012).
128000 01  DAT-DIGIT-MF-CTRL          PIC S9(008)    PACKED-DECIMAL.
128100 01  HOR-DIGIT-MF-CTRL          PIC S9(006)    PACKED-DECIMAL.
128200 01  COD-USER-DIGIT-MF-CTRL     PIC  X(006).
128300 01  VAL-PR-TOT-CTRL            PIC S9(007)V99 PACKED-DECIMAL.
128400 01  COD-IDEN-CLASSE-CTRL       PIC S9(001)    PACKED-DECIMAL.
128500 01  COD-IDEN-COBR-CTRL         PIC S9(002)    PACKED-DECIMAL.
128600 01  NUM-PROP-CTRL              PIC S9(006)    PACKED-DECIMAL.
128700 01  DAT-CANC-APOL-CTRL         PIC S9(008)    PACKED-DECIMAL.
128800 01  COD-TIP-DOC-CTRL           PIC S9(001)    PACKED-DECIMAL.
128900 01  DAT-REC-CIA-CTRL           PIC S9(008)    PACKED-DECIMAL.
129000 01  NUM-REF-CORR-CTRL          PIC  X(015).
129100 01  DAT-EMIS-CTRL              PIC S9(008)    PACKED-DECIMAL.
129200 01  NUM-APOL-CTRL              PIC S9(010)    PACKED-DECIMAL.
129300 01  NUM-ENDO-CTRL              PIC S9(006)    PACKED-DECIMAL.
129400 01  VAL-PR-EMIS-CTRL           PIC S9(007)V99 PACKED-DECIMAL.
129500 01  VAL-PR-LIQ-CTRL            PIC S9(007)V99 PACKED-DECIMAL.
129600 01  PER-TOT-COSS-CTRL          PIC S9(002)V99 PACKED-DECIMAL.
129700 01  QTD-PARC-CTRL              PIC S9(002)    PACKED-DECIMAL.
129800 01  COD-IDEN-STAT-RESP-CTRL    PIC S9(002)    PACKED-DECIMAL.
129900 01  COD-IDEN-SAC-CTRL          PIC S9(004)    PACKED-DECIMAL.
130000 01  COD-PROD-CTRL              PIC S9(004)    PACKED-DECIMAL.
130100 01  VAL-IS-CTRL                PIC S9(013)V99 PACKED-DECIMAL.
130200 01  PER-DESC-COML-CTRL         PIC S9(002)V99 PACKED-DECIMAL.
130300 01  NUM-CGC-CPF-CTRL           PIC S9(014)    PACKED-DECIMAL.
130400 01  COD-IDEN-PESSOA-CTRL       PIC S9(001)    PACKED-DECIMAL.
130500 01  COD-IDEN-PAG-ANTEC-CTRL    PIC S9(001)    PACKED-DECIMAL.
130600
130700 01  DAT-REF-CTRL               PIC S9(008)    PACKED-DECIMAL.
130800
130900*----------------------------------------------------------------*
131000*    TAB_SIN_PAG                                                 *
131100*----------------------------------------------------------------*
131200 01  NUM-APOL-SIN               PIC S9(010)     PACKED-DECIMAL.
131300 01  NUM-ITEM-SIN               PIC S9(005)     PACKED-DECIMAL.
131400 01  QTD-RENOV-SIN              PIC S9(005).
131500 01  DSC-INSTR-REMES-SIN        PIC  X(004).
131600 01  VAL-PAG-SIN                PIC S9(013)V99  PACKED-DECIMAL.
131700*----------------------------------------------------------------*
131800*    TAB_PED_CLAU                                                *
131900*----------------------------------------------------------------*
132000 01  COD-CLAU                    PIC  S9(005)      PACKED-DECIMAL.
132100
132200*----------------------------------------------------------------*
132300*    TBS_CORRETOR_PREFERENCIAL
132400*----------------------------------------------------------------*
132500 01  COD-CORR-PREF              PIC S9(007).
132600 01  TIPO-PREF                  PIC S9(006).
132700
132800     EXEC SQL  END   DECLARE SECTION  END-EXEC.
132900
133000 01  PRM-S00U023.
133100     03  DAT-INI-S00U023.
133200         05  ANO-WS             PIC  9(004).
133300         05  MES-WS             PIC  9(002).
133400         05  DIA-WS             PIC  9(002).
133500     03  DAT-TER-S00U023.
133600         05  ANO-WS             PIC  9(004).
133700         05  MES-WS             PIC  9(002).
133800         05  DIA-WS             PIC  9(002).
133900     03  QTD-DIA-S00U023        REDEFINES DAT-TER-S00U023
134000                                PIC  9(008).
134100     03  COD-INDIC-S00U023      PIC  X(001).
134200     03  COD-TIP-S00U023        PIC  X(001).
134300     03  FILLER.
134400         05  COD-RET-S00U023    PIC  X(002).
134500         05  FILLER             PIC  X(001).
134600         05  DSC-MSG-S00U023    PIC  X(037).
134700
134800*----------------------------------------------------------------*
134900*    PARM DO SUBPROGRAMA S00U033 - SOCKET                        *
135000*----------------------------------------------------------------*
135100 01  PRM-S00U033.
135200     03  CMD-SQL-S00U033         PIC  X(2048).
135300     03  USER-ID-S00U033         PIC  X(006).
135400     03  COD-MSG-RET-S00U033     PIC  9(003).
135500     03  DSC-MSG-RET-S00U033     PIC  X(7168).
135600     03  SCKPORT-S00U033         PIC  X(003).
135700
135800 01  CAMPO-COUNT.
135900     05 TAMANHO-COUNT            PIC  X(004).
136000     05 LINHA-COUNT              PIC  X(002).
136100     05 COLUNA-COUNT             PIC  X(002).
136200     05 TOTAL-COUNT              PIC  9(003).
136300
136400 01  CAMPO-RET-SOC.
136500     05 TAMANHO-RET-SOC          PIC  X(004).
136600     05 LINHA-RET-SOC            PIC  X(002).
136700     05 COLUNA-RET-SOC           PIC  X(002).
136800     05 TIPOCORR-RET-SOC         PIC  9(005).
136900
137000 01  SOC-SEL-TAB-CORR-ESPEC-WS.
137100     05  FILLER              PIC X(048)  VALUE
137200             'SELECT TIPO FROM TBS_CORRETOR_PREFERENCIAL WHERE'.
137300     05  FILLER              PIC X(016)  VALUE ' COD_CORRETOR = '.
137400     05 COD-CORR-ESPEC       PIC 9(007).
137500     05  FILLER              PIC X(001)   VALUE ';'.
137600
137700*=======================================*
137800 LINKAGE          SECTION.
137900*=======================================*
138000  01  PRM-S01U034.
138100      03   COD-USER-S01U034            PIC  X(006).
138200      03   COD-RAMO-S01U034            PIC  9(003).
138300      03   NUM-PED-S01U034             PIC  9(006).
138400      03   NUM-ITEM-S01U034            PIC  9(005).
138500      03   CONST-CANC-S01U034          PIC  X(001).
138600      03   COD-ESPEC-S01U034           PIC  X(001).
138700      03   COD-TARIF-S01U034           PIC  9(004).
138800      03   TAB-MSG-S01U034.
138900         05   MSG-PROP-S01U034        OCCURS    20.
139000            07 COD-STAT-IRREG-S01U034  PIC    9(02).
139100            07 COD-ERR-NORMA-S01U034   PIC    9(10).
139200            07 DSC-ERR-NORMA-S01U034   PIC    X(40).
139300
139400*=======================================*
139500 PROCEDURE  DIVISION  USING  PRM-S01U034.
139600*=======================================*
139700     PERFORM  001-00-INICIO.
139800     PERFORM  060-00-CARREGA-TAB-COBERT.
139900     PERFORM  070-00-PROCESSA.
140000     PERFORM  900-00-FIM.
140100
140200*=======================================*
140300 001-00-INICIO           SECTION.
140400*=======================================*
140500     MOVE    'S01U034 '           TO    NOM-PROG-WS
140600
140700     MOVE     FUNCTION CURRENT-DATE
140800                                  TO    DAT-HOJE-WS-R.
140900
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     WHENEVER  SQLERROR  GO  TO   :TRATA-SQL-ERRO          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
141000     EXEC SQL
141100          WHENEVER  SQLERROR  GO  TO   :TRATA-SQL-ERRO
141200     END-EXEC.
141300
141400     MOVE     NUM-PED-S01U034     TO    NUM-PED
141500     MOVE     COD-RAMO-S01U034    TO    COD-RAMO
141600     MOVE     NUM-ITEM-S01U034    TO    NUM-ITEM
141700     MOVE     CONST-CANC-S01U034  TO    CONSTA-CANC-WS
141800     MOVE     COD-ESPEC-S01U034   TO    COD-ESPEC-WS
141900     INITIALIZE   TAB-MSG-S01U034
142000
142100     MOVE     1                   TO    IND-WS
142200     PERFORM  UNTIL  IND-WS > 20
142300           MOVE ZEROS   TO    COD-STAT-IRREG-S01U034(IND-WS)
142400           MOVE ZEROS   TO    COD-ERR-NORMA-S01U034(IND-WS)
142500           MOVE SPACES  TO    DSC-ERR-NORMA-S01U034(IND-WS)
142600           ADD  1       TO    IND-WS
142700     END-PERFORM
142800
142900     MOVE     0                   TO    IND-ERR
143000
143100*    RETIRAR DISPLAY NAO FUNCIONA NOS CORRETORES.
143200
143300*    DISPLAY 'COD-RAMO ' COD-RAMO-S01U034
143400*            ' NUM-PED '  NUM-PED-S01U034
143500*            ' NUM-ITEM ' NUM-ITEM-S01U034
143600
143700     MOVE     ZEROS               TO    COD-ORG
143800
143900*--------            PROCURA TAB-PED           ------------------*
144000
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     WHENEVER  NOT FOUND GO TO   :001-55-NAO-LOC-PED       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
144100     EXEC SQL
144200          WHENEVER  NOT FOUND GO TO   :001-55-NAO-LOC-PED
144300     END-EXEC.
144400
144500     EXEC SQL
144600          SELECT COUNT(*)
144700          INTO :COUNT-NUM-PED-WS
144800          FROM       TAB_PED
144900          WHERE  NUM_PED       =     :NUM-PED
145000            AND  COD_ORG       =     :COD-ORG
145100            AND  COD_RAMO      =     :COD-RAMO
145200     END-EXEC.
145300
145400     IF    COUNT-NUM-PED-WS     >     1
145500           GO TO 001-56-DUPLIC-LOC-PED
145600     END-IF.
145700
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     SELECT                                                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_ORG,                 COD_RAMO,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NUM_PED,                 NUM_APOL,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NUM_APOL_AN,             COD_REG,                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_BCO_COBR,            COD_AGEN_ANGAR,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_AGEN_INDICR,         NUM_CTA_INDICR,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_UNID_PROD,           COD_PROD,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_AGEN_BAS_COR,        NUM_CTA_BAS_COR,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_SEGURADO,            NOM_SEGURADO,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DSC_COMPL_SEGURADO,      NUM_CGC_CPF,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_TIP_LOGR,            NOM_LOGR,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DSC_COMPL_LOGR,          NOM_BAIRRO,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NOM_CID,                 SIG_UF,                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NUM_CEP,                 NUM_FONE,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_ESTIP,               VAL_COEF_CMS_PAD,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DAT_INI_VIG,             DAT_TER_VIG,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DAT_EMIS,                COD_MOED,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_JURO_FRAC,           QTD_PARC,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          QTD_ANEXO,               COD_IDEN_PRAZ,          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_PR_MIN_ENDO,         COD_PR_MIN_PARC,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          VAL_PR_ANTEC,            PER_ADIC_FORM_PAG,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_DESC_FORM_PAG,       VAL_IS,                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          VAL_PR,                  COD_IDEN_ALT_CORR,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_USER_DIGIT,          DAT_DIGIT,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          HOR_DIGIT,               COD_USER_LIBER,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DAT_LIBER,               HOR_LIBER,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_SIT_PED,             COD_TIP_DOC,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_DIZER,               QTD_COPIA,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          VAL_CUST_EMIS,           TIP_CUST_EMIS,          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          VAL_PR_REF_TARIF,        VAL_PR_REF_RESG,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DAT_INI_VIAG,            COD_POSI_ATUAL,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          VAL_CAMBIO_EMIS,         IDEN                    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     INTO                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-ORG,                 :COD-RAMO,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NUM-PED,                 :NUM-BILHETE,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NUM-APOL,                :COD-REG,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-BCO-COBR,            :COD-AGEN-ANGAR,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-AGEN-INDICR,         :NUM-CTA-INDICR,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-UNID-PROD,           :COD-PROD,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-AGEN-BAS-COR,        :NUM-CTA-BAS-COR,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-SEGURADO,            :NOM-SEGURADO,          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DSC-COMPL-SEGURADO,      :NUM-CGC-CPF,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-TIP-LOGR,            :NOM-LOGR,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DSC-COMPL-LOGR,          :NOM-BAIRRO,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NOM-CID,                 :SIG-UF,                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NUM-CEP,                 :NUM-FONE,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-ESTIP,               :VAL-COEF-CMS-PAD,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DAT-INI-VIG,             :DAT-TER-VIG,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DAT-EMIS,                :COD-MOED,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-JURO-FRAC,           :QTD-PARC,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :QTD-ANEXO,               :COD-IDEN-PRAZ,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-PR-MIN-ENDO,         :COD-PR-MIN-PARC,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :VAL-PR-ANTEC,            :PER-ADIC-FORM-PAG,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-DESC-FORM-PAG,       :VAL-IS,                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :VAL-PR,                  :COD-IDEN-ALT-CORR,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-USER-DIGIT,          :DAT-DIGIT,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :HOR-DIGIT,               :COD-USER-LIBER,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DAT-LIBER,               :HOR-LIBER,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-SIT-PED,             :COD-TIP-DOC,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-DIZER,               :QTD-COPIA,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :VAL-CUST-EMIS,           :TIP-CUST-EMIS,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :VAL-PR-REF-TARIF,        :VAL-PR-REF-RESG,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DAT-INI-VIAG,            :COD-POSI-ATUAL,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :VAL-CAMBIO-EMIS,         :IDEN                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     FROM       TAB_PED                                    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     WHERE  NUM_PED       =     :NUM-PED                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  COD_ORG       =     :COD-ORG                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  COD_RAMO      =     :COD-RAMO                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00004)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00005)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00006)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00007)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00008)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00009)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00010)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00011)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00012)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00013)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00014)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00015)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00016)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00017)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00018)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00019)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00020)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00021)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00022)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00023)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00024)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00025)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00026)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00027)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00028)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00029)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00030)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00031)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00032)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00033)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00034)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00035)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00036)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00037)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00038)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00039)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00040)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00041)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00042)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00043)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00044)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00045)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00046)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00047)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00048)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00049)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00050)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00051)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00052)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00053)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00054)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00055)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00056)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00057)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00058)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00059)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00060)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00061)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00062)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
145800     EXEC SQL
145900          SELECT
146000               COD_ORG,                 COD_RAMO,
146100               NUM_PED,                 NUM_APOL,
146200               NUM_APOL_AN,             COD_REG,
146300               COD_BCO_COBR,            COD_AGEN_ANGAR,
146400               COD_AGEN_INDICR,         NUM_CTA_INDICR,
146500               COD_UNID_PROD,           COD_PROD,
146600               COD_AGEN_BAS_COR,        NUM_CTA_BAS_COR,
146700               COD_SEGURADO,            NOM_SEGURADO,
146800               DSC_COMPL_SEGURADO,      NUM_CGC_CPF,
146900               COD_TIP_LOGR,            NOM_LOGR,
147000               DSC_COMPL_LOGR,          NOM_BAIRRO,
147100               NOM_CID,                 SIG_UF,
147200               NUM_CEP,                 NUM_FONE,
147300               COD_ESTIP,               VAL_COEF_CMS_PAD,
147400               DAT_INI_VIG,             DAT_TER_VIG,
147500               DAT_EMIS,                COD_MOED,
147600               PER_JURO_FRAC,           QTD_PARC,
147700               QTD_ANEXO,               COD_IDEN_PRAZ,
147800               COD_PR_MIN_ENDO,         COD_PR_MIN_PARC,
147900               VAL_PR_ANTEC,            PER_ADIC_FORM_PAG,
148000               PER_DESC_FORM_PAG,       VAL_IS,
148100               VAL_PR,                  COD_IDEN_ALT_CORR,
148200               COD_USER_DIGIT,          DAT_DIGIT,
148300               HOR_DIGIT,               COD_USER_LIBER,
148400               DAT_LIBER,               HOR_LIBER,
148500               COD_SIT_PED,             COD_TIP_DOC,
148600               COD_DIZER,               QTD_COPIA,
148700               VAL_CUST_EMIS,           TIP_CUST_EMIS,
148800               VAL_PR_REF_TARIF,        VAL_PR_REF_RESG,
148900               DAT_INI_VIAG,            COD_POSI_ATUAL,
149000               VAL_CAMBIO_EMIS,         IDEN
149100          INTO
149200              :COD-ORG,                 :COD-RAMO,
149300              :NUM-PED,                 :NUM-BILHETE,
149400              :NUM-APOL,                :COD-REG,
149500              :COD-BCO-COBR,            :COD-AGEN-ANGAR,
149600              :COD-AGEN-INDICR,         :NUM-CTA-INDICR,
149700              :COD-UNID-PROD,           :COD-PROD,
149800              :COD-AGEN-BAS-COR,        :NUM-CTA-BAS-COR,
149900              :COD-SEGURADO,            :NOM-SEGURADO,
150000              :DSC-COMPL-SEGURADO,      :NUM-CGC-CPF,
150100              :COD-TIP-LOGR,            :NOM-LOGR,
150200              :DSC-COMPL-LOGR,          :NOM-BAIRRO,
150300              :NOM-CID,                 :SIG-UF,
150400              :NUM-CEP,                 :NUM-FONE,
150500              :COD-ESTIP,               :VAL-COEF-CMS-PAD,
150600              :DAT-INI-VIG,             :DAT-TER-VIG,
150700              :DAT-EMIS,                :COD-MOED,
150800              :PER-JURO-FRAC,           :QTD-PARC,
150900              :QTD-ANEXO,               :COD-IDEN-PRAZ,
151000              :COD-PR-MIN-ENDO,         :COD-PR-MIN-PARC,
151100              :VAL-PR-ANTEC,            :PER-ADIC-FORM-PAG,
151200              :PER-DESC-FORM-PAG,       :VAL-IS,
151300              :VAL-PR,                  :COD-IDEN-ALT-CORR,
151400              :COD-USER-DIGIT,          :DAT-DIGIT,
151500              :HOR-DIGIT,               :COD-USER-LIBER,
151600              :DAT-LIBER,               :HOR-LIBER,
151700              :COD-SIT-PED,             :COD-TIP-DOC,
151800              :COD-DIZER,               :QTD-COPIA,
151900              :VAL-CUST-EMIS,           :TIP-CUST-EMIS,
152000              :VAL-PR-REF-TARIF,        :VAL-PR-REF-RESG,
152100              :DAT-INI-VIAG,            :COD-POSI-ATUAL,
152200              :VAL-CAMBIO-EMIS,         :IDEN
152300          FROM       TAB_PED
152400          WHERE  NUM_PED       =     :NUM-PED
152500            AND  COD_ORG       =     :COD-ORG
152600            AND  COD_RAMO      =     :COD-RAMO
152700     END-EXEC.
152800
152900     MOVE  DAT-EMIS              TO   DAT-EMIS-WS
153000     IF    DAT-EMIS-WS     >     DAT-HOJE-WS-R
153100           MOVE  DAT-EMIS        TO   DAT-PARC-WS
153200     ELSE
153300           MOVE  DAT-HOJE-WS-R   TO   DAT-PARC-WS
153400     END-IF
153500     MOVE  VAL-IS                TO   VAL-IS-4-2-1-WS
153600     MOVE  DAT-INI-VIG           TO   DAT-INI-VIG-WS
153700     MOVE  DAT-TER-VIG           TO   DAT-TER-VIG-WS
153800
153900     MOVE    DAT-INI-VIG-WS      TO   DAT-INI-S00U023
154000     MOVE    DAT-TER-VIG-WS      TO   DAT-TER-S00U023
154100     MOVE    'C'                 TO   COD-TIP-S00U023
154200     MOVE    ' '                 TO   COD-INDIC-S00U023
154300     CALL    'S00U023'  USING  PRM-S00U023
154400     CANCEL  'S00U023'
154500     IF      DSC-MSG-S00U023     =    SPACES
154600             MOVE QTD-DIA-S00U023 (5:4)  TO  DAT-COMPARA-WS
154700     END-IF
154800
154900*--------        PROCURA TAB-CTRL-EMIS         ------------------*
155000
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     WHENEVER  NOT FOUND GO TO   :001-50-NAO-LOC-EMIS      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
155100     EXEC SQL
155200          WHENEVER  NOT FOUND GO TO   :001-50-NAO-LOC-EMIS
155300     END-EXEC.
155400
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     SELECT                                                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NUM_BLOQ ,               VAL_PR_TOT,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_UNID ,               COD_IDEN_CLASSE,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_RAMO ,               COD_IDEN_COBR,          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DAT_INI_VIG,             NUM_PROP,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DAT_TER_VIG,             DAT_CANC_APOL,          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_CORR,                COD_TIP_DOC,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_CORR,                DAT_REC_CIA,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_CORR_2,              NUM_REF_CORR,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_CORR_2,              DAT_EMIS,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_CORR_3,              NUM_APOL,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_CORR_3,              NUM_ENDO,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NOM_SEG,                 VAL_PR_EMIS,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          QTD_ANEX,                VAL_PR_LIQ,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NUM_APOL_ANT,            PER_TOT_COSS,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DSC_OBS_PROP,            QTD_PARC,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_JUROS_NEG,           COD_IDEN_STAT_RESP,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_ENVI_DOC,            COD_IDEN_SAC,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_STAT_ACAO,      COD_PROD,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DAT_DIGIT_MF,            VAL_IS,                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          HOR_DIGIT_MF,            PER_DESC_COML,          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_USER_DIGIT_MF,       NUM_PI,                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NUM_CGC_CPF,             DAT_DIGIT,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_PESSOA,         COD_IDEN_PAG_ANTEC      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     INTO                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NUM-BLOQ-CTRL,           :VAL-PR-TOT-CTRL,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-UNID-CTRL,           :COD-IDEN-CLASSE-CTRL,  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-RAMO-CTRL,           :COD-IDEN-COBR-CTRL,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DAT-INI-VIG-CTRL,        :NUM-PROP-CTRL,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DAT-TER-VIG-CTRL,        :DAT-CANC-APOL-CTRL,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-CORR-CTRL,           :COD-TIP-DOC-CTRL,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-CORR-CTRL,           :DAT-REC-CIA-CTRL,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-CORR-2-CTRL,         :NUM-REF-CORR-CTRL,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-CORR-2-CTRL,         :DAT-EMIS-CTRL,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-CORR-3-CTRL,         :NUM-APOL-CTRL,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-CORR-3-CTRL,         :NUM-ENDO-CTRL,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NOM-SEG-CTRL,            :VAL-PR-EMIS-CTRL,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :QTD-ANEX-CTRL,           :VAL-PR-LIQ-CTRL,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NUM-APOL-ANT-CTRL,       :PER-TOT-COSS-CTRL,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DSC-OBS-PROP-CTRL,       :QTD-PARC-CTRL,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-JUROS-NEG-CTRL,      :COD-IDEN-STAT-RESP-CTRL'
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-ENVI-DOC-CTRL,       :COD-IDEN-SAC-CTRL,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-STAT-ACAO-CTRL, :COD-PROD-CTRL,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DAT-DIGIT-MF-CTRL,       :VAL-IS-CTRL,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :HOR-DIGIT-MF-CTRL,       :PER-DESC-COML-CTRL,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-USER-DIGIT-MF-CTRL,  :NUM-PI-CTRL,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NUM-CGC-CPF-CTRL,        :DAT-DIGIT-CTRL,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-PESSOA-CTRL,    :COD-IDEN-PAG-ANTEC-CTRL'
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     FROM       TAB_CTRL_EMIS                              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     WHERE  NUM_PROP      =     :NUM-PED                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  COD_RAMO      =     :COD-RAMO                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  NUM_APOL      =      0                         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  NUM_ENDO      =      0                         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  DAT_EMIS      =      0                         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00063)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00064)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00065)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00066)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00067)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00068)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00069)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00070)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00071)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00072)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00073)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00074)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00075)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00076)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00077)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00078)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00079)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00080)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00081)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00082)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00083)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00084)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00085)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00086)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00087)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00088)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00089)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00090)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00091)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00092)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00093)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00094)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00095)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00096)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00097)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00098)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00099)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00100)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00101)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00102)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00103)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00104)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00105)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00106)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00107)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00108)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
155500     EXEC SQL
155600          SELECT
155700               NUM_BLOQ ,               VAL_PR_TOT,
155800               COD_UNID ,               COD_IDEN_CLASSE,
155900               COD_RAMO ,               COD_IDEN_COBR,
156000               DAT_INI_VIG,             NUM_PROP,
156100               DAT_TER_VIG,             DAT_CANC_APOL,
156200               COD_CORR,                COD_TIP_DOC,
156300               PER_CORR,                DAT_REC_CIA,
156400               COD_CORR_2,              NUM_REF_CORR,
156500               PER_CORR_2,              DAT_EMIS,
156600               COD_CORR_3,              NUM_APOL,
156700               PER_CORR_3,              NUM_ENDO,
156800               NOM_SEG,                 VAL_PR_EMIS,
156900               QTD_ANEX,                VAL_PR_LIQ,
157000               NUM_APOL_ANT,            PER_TOT_COSS,
157100               DSC_OBS_PROP,            QTD_PARC,
157200               PER_JUROS_NEG,           COD_IDEN_STAT_RESP,
157300               COD_ENVI_DOC,            COD_IDEN_SAC,
157400               COD_IDEN_STAT_ACAO,      COD_PROD,
157500               DAT_DIGIT_MF,            VAL_IS,
157600               HOR_DIGIT_MF,            PER_DESC_COML,
157700               COD_USER_DIGIT_MF,       NUM_PI,
157800               NUM_CGC_CPF,             DAT_DIGIT,
157900               COD_IDEN_PESSOA,         COD_IDEN_PAG_ANTEC
158000          INTO
158100              :NUM-BLOQ-CTRL,           :VAL-PR-TOT-CTRL,
158200              :COD-UNID-CTRL,           :COD-IDEN-CLASSE-CTRL,
158300              :COD-RAMO-CTRL,           :COD-IDEN-COBR-CTRL,
158400              :DAT-INI-VIG-CTRL,        :NUM-PROP-CTRL,
158500              :DAT-TER-VIG-CTRL,        :DAT-CANC-APOL-CTRL,
158600              :COD-CORR-CTRL,           :COD-TIP-DOC-CTRL,
158700              :PER-CORR-CTRL,           :DAT-REC-CIA-CTRL,
158800              :COD-CORR-2-CTRL,         :NUM-REF-CORR-CTRL,
158900              :PER-CORR-2-CTRL,         :DAT-EMIS-CTRL,
159000              :COD-CORR-3-CTRL,         :NUM-APOL-CTRL,
159100              :PER-CORR-3-CTRL,         :NUM-ENDO-CTRL,
159200              :NOM-SEG-CTRL,            :VAL-PR-EMIS-CTRL,
159300              :QTD-ANEX-CTRL,           :VAL-PR-LIQ-CTRL,
159400              :NUM-APOL-ANT-CTRL,       :PER-TOT-COSS-CTRL,
159500              :DSC-OBS-PROP-CTRL,       :QTD-PARC-CTRL,
159600              :PER-JUROS-NEG-CTRL,      :COD-IDEN-STAT-RESP-CTRL,
159700              :COD-ENVI-DOC-CTRL,       :COD-IDEN-SAC-CTRL,
159800              :COD-IDEN-STAT-ACAO-CTRL, :COD-PROD-CTRL,
159900              :DAT-DIGIT-MF-CTRL,       :VAL-IS-CTRL,
160000              :HOR-DIGIT-MF-CTRL,       :PER-DESC-COML-CTRL,
160100              :COD-USER-DIGIT-MF-CTRL,  :NUM-PI-CTRL,
160200              :NUM-CGC-CPF-CTRL,        :DAT-DIGIT-CTRL,
160300              :COD-IDEN-PESSOA-CTRL,    :COD-IDEN-PAG-ANTEC-CTRL
160400          FROM       TAB_CTRL_EMIS
160500          WHERE  NUM_PROP      =     :NUM-PED
160600            AND  COD_RAMO      =     :COD-RAMO
160700            AND  NUM_APOL      =      0
160800            AND  NUM_ENDO      =      0
160900            AND  DAT_EMIS      =      0
161000     END-EXEC.
161100
161200*    RETIRAR DISPLAY NAO FUNCIONA NOS CORRETORES.
161300
161400*    DISPLAY 'NUM-PI ' NUM-PI-CTRL
161500*            ' TIPO '  COD-TIP-DOC-CTRL
161600
161700     MOVE        'NAO'        TO     CORR-LIB.
161800     MOVE        'NAO'        TO     CORR-LIB2.
161900     MOVE        'NAO'        TO     CORR-LIB-HELLNER.
162000     MOVE        'NAO'        TO     CORR-LIB-AON.
162100     MOVE        'NAO'        TO     CORR-LIB-PROSER-ACF.
162200     MOVE        'NAO'        TO     CORR-LIB-APISUL.
162300     MOVE        'NAO'        TO     CORR-LIB-SOS.
162400     MOVE        'NAO'        TO     CORR-LIB-RESIDENCIAL.
162500     MOVE        'NAO'        TO     CORR-LIB-MARSH.
162600     MOVE        'NAO'        TO     CORR-LIB-MERCEDES.
162700     MOVE        'NAO'        TO     CORR-LIB-MARINE.
162800     MOVE        'NAO'        TO     CORR-LIB-PUNCH.
162900     MOVE        'NAO'        TO     CORR-LIB-GANDINI.
163000     MOVE        'NAO'        TO     CORR-LIB-AON-HOLD
163100     MOVE        'NAO'        TO     CORR-LIB-RUBR-019
163200     MOVE        'NAO'        TO     CORR-LIB-JUL-09.
163300     MOVE        'NAO'        TO     CORR-LIB-AON-HOLD-RS.
163400     MOVE        'NAO'        TO     CORR-LIB-AON-HOLD-SP.
163500     MOVE        'NAO'        TO     CORR-LIB-ADD.
163600     MOVE        'NAO'        TO     CORR-LIB-LOCK.
163700     MOVE        'NAO'        TO     CORR-LIB-LAZAM.
163800     MOVE        'NAO'        TO     CORR-LIB-MAHESO.
163900     MOVE        'NAO'        TO     CORR-LIB-AON-HOLD-PR.
164000     MOVE        'NAO'        TO     CORR-LIB-RECIFE.
164100     MOVE        'NAO'        TO     CORR-LIB-SEKURIT.
164200     MOVE        'NAO'        TO     CORR-LIB-AON-HOLD-RJ.
164300**FICHA 1001144
164400     MOVE        'NAO'        TO     CORR-LIB-AON-HOLD-MACAE.
164500     MOVE        'NAO'        TO     CORR-LIB-SCAVASEG.
164600     MOVE        'NAO'        TO     CORR-LIB-SEGURALTA.
164700     MOVE        'NAO'        TO     CORR-LIB-TONETTE.
164800     MOVE        'NAO'        TO     CORR-LIB-LARES.
164900     MOVE        'NAO'        TO     CORR-LIB-ASSIS.
165000     MOVE        'NAO'        TO     CORR-LIB-GARSEG.
165100     MOVE        'NAO'        TO     CORR-LIB-INVEST.
165200     MOVE        'NAO'        TO     CORR-LIB-DL.
165300     MOVE        'NAO'        TO     CORR-LIB-ENSEG.
165400     MOVE        'NAO'        TO     CORR-LIB-HONDA.
165500     MOVE        'NAO'        TO     CORR-LIB-WALKER.
165600     MOVE        'NAO'        TO     CORR-LIB-AON-HOLD-ES.
165700
165800****SOLIC 0800130 LIBEROU GRUPO VVD, PALLAS, MARSH, AON, JLT,
165900****MERCEDES,SECURITAS, LOCKTON, WILLIS.
166000     IF   COD-CORR-CTRL    = 0049301 OR 0008001 OR 0008002 OR
166100                    0008003 OR 0008004 OR 0008005 OR 0008006 OR
166200                    0008008 OR 0008011 OR 0008014 OR 0008028 OR
166300                    0005801 OR 0648701 OR 0648702 OR
166400                    0648705 OR 0648706 OR 0648708 OR
166500                    0219101 OR 0015701 OR 0493701 OR
166600                    0006901 OR 0686601 OR 0403801 OR 0008101
166700          MOVE   'SIM'        TO     CORR-LIB.
166800     IF   COD-CORR-CTRL    = 0003401 OR 0345601 OR 0486001 OR
166900                             0489501 OR 0646401
167000          MOVE   'SIM'        TO     CORR-LIB-MARSH.
167100
167200**FICHA 0801203
167300     IF  COD-CORR-CTRL = 0032201 OR 0689001
167400          MOVE   'SIM'        TO     CORR-LIB2
167500     END-IF
167600     IF  COD-CORR-CTRL = 0309801 OR 0076801 OR 0176901 OR
167700              0180701 OR 0308101 OR 0308201 OR 0377501 OR
167800              0421301 OR 0682601 OR 0684201 OR 0194801 OR
167900              0194901 OR 0662101 OR 0009601
168000          MOVE   'SIM'        TO     CORR-LIB-HELLNER
168100     END-IF
168200     IF  COD-CORR-CTRL = 0383901 OR 0425201 OR 0691801
168300          MOVE   'SIM'        TO     CORR-LIB-PROSER-ACF
168400     END-IF
168500**FICHA 0801203
168600*    IF  COD-CORR-CTRL = 0358307 OR 0282507
168700*         MOVE   'SIM'        TO     CORR-LIB-AON
168800*    END-IF
168900**FICHA 0801347
169000     IF  COD-CORR-CTRL = 0307503
169100          MOVE   'SIM'        TO     CORR-LIB-APISUL
169200     END-IF
169300     IF  COD-CORR-CTRL = 0225143
169400          MOVE   'SIM'        TO     CORR-LIB-SOS
169500     END-IF
169600**FICHA 0801754 E 0801820
169700     IF  COD-CORR-CTRL = 0288911
169800          MOVE   'SIM'        TO     CORR-LIB-MARINE
169900     END-IF
170000
170100**FICHA 0801486
170200     IF   COD-CORR-CTRL    = 0469999 OR 0680299 OR 0462513 OR
170300                    0340709 OR 0363409 OR 0683709 OR 0685309 OR
170400                    0455121 OR 0490799 OR 0653799 OR 0473721 OR
170500                    0654021 OR 0234621 OR 0653621 OR 0269821 OR
170600                    0663299 OR 0072221 OR 0037121 OR 0309801 OR
170700                    0001601 OR 0428601 OR 0018301 OR 0383901 OR
170800                    0425201 OR 0448199 OR 0033601 OR 0398301 OR
170900                    0611501 OR 0680301 OR 0208901 OR 0687201 OR
171000                    0032201 OR 0675801 OR 0684899 OR 0687101 OR
171100                    0026301 OR 0688901 OR 0678401 OR 0250501 OR
171200                    0382101 OR 0021401 OR 0393501 OR 0692201 OR
171300                    0691101 OR 0684903 OR 0475599 OR 0466699 OR
171400                    0675199 OR 0689999 OR 0349605 OR 0689105 OR
171500                    0327499 OR 0364699 OR 0034946 OR 0660105 OR
171600                    0259605 OR 0675305 OR 0455405 OR 0328905 OR
171700                    0328999 OR 0333176 OR 0270205 OR 0661505 OR
171800                    0017905 OR 0076801 OR 0176901 OR 0180701 OR
171900                    0308101 OR 0308201 OR 0377501 OR 0421301 OR
172000                    0684201 OR 0194801 OR 0194901 OR 0662101 OR
172100                    0009601
172200          MOVE   'SIM'        TO     CORR-LIB-RESIDENCIAL.
172300
172400     IF  COD-CORR-CTRL = 0015701
172500          MOVE   'SIM'        TO     CORR-LIB-MERCEDES
172600     END-IF
172700     IF  COD-CORR-CTRL = 0698601
172800          MOVE   'SIM'        TO     CORR-LIB-PUNCH
172900     END-IF
173000
173100     IF  COD-CORR-CTRL = 0699499
173200          MOVE   'SIM'        TO     CORR-LIB-GANDINI
173300     END-IF
173400
173500*    IF  COD-CORR-CTRL = 0358306 OR 0358308
173600*         MOVE   'SIM'        TO     CORR-LIB-AON-HOLD
173700*    END-IF
173800
173900     IF  COD-CORR-CTRL = 0288911 OR 0225143 OR 0234621
174000          MOVE   'SIM'        TO     CORR-LIB-RUBR-019
174100     END-IF
174200
174300     IF  COD-CORR-CTRL = 0689403 OR 0689303 OR 0315345 OR
174400                         0331245 OR 0694499 OR 0687599 OR
174500                         0691979 OR 0499799 OR 0673103
174600          MOVE   'SIM'        TO     CORR-LIB-JUL-09
174700     END-IF
174800*** FICHA 901507 - RESIDENCIAL VOLKSWAGEN
174900     IF   COD-CORR-CTRL    =   0008001 OR 0008002 OR 0008003 OR
175000                               0008004 OR 0008005 OR 0008006 OR
175100                               0008008 OR 0008011 OR 0008014 OR
175200                               0008028
175300          MOVE   'SIM'        TO     CORR-LIB-VOLKS-RES.
175400*** FICHA 901562
175500*    IF  COD-CORR-CTRL = 0358303
175600*         MOVE   'SIM'        TO     CORR-LIB-AON-HOLD-RS
175700*    END-IF
175800*** FICHA 1100352 - TARIFA 1010 E 1011 MAIO 2011
175900*** FICHA 1100705 - TARIFA 1016 E 1017 AGOSTO 2011 - INC CODIGO
176000     IF COD-CORR-CTRL = 0246301 OR 0358301 OR 0358302 OR
176100        0358303 OR 0358305 OR 0358306 OR 0358307 OR
176200        0358308 OR 0700302 OR 0711013 OR 0711799 OR
176300        0715427 OR 0724007 OR 0737699 OR 0483006
176400          MOVE   'SIM'        TO     CORR-LIB-AON-HOLD-SP
176500     END-IF
176600*** FICHA 1001144
176700*    IF  COD-CORR-CTRL = 0711799
176800*         MOVE   'SIM'        TO     CORR-LIB-AON-HOLD-MACAE
176900*    END-IF
177000*** FICHA 901639
177100     IF  COD-CORR-CTRL = 0691101 OR 0693477 OR 0693590 OR
177200                         0693695 OR 0693799 OR 0693802 OR
177300                         0693999 OR 0694005 OR 0694199 OR
177400                         0694299 OR 0697899 OR 0698499 OR
177500                         0699099
177600          MOVE   'SIM'        TO     CORR-LIB-ADD
177700     END-IF
177800*** FICHA 901790
177900     IF  COD-CORR-CTRL = 0403801
178000          MOVE   'SIM'        TO     CORR-LIB-LOCK
178100     END-IF
178200
178300*** FICHA 1000183
178400     IF  COD-CORR-CTRL = 0046901
178500          MOVE   'SIM'        TO     CORR-LIB-LAZAM
178600     END-IF
178700
178800*** FICHA 1000253
178900     IF  COD-CORR-CTRL = 0701401
179000          MOVE   'SIM'        TO     CORR-LIB-MAHESO
179100     END-IF
179200***FICHA 1000408
179300*    IF  COD-CORR-CTRL = 0358305
179400*         MOVE   'SIM'        TO     CORR-LIB-AON-HOLD-PR
179500*    END-IF
179600***FICHA 1000611
179700     IF  COD-CORR-CTRL = 0669699 OR 0457904 OR 0667604 OR
179800                         0699604 OR 0703804 OR 0400004 OR
179900                         0311604 OR 0650104
180000          MOVE   'SIM'        TO     CORR-LIB-RECIFE
180100     END-IF
180200     IF  COD-CORR-CTRL = 0707434
180300          MOVE   'SIM'        TO     CORR-LIB-SEKURIT
180400     END-IF
180500***FICHA 1000665
180600*    IF  COD-CORR-CTRL = 0358302
180700*         MOVE   'SIM'        TO     CORR-LIB-AON-HOLD-RJ
180800*    END-IF
180900***FICHA 1000655
181000     IF  COD-CORR-CTRL = 0618699
181100          MOVE   'SIM'        TO     CORR-LIB-SCAVASEG
181200     END-IF
181300     IF  COD-CORR-CTRL = 0041560
181400          MOVE   'SIM'        TO     CORR-LIB-SEGURALTA
181500     END-IF
181600     IF  COD-CORR-CTRL = 0702748
181700          MOVE   'SIM'        TO     CORR-LIB-TONETTE
181800     END-IF
181900     IF  COD-CORR-CTRL = 0613360
182000          MOVE   'SIM'        TO     CORR-LIB-LARES
182100     END-IF
182200     IF  COD-CORR-CTRL = 0703548
182300          MOVE   'SIM'        TO     CORR-LIB-ASSIS
182400     END-IF
182500     IF  COD-CORR-CTRL = 0698599
182600          MOVE   'SIM'        TO     CORR-LIB-GARSEG
182700     END-IF
182800     IF  COD-CORR-CTRL = 0681848
182900          MOVE   'SIM'        TO     CORR-LIB-INVEST
183000     END-IF
183100     IF  COD-CORR-CTRL = 0691099
183200          MOVE   'SIM'        TO     CORR-LIB-DL
183300     END-IF
183400     IF  COD-CORR-CTRL = 0352301
183500          MOVE   'SIM'        TO     CORR-LIB-ENSEG
183600     END-IF
183700     IF  COD-CORR-CTRL = 0049301
183800          MOVE   'SIM'        TO     CORR-LIB-HONDA
183900     END-IF
184000     IF  COD-CORR-CTRL = 0709004
184100          MOVE   'SIM'        TO     CORR-LIB-WALKER
184200     END-IF
184300*    IF  COD-CORR-CTRL = 0700302
184400*         MOVE   'SIM'        TO     CORR-LIB-AON-HOLD-ES
184500*    END-IF
184600
184700     MOVE  COD-TIP-DOC-CTRL      TO     TAB-COD-SIT
184800     IF    NUM-APOL-ANT-CTRL     =      0
184900           MOVE    1       TO    TAB-COD-SIT
185000     ELSE
185100           IF  COD-DIZER   NOT   =      0
185200               MOVE   2    TO    TAB-COD-SIT
185300           ELSE
185400               MOVE   3    TO    TAB-COD-SIT
185500           END-IF
185600     END-IF
185700
185800*--------         PROCURA TAB-PED-LOC          ------------------*
185900
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     WHENEVER  NOT FOUND GO TO   :001-60-NAO-LOC-PED-LOC   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
186000     EXEC SQL
186100          WHENEVER  NOT FOUND GO TO   :001-60-NAO-LOC-PED-LOC
186200     END-EXEC.
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     SELECT                                                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_ORG,                 COD_RAMO,               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NUM_PED,                 COD_TIP_LOGR_RISCO,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NOM_LOGR_RISCO,          DSC_COMPL_RISCO,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NOM_BAIRRO_RISCO,        NOM_CID_RISCO,          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          SIG_UF_RISCO,            NUM_CEP_RISCO,          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_DESC_APAR,           PER_DESC_PROGRES,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_IS_VR,               VAL_COEF_IS_VR,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          VAL_VR,                  TAB_CLASF,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_CLASF,               COD_COMPL_CLASF,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_CLASSE_OCUP,         COD_CONSTR,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_USER_DIGIT,          DAT_DIGIT,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          HOR_DIGIT,               COD_USER_LIBER,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          DAT_LIBER,               HOR_LIBER,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_SIT_ITEM,            PER_BONUS,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          QTD_EMPREG,              DSC_CLASF,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          NUM_INSP,                                        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_SEGUR_01,       COD_IDEN_SEGUR_02,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_SEGUR_03,       COD_IDEN_SEGUR_04,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_SEGUR_05,       COD_IDEN_SEGUR_06,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_SEGUR_07,       COD_IDEN_SEGUR_08,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_SEGUR_09,       COD_IDEN_SEGUR_10,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_TOT_SEGUR,                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_PROTEC_01,      COD_IDEN_PROTEC_02,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_PROTEC_03,      COD_IDEN_PROTEC_04,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_PROTEC_05,      COD_IDEN_PROTEC_06,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_PROTEC_07,      COD_IDEN_PROTEC_08,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_PROTEC_09,      COD_IDEN_PROTEC_10,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          PER_TOT_PROTEC,                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_PRODUTO,             COD_REGIAO,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          COD_IDEN_TARIF                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     INTO                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-ORG,                 :COD-RAMO,              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NUM-PED,                 :COD-TIP-LOGR-RISCO,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NOM-LOGR-RISCO,          :DSC-COMPL-RISCO,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NOM-BAIRRO-RISCO,        :NOM-CID-RISCO,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :SIG-UF-RISCO,            :NUM-CEP-RISCO,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-DESC-APAR,           :PER-DESC-PROGRES,      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-IS-VR,               :VAL-COEF-IS-VR,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :VAL-VR,                  :TAB-CLASF,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-CLASF,               :COD-COMPL-CLASF,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-CLASSE-OCUP,         :COD-CONSTR,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-USER-DIGIT,          :DAT-DIGIT,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :HOR-DIGIT,               :COD-USER-LIBER,        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :DAT-LIBER,               :HOR-LIBER,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-SIT-ITEM,            :PER-BONUS,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :QTD-EMPREG,              :DSC-CLASF,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :NUM-INSP-TAB,                                    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-SEGUR-01,       :COD-IDEN-SEGUR-02,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-SEGUR-03,       :COD-IDEN-SEGUR-04,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-SEGUR-05,       :COD-IDEN-SEGUR-06,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-SEGUR-07,       :COD-IDEN-SEGUR-08,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-SEGUR-09,       :COD-IDEN-SEGUR-10,     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-TOT-SEGUR,                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-PROTEC-01,      :COD-IDEN-PROTEC-02,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-PROTEC-03,      :COD-IDEN-PROTEC-04,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-PROTEC-05,      :COD-IDEN-PROTEC-06,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-PROTEC-07,      :COD-IDEN-PROTEC-08,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-PROTEC-09,      :COD-IDEN-PROTEC-10,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :PER-TOT-PROTEC,                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-PRODUTO,             :COD-REGIAO,            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         :COD-IDEN-TARIF                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     FROM       TAB_PED_LOC                                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     WHERE  NUM_PED       =     :NUM-PED                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  COD_RAMO      =     :COD-RAMO                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  COD_ORG       =     :COD-ORG                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  NUM_PED       <>     0                         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       AND  NUM_ITEM      =     :NUM-ITEM                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00109)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00110)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00111)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00112)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00113)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00114)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00115)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00116)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00117)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00118)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00119)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00120)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00121)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00122)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00123)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00124)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00125)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00045)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00046)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00047)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00048)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00049)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00050)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00126)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00127)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00128)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00129)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00130)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00131)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00132)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00133)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00134)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00135)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00136)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00137)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00138)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00139)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00140)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00141)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00142)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00143)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00144)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00145)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00146)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00147)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00148)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00149)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00150)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00151)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00152)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00153)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00154)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00155)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00156)
186300     EXEC SQL
186400          SELECT
186500               COD_ORG,                 COD_RAMO,
186600               NUM_PED,                 COD_TIP_LOGR_RISCO,
186700               NOM_LOGR_RISCO,          DSC_COMPL_RISCO,
186800               NOM_BAIRRO_RISCO,        NOM_CID_RISCO,
186900               SIG_UF_RISCO,            NUM_CEP_RISCO,
187000               PER_DESC_APAR,           PER_DESC_PROGRES,
187100               PER_IS_VR,               VAL_COEF_IS_VR,
187200               VAL_VR,                  TAB_CLASF,
187300               COD_CLASF,               COD_COMPL_CLASF,
187400               COD_CLASSE_OCUP,         COD_CONSTR,
187500               COD_USER_DIGIT,          DAT_DIGIT,
187600               HOR_DIGIT,               COD_USER_LIBER,
187700               DAT_LIBER,               HOR_LIBER,
187800               COD_SIT_ITEM,            PER_BONUS,
187900               QTD_EMPREG,              DSC_CLASF,
188000               NUM_INSP,
188100               COD_IDEN_SEGUR_01,       COD_IDEN_SEGUR_02,
188200               COD_IDEN_SEGUR_03,       COD_IDEN_SEGUR_04,
188300               COD_IDEN_SEGUR_05,       COD_IDEN_SEGUR_06,
188400               COD_IDEN_SEGUR_07,       COD_IDEN_SEGUR_08,
188500               COD_IDEN_SEGUR_09,       COD_IDEN_SEGUR_10,
188600               PER_TOT_SEGUR,
188700               COD_IDEN_PROTEC_01,      COD_IDEN_PROTEC_02,
188800               COD_IDEN_PROTEC_03,      COD_IDEN_PROTEC_04,
188900               COD_IDEN_PROTEC_05,      COD_IDEN_PROTEC_06,
189000               COD_IDEN_PROTEC_07,      COD_IDEN_PROTEC_08,
189100               COD_IDEN_PROTEC_09,      COD_IDEN_PROTEC_10,
189200               PER_TOT_PROTEC,
189300               COD_PRODUTO,             COD_REGIAO,
189400               COD_IDEN_TARIF
189500          INTO
189600              :COD-ORG,                 :COD-RAMO,
189700              :NUM-PED,                 :COD-TIP-LOGR-RISCO,
189800              :NOM-LOGR-RISCO,          :DSC-COMPL-RISCO,
189900              :NOM-BAIRRO-RISCO,        :NOM-CID-RISCO,
190000              :SIG-UF-RISCO,            :NUM-CEP-RISCO,
190100              :PER-DESC-APAR,           :PER-DESC-PROGRES,
190200              :PER-IS-VR,               :VAL-COEF-IS-VR,
190300              :VAL-VR,                  :TAB-CLASF,
190400              :COD-CLASF,               :COD-COMPL-CLASF,
190500              :COD-CLASSE-OCUP,         :COD-CONSTR,
190600              :COD-USER-DIGIT,          :DAT-DIGIT,
190700              :HOR-DIGIT,               :COD-USER-LIBER,
190800              :DAT-LIBER,               :HOR-LIBER,
190900              :COD-SIT-ITEM,            :PER-BONUS,
191000              :QTD-EMPREG,              :DSC-CLASF,
191100              :NUM-INSP-TAB,
191200              :COD-IDEN-SEGUR-01,       :COD-IDEN-SEGUR-02,
191300              :COD-IDEN-SEGUR-03,       :COD-IDEN-SEGUR-04,
191400              :COD-IDEN-SEGUR-05,       :COD-IDEN-SEGUR-06,
191500              :COD-IDEN-SEGUR-07,       :COD-IDEN-SEGUR-08,
191600              :COD-IDEN-SEGUR-09,       :COD-IDEN-SEGUR-10,
191700              :PER-TOT-SEGUR,
191800              :COD-IDEN-PROTEC-01,      :COD-IDEN-PROTEC-02,
191900              :COD-IDEN-PROTEC-03,      :COD-IDEN-PROTEC-04,
192000              :COD-IDEN-PROTEC-05,      :COD-IDEN-PROTEC-06,
192100              :COD-IDEN-PROTEC-07,      :COD-IDEN-PROTEC-08,
192200              :COD-IDEN-PROTEC-09,      :COD-IDEN-PROTEC-10,
192300              :PER-TOT-PROTEC,
192400              :COD-PRODUTO,             :COD-REGIAO,
192500              :COD-IDEN-TARIF
192600          FROM       TAB_PED_LOC
192700          WHERE  NUM_PED       =     :NUM-PED
192800            AND  COD_RAMO      =     :COD-RAMO
192900            AND  COD_ORG       =     :COD-ORG
193000            AND  NUM_PED       <>     0
193100            AND  NUM_ITEM      =     :NUM-ITEM
193200     END-EXEC.
193300
193400     PERFORM  020-00-BUSCA-VECTOS.
193500     PERFORM  030-00-BUSCA-PERC-CORR.
193600     PERFORM  040-00-BUSCA-CLASS-CORR.
193700     PERFORM  050-00-VERIF-CLAUSULA.
193800
193900     GO TO  001-99-INICIO-X.
194000     .
194100 001-50-NAO-LOC-EMIS.
194200     MOVE 'REGISTRO NAO ENCONTRADO NA TAB_CTRL_EMIS' TO
194300           DSC-ERR-NORMA-WS
194400     PERFORM  GRAVA-ERROS-FATAL.
194500
194600 001-55-NAO-LOC-PED.
194700     MOVE  'REGISTRO NAO ENCONTRADO NA TAB_PED ' TO
194800           DSC-ERR-NORMA-WS
194900     PERFORM  GRAVA-ERROS-FATAL.
195000
195100 001-56-DUPLIC-LOC-PED.
195200     MOVE  'REGISTRO DUPLICADO NA TAB_PED ' TO
195300           DSC-ERR-NORMA-WS
195400     PERFORM  GRAVA-ERROS-FATAL.
195500
195600 001-60-NAO-LOC-PED-LOC.
195700     MOVE  'REGISTRO NAO ENCONTRADO NA TAB_PED-LOC' TO
195800           DSC-ERR-NORMA-WS
195900     PERFORM   GRAVA-ERROS-FATAL.
196000
196100 001-99-INICIO-X.
196200     EXIT.
196300
196400*------------------------------------*
196500 020-00-BUSCA-VECTOS          SECTION.
196600*------------------------------------*
196700 020-01-BUSCA-VECTOS.
196800
196900     INITIALIZE   TAB-VENC-WS
197000     MOVE         ZEROS        TO      IND-WS.
197100
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      DECLARE   CUR_VENC  CURSOR    FOR                    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      SELECT NUM_PARC,   DAT_VENC                          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      FROM       TAB_PED_VENC                              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      WHERE  COD_ORG       =     :COD-ORG                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  COD_RAMO      =     :COD-RAMO                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  NUM_PED       =     :NUM-PED                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      ORDER  BY NUM_PARC                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
197200     EXEC SQL
197300           DECLARE   CUR_VENC  CURSOR    FOR
197400           SELECT NUM_PARC,   DAT_VENC
197500           FROM       TAB_PED_VENC
197600           WHERE  COD_ORG       =     :COD-ORG
197700             AND  COD_RAMO      =     :COD-RAMO
197800             AND  NUM_PED       =     :NUM-PED
197900           ORDER  BY NUM_PARC
198000     END-EXEC.
198100
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      OPEN   CUR_VENC                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
198200     EXEC SQL
198300           OPEN   CUR_VENC
198400     END-EXEC.
198500
198600 020-05-BUSCA-VECTOS.
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      WHENEVER NOT FOUND GO TO   :020-07-BUSCA-VECTOS      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
198700     EXEC SQL
198800           WHENEVER NOT FOUND GO TO   :020-07-BUSCA-VECTOS
198900     END-EXEC.
199000
199100
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      FETCH  CUR_VENC                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      INTO  :NUM-PARC-VENC,  :DAT-VENC-VENC                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00157)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00158)
199200     EXEC SQL
199300           FETCH  CUR_VENC
199400           INTO  :NUM-PARC-VENC,  :DAT-VENC-VENC
199500     END-EXEC.
199600
199700     ADD      1                 TO     IND-WS
199800     IF       IND-WS            >      NUM-OCOR-VENC-WS
199900              GO  TO   020-07-BUSCA-VECTOS.
200000
200100     MOVE     DAT-VENC-VENC     TO     DAT-VENC-WS (IND-WS)
200200
200300     GO TO  020-05-BUSCA-VECTOS.
200400
200500 020-07-BUSCA-VECTOS.
200600
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      CLOSE  CUR_VENC                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
200700     EXEC SQL
200800           CLOSE  CUR_VENC
200900     END-EXEC.
201000
201100
201200 020-99-BUSCA-VECTOS.
201300     EXIT.
201400
201500*-------------------------------*
201600 030-00-BUSCA-PERC-CORR   SECTION.
201700*-------------------------------*
201800 030-01-BUSCA-PERC-CORR.
201900
202000     INITIALIZE   TAB-CORR-WS
202100     MOVE         ZEROS        TO     IND-WS
202200                                      PERC-CORR-WS.
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      DECLARE   CUR_CORR CURSOR  FOR                       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      SELECT PER_CORR,      NUM_ORDEM_CORR                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        FROM     TAB_PED_CORR                              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       WHERE COD_ORG       =     :COD-ORG                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         AND COD_RAMO      =     :COD-RAMO                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         AND NUM_PED       =     :NUM-PED                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       ORDER BY NUM_ORDEM_CORR                             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
202300     EXEC SQL
202400           DECLARE   CUR_CORR CURSOR  FOR
202500           SELECT PER_CORR,      NUM_ORDEM_CORR
202600             FROM     TAB_PED_CORR
202700            WHERE COD_ORG       =     :COD-ORG
202800              AND COD_RAMO      =     :COD-RAMO
202900              AND NUM_PED       =     :NUM-PED
203000            ORDER BY NUM_ORDEM_CORR
203100     END-EXEC.
203200
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      OPEN   CUR_CORR                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
203300     EXEC SQL
203400           OPEN   CUR_CORR
203500     END-EXEC.
203600
203700 030-05-BUSCA-PERC-CORR.
203800
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      WHENEVER NOT FOUND GO TO   :030-08-BUSCA-PERC-CORR   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
203900     EXEC SQL
204000           WHENEVER NOT FOUND GO TO   :030-08-BUSCA-PERC-CORR
204100     END-EXEC.
204200
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      FETCH  CUR_CORR                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       INTO :PER-CORR-COR,    :NUM-ORDEM-CORR-COR          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00159)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00160)
204300     EXEC SQL
204400           FETCH  CUR_CORR
204500            INTO :PER-CORR-COR,    :NUM-ORDEM-CORR-COR
204600     END-EXEC.
204700
204800     ADD      1                 TO     IND-WS
204900     IF       IND-WS            >      NUM-OCOR-CORR-WS
205000              GO  TO  030-08-BUSCA-PERC-CORR.
205100
205200     MOVE    PER-CORR-COR            TO   PER-CORR-WS (IND-WS)
205300     ADD     PER-CORR-WS (IND-WS)    TO   PERC-CORR-WS
205400
205500     GO       TO      030-05-BUSCA-PERC-CORR.
205600
205700 030-08-BUSCA-PERC-CORR.
205800
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      CLOSE  CUR_CORR                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
205900     EXEC SQL
206000           CLOSE  CUR_CORR
206100     END-EXEC.
206200
206300 030-99-BUSCA-PERC-CORR.
206400     EXIT.
206500
206600*------------------------------------*
206700 040-00-BUSCA-CLASS-CORR       SECTION.
206800*------------------------------------*
206900 040-01-BUSCA-CLASS-CORR.
207000
207100** FICHA-0701423
207200     MOVE   99,99       TO     PERC-DSC-CML-WS.
207300     GO TO  040-99-BUSCA-CLASS-CORR.
207400
207500 040-02-BUSCA-CLASS-CORR.
207600
207700     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
207800         GO  TO  040-50-BUSCA-CLASS-CORR.
207900
208000     INITIALIZE   SOC-SEL-TAB-CORR-ESPEC-WS
208100
208200     MOVE  ZEROS                      TO  COD-MSG-RET-S00U033
208300     MOVE  SPACES                     TO  DSC-MSG-RET-S00U033
208400     MOVE 'DEOD99'                    TO  USER-ID-S00U033
208500     MOVE '001'                       TO  SCKPORT-S00U033
208600     MOVE  COD-CORR-CTRL              TO  COD-CORR-ESPEC
208700     MOVE  SOC-SEL-TAB-CORR-ESPEC-WS  TO  CMD-SQL-S00U033
208800
208900
209000     CALL    'S00U033'       USING       PRM-S00U033
209100     CANCEL  'S00U033'.
209200
209300     IF COD-MSG-RET-S00U033 NOT = ZEROS
209400        DISPLAY '#S00U033# ERRO DE LEITURA DO TBS-CORR-ESPEC  '
209500                '/'  SOC-SEL-TAB-CORR-ESPEC-WS
209600        DISPLAY '#S01U034#  >>' DSC-MSG-RET-S00U033 (01:700)
209700                             '<<'
209800        GO  TO  040-99-BUSCA-CLASS-CORR
209900     END-IF.
210000
210100     INITIALIZE CAMPO-RET-SOC
210200     UNSTRING  DSC-MSG-RET-S00U033
210300         DELIMITED BY ';' INTO
210400                  TAMANHO-RET-SOC
210500                  LINHA-RET-SOC
210600                  COLUNA-RET-SOC
210700                  TIPOCORR-RET-SOC.
210800
210900      IF    LINHA-RET-SOC   >   0
211000        IF  TIPOCORR-RET-SOC    =      1
211100            MOVE  25,00         TO     PERC-DSC-CML-WS
211200        ELSE
211300           IF  TIPOCORR-RET-SOC =      2
211400               MOVE  15,00      TO     PERC-DSC-CML-WS
211500           ELSE
211600               MOVE  0          TO     PERC-DSC-CML-WS
211700           END-IF
211800        END-IF
211900      END-IF.
212000      GO  TO  040-99-BUSCA-CLASS-CORR.
212100
212200 040-50-BUSCA-CLASS-CORR.
212300
212400     MOVE     ZEROS            TO      TIPO-PREF
212500     MOVE     COD-CORR-CTRL    TO      COD-CORR-PREF
212600
212700     EXEC SQL
212800           WHENEVER  NOT FOUND  CONTINUE
212900     END-EXEC.
213000
213100     EXEC SQL
213200          SELECT
213300               TIPO
213400          INTO
213500              :TIPO-PREF
213600          FROM   TBS_CORRETOR_PREFERENCIAL
213700          WHERE  COD_CORRETOR  =     :COD-CORR-PREF
213800     END-EXEC.
213900
214000        IF  TIPO-PREF           =      1
214100            MOVE  25,00         TO     PERC-DSC-CML-WS
214200        ELSE
214300           IF  TIPO-PREF        =      2
214400               MOVE  15,00      TO     PERC-DSC-CML-WS
214500           ELSE
214600               MOVE  0          TO     PERC-DSC-CML-WS
214700           END-IF
214800        END-IF.
214900
215000 040-99-BUSCA-CLASS-CORR.
215100        EXIT.
215200
215300*------------------------------------*
215400 050-00-VERIF-CLAUSULA        SECTION.
215500*------------------------------------*
215600 050-01-VERIF-CLAUSULA.
215700
215800     INITIALIZE  TAB-CLAU-WS
215900     MOVE        ZEROS       TO    IND-WS.
216000
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      DECLARE  CUR_CLAU           CURSOR FOR               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       SELECT  COD_CLAU                                    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         FROM      TAB_PED_CLAU                            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      WHERE  COD_ORG     =     :COD-ORG                    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  COD_RAMO    =     :COD-RAMO                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  NUM_PED     =     :NUM-PED                    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  NUM_ITEM    =     :NUM-ITEM                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00156)
216100     EXEC SQL
216200           DECLARE  CUR_CLAU           CURSOR FOR
216300            SELECT  COD_CLAU
216400              FROM      TAB_PED_CLAU
216500           WHERE  COD_ORG     =     :COD-ORG
216600             AND  COD_RAMO    =     :COD-RAMO
216700             AND  NUM_PED     =     :NUM-PED
216800             AND  NUM_ITEM    =     :NUM-ITEM
216900     END-EXEC
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       OPEN  CUR_CLAU                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
217000     EXEC SQL
217100            OPEN  CUR_CLAU
217200     END-EXEC.
217300
217400 050-03-VERIF-CLAUSULA.
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     WHENEVER  NOT FOUND GO TO   :050-05-VERIF-CLAUSULA    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
217500     EXEC SQL
217600          WHENEVER  NOT FOUND GO TO   :050-05-VERIF-CLAUSULA
217700     END-EXEC.
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      FETCH  CUR_CLAU                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      INTO :COD-CLAU                                       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00161)
217800     EXEC SQL
217900           FETCH  CUR_CLAU
218000           INTO :COD-CLAU
218100     END-EXEC
218200
218300     ADD      1                 TO     IND-WS.
218400     IF       IND-WS            >      NUM-OCOR-CLAU-WS
218500              GO  TO   050-05-VERIF-CLAUSULA.
218600     MOVE     COD-CLAU          TO     COD-CLAU-WS  (IND-WS)
218700
218800     GO  TO   050-03-VERIF-CLAUSULA.
218900
219000 050-05-VERIF-CLAUSULA.
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      CLOSE  CUR_CLAU                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
219100     EXEC SQL
219200           CLOSE  CUR_CLAU
219300     END-EXEC.
219400
219500 050-99-VERIF-CLAUSULA.
219600     EXIT.
219700
219800*=======================================*
219900 060-00-CARREGA-TAB-COBERT   SECTION.
220000*=======================================*
220100 060-01-CARREGA-TAB-COBERT.
220200
220300     INITIALIZE  TAB-COBERT-WS
220400     MOVE        ZEROS       TO    IND-WS
220500     MOVE        ZEROS       TO    COD-GRUPO-COBERT
220600
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      DECLARE  CUR_COBERT         CURSOR FOR               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       SELECT  T1.COD_COBERT,                              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '               T1.VAL_IS,         T1.PER_TAXA,             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '               T1.PER_DESC_COML,  T1.PER_DESC_EXP,         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '               T1.VAL_PR,         T2.PER_LIM_MAX_COBERT,   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '               T2.COD_LIM_COBERT, T2.COD_GRUPO_COBERT      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         FROM      TAB_PED_COBERT T1,                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '                   TAB_COBERT T2                           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        WHERE   COD_ORG        =     :COD-ORG              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   T1.COD_RAMO    =     :COD-RAMO             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   NUM_PED        =     :NUM-PED              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   NUM_PED        <>    0                     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   NUM_ITEM       =     :NUM-ITEM             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   T1.COD_RAMO    =     T2.COD_RAMO           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   T1.TAB_COBERT  =     T2.TAB_COBERT         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   T1.COD_COBERT  =     T2.COD_COBERT         '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   T2.COD_TARIF_INI <= :COD-IDEN-TARIF        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          AND   T2.COD_TARIF_TER >= :COD-IDEN-TARIF        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00156)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00155)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00155)
220700     EXEC SQL
220800           DECLARE  CUR_COBERT         CURSOR FOR
220900            SELECT  T1.COD_COBERT,
221000                    T1.VAL_IS,         T1.PER_TAXA,
221100                    T1.PER_DESC_COML,  T1.PER_DESC_EXP,
221200                    T1.VAL_PR,         T2.PER_LIM_MAX_COBERT,
221300                    T2.COD_LIM_COBERT, T2.COD_GRUPO_COBERT
221400              FROM      TAB_PED_COBERT T1,
221500                        TAB_COBERT T2
221600             WHERE   COD_ORG        =     :COD-ORG
221700               AND   T1.COD_RAMO    =     :COD-RAMO
221800               AND   NUM_PED        =     :NUM-PED
221900               AND   NUM_PED        <>    0
222000               AND   NUM_ITEM       =     :NUM-ITEM
222100               AND   T1.COD_RAMO    =     T2.COD_RAMO
222200               AND   T1.TAB_COBERT  =     T2.TAB_COBERT
222300               AND   T1.COD_COBERT  =     T2.COD_COBERT
222400               AND   T2.COD_TARIF_INI <= :COD-IDEN-TARIF
222500               AND   T2.COD_TARIF_TER >= :COD-IDEN-TARIF
222600     END-EXEC
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         OPEN  CUR_COBERT                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
222700     EXEC SQL
222800              OPEN  CUR_COBERT
222900     END-EXEC.
223000
223100 060-10-CARREGA-TAB-COBERT.
223200
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '   WHENEVER  NOT FOUND GO TO :060-80-CARREGA-TAB-COBERT    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
223300     EXEC SQL
223400        WHENEVER  NOT FOUND GO TO :060-80-CARREGA-TAB-COBERT
223500     END-EXEC.
223600
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        FETCH  CUR_COBERT                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         INTO :COD-COBERT-PD,                              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '              :VAL-IS-PD,          :PER-TAXA-PD,           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '              :PER-DESC-COML-PD,   :PER-DESC-EXP-PD,       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '              :VAL-PR-COBERT-PD,   :PER-LIM-MAX-COBERT,    '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '              :COD-LIM-COBERT,     :COD-GRUPO-COBERT       '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00162)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00163)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00164)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00165)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00166)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00167)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00168)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00169)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00170)
223700     EXEC SQL
223800             FETCH  CUR_COBERT
223900              INTO :COD-COBERT-PD,
224000                   :VAL-IS-PD,          :PER-TAXA-PD,
224100                   :PER-DESC-COML-PD,   :PER-DESC-EXP-PD,
224200                   :VAL-PR-COBERT-PD,   :PER-LIM-MAX-COBERT,
224300                   :COD-LIM-COBERT,     :COD-GRUPO-COBERT
224400     END-EXEC
224500
224600     ADD      1                  TO   IND-WS.
224700     IF       IND-WS             >    NUM-OCOR-COBERT-WS
224800              GO  TO   060-80-CARREGA-TAB-COBERT.
224900
225000     MOVE     COD-COBERT-PD      TO   TAB-COD-COBERT-WS (IND-WS)
225100     MOVE     VAL-IS-PD          TO   TAB-VAL-IS-WS-R   (IND-WS)
225200     MOVE     PER-TAXA-PD        TO   TAB-PER-TAXA-WS   (IND-WS)
225300     MOVE     PER-DESC-COML-PD   TO
225400                                   TAB-PER-DESC-COML-WS-R(IND-WS)
225500     MOVE     PER-DESC-EXP-PD    TO   TAB-PER-DESC-EXP-WS(IND-WS)
225600     MOVE     VAL-PR-COBERT-PD   TO   TAB-VAL-PR-WS      (IND-WS)
225700     MOVE     PER-LIM-MAX-COBERT
225800                                 TO   TAB-PER-LIM-MAX-WS-R(IND-WS)
225900     MOVE     COD-LIM-COBERT     TO   TAB-COD-LIM-WS(IND-WS)
226000
226100     IF       COD-GRUPO-COBERT   NOT EQUAL 1
226200              ADD   1            TO   COD-IDEN-ACES-WS
226300     END-IF
226400
226500     GO TO  060-10-CARREGA-TAB-COBERT.
226600
226700 060-80-CARREGA-TAB-COBERT.
226800
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        CLOSE  CUR_COBERT                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
226900     EXEC SQL
227000             CLOSE  CUR_COBERT
227100     END-EXEC.
227200
227300
227400 060-99-CARREGA-TAB-COBERT-X.
227500     EXIT.
227600
227700*=======================================*
227800 065-00-CARREGA-TAB-COB-SIN  SECTION.
227900*=======================================*
228000 065-01-CARREGA-TAB-COB-SIN.
228100
228200     INITIALIZE  TAB-COBERT-SIN-WS
228300     MOVE        ZEROS       TO    IND-WS
228400     MOVE  NUM-APOL-ANT-CTRL   TO  NUM-APOL-SIN
228500     MOVE  NUM-ITEM            TO  NUM-ITEM-SIN
228600
228700     DISPLAY 'NUM-APOL-SIN = ' NUM-APOL-SIN
228800     DISPLAY 'NUM-ITEM-SIN = ' NUM-ITEM-SIN
228900
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      DECLARE  CUR_COB_SIN        CURSOR FOR               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       SELECT  NUM_ITEM,                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '               DSC_INSTR_REMES,                            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '               SUM(VAL_PAG_SIN)                            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         FROM      TAB_SIN_PAG                             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       WHERE  COD_SEGURA    =      641                     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         AND  COD_LID       =      641                     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         AND  NUM_APOL      =     :NUM-APOL-SIN            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         AND  NUM_ITEM      =     :NUM-ITEM-SIN            '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         AND  COD_LIQD_SIN  IN    (211, 212, 213)          '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       GROUP BY NUM_ITEM, DSC_INSTR_REMES                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00171)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00172)
229000     EXEC SQL
229100           DECLARE  CUR_COB_SIN        CURSOR FOR
229200            SELECT  NUM_ITEM,
229300                    DSC_INSTR_REMES,
229400                    SUM(VAL_PAG_SIN)
229500              FROM      TAB_SIN_PAG
229600            WHERE  COD_SEGURA    =      641
229700              AND  COD_LID       =      641
229800              AND  NUM_APOL      =     :NUM-APOL-SIN
229900              AND  NUM_ITEM      =     :NUM-ITEM-SIN
230000              AND  COD_LIQD_SIN  IN    (211, 212, 213)
230100            GROUP BY NUM_ITEM, DSC_INSTR_REMES
230200     END-EXEC
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         OPEN  CUR_COB_SIN                                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
230300     EXEC SQL
230400              OPEN  CUR_COB_SIN
230500     END-EXEC.
230600
230700 065-10-CARREGA-TAB-COB-SIN.
230800
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '   WHENEVER  NOT FOUND GO TO :065-80-CARREGA-TAB-COB-SIN   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
230900     EXEC SQL
231000        WHENEVER  NOT FOUND GO TO :065-80-CARREGA-TAB-COB-SIN
231100     END-EXEC.
231200
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        FETCH  CUR_COB_SIN                                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         INTO :NUM-ITEM-SIN,                               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '              :DSC-INSTR-REMES-SIN,                        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '              :VAL-PAG-SIN                                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00172)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00173)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00174)
231300     EXEC SQL
231400             FETCH  CUR_COB_SIN
231500              INTO :NUM-ITEM-SIN,
231600                   :DSC-INSTR-REMES-SIN,
231700                   :VAL-PAG-SIN
231800     END-EXEC
231900     DISPLAY 'DSC-INSTR-REMES-SIN = ' DSC-INSTR-REMES-SIN
232000     DISPLAY 'VAL-PAG-SIN = ' VAL-PAG-SIN
232100
232200     MOVE NUM-ITEM-SIN         TO TAB-NUM-ITEM-SIN-WS
232300
232400     ADD   1                  TO   IND-WS.
232500
232600     IF    IND-WS             >    150     OR
232700           DSC-INSTR-REMES-SIN = SPACES
232800              GO  TO   065-80-CARREGA-TAB-COB-SIN.
232900
233000     MOVE DSC-INSTR-REMES-SIN  TO TAB-COD-COBERT-SIN-WS-R (IND-WS)
233100     MOVE VAL-PAG-SIN          TO TAB-VAL-PAG-SIN-WS-R  (IND-WS)
233200
233300     GO TO  065-10-CARREGA-TAB-COB-SIN.
233400
233500 065-80-CARREGA-TAB-COB-SIN.
233600
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        CLOSE  CUR_COB_SIN                                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
233700     EXEC SQL
233800             CLOSE  CUR_COB_SIN
233900     END-EXEC.
234000
234100 065-99-CARREGA-TAB-COB-SIN-X.
234200     EXIT.
234300
234400*=======================================*
234500 070-00-PROCESSA SECTION.
234600*=======================================*
234700 070-01-PROCESSA.
234800
234900     IF    COD-RAMO = 113
235000       IF  (COD-PRODUTO NOT < 2001 AND COD-PRODUTO NOT > 2049) OR
235100           (COD-PRODUTO NOT < 2051 AND COD-PRODUTO NOT > 2100) OR
235200           (COD-PRODUTO NOT < 2111 AND COD-PRODUTO NOT > 2138)
235300           GO  TO  070-99-PROCESSA-FIM
235400       END-IF
235500     END-IF
235600
235700     PERFORM  090-00-VERIFICA-LMG.
235800
235900     IF    COD-ESPEC-WS    =   'S'
236000       IF  COD-RAMO = 112
236100           MOVE  812  TO  COD-RAMO
236200           PERFORM  8200-00-PROCESSA-112
236300           MOVE  112  TO  COD-RAMO
236400           PERFORM  5112-00-RESSEGURO-112
236500       ELSE
236600           PERFORM  1500-00-PROCESSA-N-P
236700       END-IF
236800       GO  TO  070-99-PROCESSA-FIM
236900     END-IF
237000
237100     IF    COD-RAMO = 112
237200       IF  COD-PRODUTO = 1020 OR  1030 OR  1040
237300                     OR  1050 OR  1060 OR  1010
237400           MOVE  912  TO  COD-RAMO
237500           PERFORM  9200-00-PROCESSA-912
237600           MOVE  112  TO  COD-RAMO
237700           PERFORM  5112-00-RESSEGURO-112
237800           GO  TO  070-99-PROCESSA-FIM
237900       END-IF
238000     END-IF
238100
238200     IF    COD-RAMO = 112
238300           PERFORM  1200-00-PROCESSA-112
238400           PERFORM  5112-00-RESSEGURO-112
238500     END-IF
238600
238700     IF    COD-RAMO = 113
238800           PERFORM  1300-00-PROCESSA-113
238900           PERFORM  5113-00-RESSEGURO-113
239000     END-IF
239100
239200     IF    COD-RAMO = 114
239300           PERFORM  1400-00-PROCESSA-114
239400           PERFORM  5114-00-RESSEGURO-114
239500     END-IF
239600
239700     .
239800 070-99-PROCESSA-FIM.
239900     EXIT.
240000
240100*=======================================*
240200 1200-00-PROCESSA-112 SECTION.
240300*=======================================*
240400 1200-01-PROCESSA-112.
240500
240600      IF  ENDOSSO
240700          GO   TO  112-NORMA-3-5.
240800
240900 112-NORMA-1-4-1.
241000
241100      PERFORM 160-00-INSPECAO.
241200      IF  INSP-OBRIG-WS = 'SIM'
241300          MOVE  55   TO  COD-IDEN-STAT-WS
241400          MOVE  5222 TO  COD-ERR-NORMA-WS
241500          PERFORM  GRAVA-ERROS
241600      END-IF.
241700
241800 112-NORMA-1-4-2.
241900
242000     IF  NOT  RENOVA
242100         GO  TO  112-NORMA-3-1.
242200
242300     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
242400         GO  TO  112-NORMA-3-1.
242500
242600     PERFORM   200-00-BUSCA-RENOV
242700     IF   QTD-RENOV-SIN NOT = ZEROS
242800          PERFORM 065-00-CARREGA-TAB-COB-SIN
242900          PERFORM 170-00-INSPECAO-SIN
243000          IF  INSP-OBRIG-WS = 'SIM'
243100              MOVE  55   TO  COD-IDEN-STAT-WS
243200              MOVE  5222 TO  COD-ERR-NORMA-WS
243300              PERFORM  GRAVA-ERROS
243400          END-IF
243500     END-IF.
243600
243700 112-NORMA-3-1.
243800
243900**FICHA 0701423
244000**   IF   PERC-CORR-WS   >   60,00
244100**        MOVE   80     TO   COD-IDEN-STAT-WS
244200**        MOVE  122311  TO   COD-ERR-NORMA-WS
244300**        PERFORM  GRAVA-ERROS
244400**   END-IF.
244500
244600 112-NORMA-3-2.
244700
244800     MOVE ZEROS  TO  COD-ERR-NORMA-WS.
244900     IF   COD-CLASF  = '002 ' AND  COD-COMPL-CLASF  =  '23'
245000          MOVE  122321  TO  COD-ERR-NORMA-WS.
245100     IF   COD-CLASF  = '004 ' AND  COD-COMPL-CLASF  =  '23'
245200          MOVE  122322  TO  COD-ERR-NORMA-WS.
245300     IF   COD-CLASF  = '008 ' AND  COD-COMPL-CLASF  =  '21'
245400          MOVE  122323  TO  COD-ERR-NORMA-WS.
245500     IF   COD-CLASF  = '008 ' AND  COD-COMPL-CLASF  =  '24'
245600          MOVE  122324  TO  COD-ERR-NORMA-WS.
245700     IF   COD-CLASF  = '017 '
245800          MOVE  122325  TO  COD-ERR-NORMA-WS.
245900     IF   COD-CLASF  = '060 ' AND  COD-COMPL-CLASF  =  '21'
246000          MOVE  122326  TO  COD-ERR-NORMA-WS.
246100     IF   COD-CLASF  = '102 ' AND  COD-COMPL-CLASF  =  '22'
246200          MOVE  122327  TO  COD-ERR-NORMA-WS.
246300     IF   COD-CLASF  = '102 ' AND  COD-COMPL-CLASF  =  '28'
246400          MOVE  122328  TO  COD-ERR-NORMA-WS.
246500     IF   COD-CLASF  = '105 ' AND  COD-COMPL-CLASF  =  '22'
246600          MOVE  122329  TO  COD-ERR-NORMA-WS.
246700     IF   COD-CLASF  = '117 ' AND  COD-COMPL-CLASF  =  '21'
246800          MOVE  1223210 TO  COD-ERR-NORMA-WS.
246900     IF   COD-CLASF  = '118 ' AND  COD-COMPL-CLASF  =  '21'
247000          MOVE  1223211 TO  COD-ERR-NORMA-WS.
247100     IF   COD-CLASF  = '118 ' AND  COD-COMPL-CLASF  =  '23'
247200          MOVE  1223212 TO  COD-ERR-NORMA-WS.
247300     IF   COD-CLASF  = '121 ' AND  COD-COMPL-CLASF  =  '23'
247400          MOVE  1223213 TO  COD-ERR-NORMA-WS.
247500     IF   COD-CLASF  = '122 ' AND  COD-COMPL-CLASF  =  '21'
247600          MOVE  1223214 TO  COD-ERR-NORMA-WS.
247700     IF   COD-CLASF  = '133 ' AND  COD-COMPL-CLASF  =  '23'
247800          MOVE  1223215 TO  COD-ERR-NORMA-WS.
247900     IF   COD-CLASF  = '203 '
248000          MOVE  1223216 TO  COD-ERR-NORMA-WS.
248100     IF   COD-CLASF  = '236 '
248200          MOVE  1223217 TO  COD-ERR-NORMA-WS.
248300     IF   COD-CLASF  = '260 ' AND  COD-COMPL-CLASF  =  '11'
248400          MOVE  1223218 TO  COD-ERR-NORMA-WS.
248500     IF   COD-CLASF  = '260 ' AND  COD-COMPL-CLASF  =  '12'
248600          MOVE  1223219 TO  COD-ERR-NORMA-WS.
248700     IF   COD-CLASF  = '261 '
248800          MOVE  1223220 TO  COD-ERR-NORMA-WS.
248900     IF   COD-CLASF  = '292 '
249000          MOVE  1223221 TO  COD-ERR-NORMA-WS.
249100     IF   COD-CLASF  = '329 '
249200          MOVE  1223222 TO  COD-ERR-NORMA-WS.
249300     IF   COD-CLASF  = '369 ' AND  COD-COMPL-CLASF  =  '24'
249400          MOVE  1223223 TO  COD-ERR-NORMA-WS.
249500     IF   COD-CLASF  = '370 ' AND  COD-COMPL-CLASF  =  '28'
249600          MOVE  1223224 TO  COD-ERR-NORMA-WS.
249700     IF   COD-CLASF  = '370 ' AND  COD-COMPL-CLASF  =  '31'
249800          MOVE  1223225 TO  COD-ERR-NORMA-WS.
249900     IF   COD-CLASF  = '402 ' AND  COD-COMPL-CLASF  =  '23'
250000          MOVE  1223226 TO  COD-ERR-NORMA-WS.
250100     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '28'
250200          MOVE  1223227 TO  COD-ERR-NORMA-WS.
250300     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '32'
250400          MOVE  1223228 TO  COD-ERR-NORMA-WS.
250500     IF   COD-CLASF  = '426 '
250600          MOVE  1223229 TO  COD-ERR-NORMA-WS.
250700     IF   COD-CLASF  = '490 ' AND  COD-COMPL-CLASF  =  '22'
250800          MOVE  1223230 TO  COD-ERR-NORMA-WS.
250900     IF   COD-CLASF  = '495 ' AND  COD-COMPL-CLASF  =  '21'
251000          MOVE  1223231 TO  COD-ERR-NORMA-WS.
251100     IF   COD-CLASF  = '499 '
251200          MOVE  1223232 TO  COD-ERR-NORMA-WS.
251300     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '22'
251400          MOVE  1223233 TO  COD-ERR-NORMA-WS.
251500     IF   COD-CLASF  = '004 ' AND  COD-COMPL-CLASF  =  '25' AND
251600          COD-TARIF-S01U034 > 949
251700          MOVE  1223235 TO  COD-ERR-NORMA-WS.
251800     IF   COD-CLASF  = '010 ' AND  COD-TARIF-S01U034 > 949
251900          MOVE  1223236 TO  COD-ERR-NORMA-WS.
252000     IF   COD-CLASF  = '012 ' AND  COD-TARIF-S01U034 > 949
252100          MOVE  1223237 TO  COD-ERR-NORMA-WS.
252200     IF   COD-CLASF  = '071 ' AND  COD-TARIF-S01U034 > 949
252300          MOVE  1223238 TO  COD-ERR-NORMA-WS.
252400     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '11' AND
252500          COD-TARIF-S01U034 > 949  AND COD-TARIF-S01U034 < 958
252600          MOVE  1223239 TO  COD-ERR-NORMA-WS.
252700     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '24' AND
252800          COD-TARIF-S01U034 > 949  AND COD-TARIF-S01U034 < 958
252900          MOVE  1223240 TO  COD-ERR-NORMA-WS.
253000     IF   COD-CLASF  = '131 ' AND  COD-TARIF-S01U034 > 949
253100          MOVE  1223241 TO  COD-ERR-NORMA-WS.
253200     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '29' AND
253300          COD-TARIF-S01U034 > 949
253400          MOVE  1223242 TO  COD-ERR-NORMA-WS.
253500     IF   COD-CLASF  = '422 ' AND  COD-TARIF-S01U034 > 949
253600          MOVE  1223243 TO  COD-ERR-NORMA-WS.
253700     IF   COD-CLASF  = '436 ' AND  COD-TARIF-S01U034 > 949
253800          MOVE  1223244 TO  COD-ERR-NORMA-WS.
253900     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '21' AND
254000          COD-TARIF-S01U034 > 949
254100          MOVE  1223245 TO  COD-ERR-NORMA-WS.
254200     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '23' AND
254300          COD-TARIF-S01U034 > 949
254400          MOVE  1223246 TO  COD-ERR-NORMA-WS.
254500     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '11' AND
254600          COD-TARIF-S01U034 > 949
254700          MOVE  1223247 TO  COD-ERR-NORMA-WS.
254800     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '12' AND
254900          COD-TARIF-S01U034 > 949
255000          MOVE  1223248 TO  COD-ERR-NORMA-WS.
255100     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '21' AND
255200          COD-TARIF-S01U034 > 949
255300          MOVE  1223249 TO  COD-ERR-NORMA-WS.
255400     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '23' AND
255500          COD-TARIF-S01U034 > 949
255600          MOVE  1223250 TO  COD-ERR-NORMA-WS.
255700     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '25' AND
255800          COD-TARIF-S01U034 > 949
255900          MOVE  1223251 TO  COD-ERR-NORMA-WS.
256000     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '26' AND
256100          COD-TARIF-S01U034 > 949
256200          MOVE  1223252 TO  COD-ERR-NORMA-WS.
256300     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '27' AND
256400          COD-TARIF-S01U034 > 949
256500          MOVE  1223253 TO  COD-ERR-NORMA-WS.
256600     IF   COD-CLASF  = '381 ' AND  COD-COMPL-CLASF  =  '10' AND
256700          COD-TARIF-S01U034 > 989
256800          MOVE  1223254 TO  COD-ERR-NORMA-WS.
256900*** 1100705 - TARIFA 1016 E 1017 AGOSTO 2011
257000     IF   COD-CLASF  = '100 ' AND
257100          COD-TARIF-S01U034 > 1015
257200          MOVE  1223255 TO  COD-ERR-NORMA-WS.
257300
257400     IF   COD-ERR-NORMA-WS  NOT EQUAL ZEROS
257500          MOVE   80     TO   COD-IDEN-STAT-WS
257600          PERFORM  GRAVA-ERROS
257700     END-IF.
257800
257900 112-NORMA-3-3.
258000
258100     IF   LMG-WS        =   'SIM'
258200          MOVE   80     TO   COD-IDEN-STAT-WS
258300          MOVE  122331  TO   COD-ERR-NORMA-WS
258400          PERFORM  GRAVA-ERROS
258500     END-IF.
258600
258700 112-NORMA-3-4.
258800
258900*===================================================================
259000**  OS CRITERIOS PARA INSPECAO ESTAO SENDO TRATADOS NO PROGRAMA
259100**                          S01U027
259200*===================================================================
259300
259400 112-NORMA-3-5.
259500
259600     IF   NOT  ENDOSSO
259700          GO   TO  112-NORMA-3-6-1.
259800
259900 112-NORMA-3-5-1.
260000
260100     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   03
260200          MOVE  122351  TO   COD-ERR-NORMA-WS
260300          MOVE   80     TO   COD-IDEN-STAT-WS
260400          PERFORM  GRAVA-ERROS
260500     END-IF.
260600
260700 112-NORMA-3-5-2.
260800
260900     IF   COD-IDEN-ACES-WS   EQUAL  ZEROS
261000          MOVE   80     TO   COD-IDEN-STAT-WS
261100          MOVE  122352  TO   COD-ERR-NORMA-WS
261200          PERFORM  GRAVA-ERROS
261300     END-IF.
261400
261500 112-NORMA-3-5-3.
261600
261700     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   05
261800          MOVE   80     TO   COD-IDEN-STAT-WS
261900          MOVE  122353  TO   COD-ERR-NORMA-WS
262000          PERFORM  GRAVA-ERROS
262100     END-IF.
262200
262300     GO   TO   1200-99-PROCESSA-112.
262400
262500 112-NORMA-3-6-1.
262600
262700     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
262800       IF TIP-CUST-EMIS  NOT EQUAL   4   AND   5
262900          MOVE   80     TO   COD-IDEN-STAT-WS
263000          MOVE  122361  TO   COD-ERR-NORMA-WS
263100          PERFORM  GRAVA-ERROS
263200     END-IF.
263300
263400 112-NORMA-3-6-2.
263500
263600     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
263700       IF QTD-PARC   >  07
263800          MOVE   80     TO   COD-IDEN-STAT-WS
263900          MOVE  122362  TO   COD-ERR-NORMA-WS
264000          PERFORM  GRAVA-ERROS
264100     END-IF.
264200
264300 112-NORMA-3-6-3.
264400
264500     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
264600       IF DAT-COMPARA-WS  <   365
264700          MOVE   80      TO   COD-IDEN-STAT-WS
264800          MOVE  122363   TO   COD-ERR-NORMA-WS
264900          PERFORM  GRAVA-ERROS
265000     END-IF.
265100
265200 112-NORMA-3-6-4.
265300
265400     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
265500          MOVE   80     TO   COD-IDEN-STAT-WS
265600          MOVE  122364  TO   COD-ERR-NORMA-WS
265700          PERFORM  GRAVA-ERROS
265800     END-IF.
265900
266000 112-NORMA-3-6-5.
266100
266200 112-NORMA-3-7-1.
266300
266400 112-NORMA-4-1.
266500
266600**FICHA 0701423
266700**   IF   PERC-CORR-WS   >   30,00
266800**        MOVE   10     TO   COD-IDEN-STAT-WS
266900**        MOVE  122411  TO   COD-ERR-NORMA-WS
267000**        PERFORM  GRAVA-ERROS
267100**   END-IF.
267200
267300     IF  COD-TARIF-S01U034 < 950  GO TO 112-NORMA-4-2.
267400
267500     IF  COD-TARIF-S01U034 > 1007  GO TO 112-NORMA-4-1-2.
267600
267700     MOVE ZEROS  TO  COD-ERR-NORMA-WS.
267800     IF   COD-CLASF  = '424 ' AND  COD-COMPL-CLASF  =  '10'
267900          MOVE  122491  TO  COD-ERR-NORMA-WS.
268000     IF   COD-CLASF  = '004 ' AND  COD-COMPL-CLASF  =  '24'
268100          MOVE  122492  TO  COD-ERR-NORMA-WS.
268200     IF   COD-CLASF  = '018 '
268300          IF CORR-LIB-APISUL = 'SIM' AND COD-COMPL-CLASF = '11'
268400             CONTINUE
268500          ELSE
268600             MOVE  122493  TO  COD-ERR-NORMA-WS
268700          END-IF
268800     END-IF
268900     IF   COD-CLASF  = '019 ' AND CORR-LIB-RUBR-019 = 'NAO'
269000          MOVE  122494  TO  COD-ERR-NORMA-WS
269100     END-IF
269200*    IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '10' AND
269300*         COD-TARIF-S01U034 < 958
269400*         MOVE  122495  TO  COD-ERR-NORMA-WS.
269500*    IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '23' AND
269600*         COD-TARIF-S01U034 < 958
269700*         MOVE  122496  TO  COD-ERR-NORMA-WS.
269800     IF   COD-CLASF  = '130 ' AND  COD-TARIF-S01U034 > 957
269900          MOVE  122500  TO  COD-ERR-NORMA-WS.
270000     IF   COD-CLASF  = '433 ' AND  COD-TARIF-S01U034 > 959
270100          MOVE  122501  TO  COD-ERR-NORMA-WS.
270200     IF   COD-CLASF  = '527 ' AND  COD-TARIF-S01U034 > 959
270300          MOVE  122502  TO  COD-ERR-NORMA-WS.
270400     IF   COD-CLASF  = '235 '
270500          MOVE  122497  TO  COD-ERR-NORMA-WS.
270600     IF   COD-CLASF  = '246 '
270700          MOVE  122498  TO  COD-ERR-NORMA-WS.
270800     IF   COD-CLASF  = '364 '
270900          MOVE  122499  TO  COD-ERR-NORMA-WS.
271000     IF   COD-CLASF  = '380 '
271100          MOVE  1224100 TO  COD-ERR-NORMA-WS.
271200     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '25'
271300          MOVE  1224101 TO  COD-ERR-NORMA-WS.
271400     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '26'
271500          MOVE  1224102 TO  COD-ERR-NORMA-WS.
271600     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '27'
271700          MOVE  1224103 TO  COD-ERR-NORMA-WS.
271800     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '10'
271900          MOVE  1224104 TO  COD-ERR-NORMA-WS.
272000     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '12'
272100          MOVE  1224105 TO  COD-ERR-NORMA-WS.
272200     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '20'
272300          MOVE  1224106 TO  COD-ERR-NORMA-WS.
272400     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '22'
272500          MOVE  1224107 TO  COD-ERR-NORMA-WS.
272600     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '24'
272700          MOVE  1224108 TO  COD-ERR-NORMA-WS.
272800     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '25'
272900          MOVE  1224109 TO  COD-ERR-NORMA-WS.
273000     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '10'
273100          MOVE  1224110 TO  COD-ERR-NORMA-WS.
273200     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '20'
273300          MOVE  1224111 TO  COD-ERR-NORMA-WS.
273400     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '22'
273500          MOVE  1224112 TO  COD-ERR-NORMA-WS.
273600     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '24'
273700          MOVE  1224113 TO  COD-ERR-NORMA-WS.
273800     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '24'
273900          MOVE  1224114 TO  COD-ERR-NORMA-WS.
274000     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '25'
274100          MOVE  1224115 TO  COD-ERR-NORMA-WS.
274200     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '26'
274300          MOVE  1224116 TO  COD-ERR-NORMA-WS.
274400     IF   COD-CLASF  = '433 ' AND  COD-TARIF-S01U034 > 965
274500          MOVE  1224117 TO  COD-ERR-NORMA-WS.
274600     IF   COD-CLASF  = '527 ' AND  COD-TARIF-S01U034 > 965
274700          MOVE  1224118 TO  COD-ERR-NORMA-WS.
274800**FICHA 1001220
274900     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '11' AND
275000          COD-TARIF-S01U034 > 1001
275100          MOVE  1224120 TO  COD-ERR-NORMA-WS.
275200     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '12' AND
275300          COD-TARIF-S01U034 > 1001
275400          MOVE  1224121 TO  COD-ERR-NORMA-WS.
275500     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '13' AND
275600          COD-TARIF-S01U034 > 1001
275700          MOVE  1224122 TO  COD-ERR-NORMA-WS.
275800     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '14' AND
275900          COD-TARIF-S01U034 > 1001
276000          MOVE  1224123 TO  COD-ERR-NORMA-WS.
276100     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '15' AND
276200          COD-TARIF-S01U034 > 1001
276300          MOVE  1224124 TO  COD-ERR-NORMA-WS.
276400     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '33' AND
276500          COD-TARIF-S01U034 > 1001
276600          MOVE  1224125 TO  COD-ERR-NORMA-WS.
276700     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '34' AND
276800          COD-TARIF-S01U034 > 1001
276900          MOVE  1224126 TO  COD-ERR-NORMA-WS.
277000     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '30' AND
277100          COD-TARIF-S01U034 > 1001
277200          MOVE  1224127 TO  COD-ERR-NORMA-WS.
277300     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '31' AND
277400          COD-TARIF-S01U034 > 1001
277500          MOVE  1224128 TO  COD-ERR-NORMA-WS.
277600     IF   COD-CLASF  = '020 ' AND  COD-COMPL-CLASF  =  '20' AND
277700          COD-TARIF-S01U034 > 1001
277800          MOVE  1224129 TO  COD-ERR-NORMA-WS.
277900     IF   COD-CLASF  = '020 ' AND  COD-COMPL-CLASF  =  '21' AND
278000          COD-TARIF-S01U034 > 1001
278100          MOVE  1224130 TO  COD-ERR-NORMA-WS.
278200     IF   COD-CLASF  = '115 ' AND  COD-COMPL-CLASF  =  '20' AND
278300          COD-TARIF-S01U034 > 1001
278400          MOVE  1224131 TO  COD-ERR-NORMA-WS.
278500     IF   COD-CLASF  = '115 ' AND  COD-COMPL-CLASF  =  '21' AND
278600          COD-TARIF-S01U034 > 1001
278700          MOVE  1224132 TO  COD-ERR-NORMA-WS.
278800     IF   COD-CLASF  = '115 ' AND  COD-COMPL-CLASF  =  '22' AND
278900          COD-TARIF-S01U034 > 1001
279000          MOVE  1224133 TO  COD-ERR-NORMA-WS.
279100     IF   COD-CLASF  = '117 ' AND  COD-COMPL-CLASF  =  '20' AND
279200          COD-TARIF-S01U034 > 1001
279300          MOVE  1224134 TO  COD-ERR-NORMA-WS.
279400     IF   COD-CLASF  = '117 ' AND  COD-COMPL-CLASF  =  '21' AND
279500          COD-TARIF-S01U034 > 1001
279600          MOVE  1224135 TO  COD-ERR-NORMA-WS.
279700     IF   COD-CLASF  = '117 ' AND  COD-COMPL-CLASF  =  '22' AND
279800          COD-TARIF-S01U034 > 1001
279900          MOVE  1224136 TO  COD-ERR-NORMA-WS.
280000     IF   COD-CLASF  = '231 ' AND  COD-COMPL-CLASF  =  '20' AND
280100          COD-TARIF-S01U034 > 1001
280200          MOVE  1224137 TO  COD-ERR-NORMA-WS.
280300     IF   COD-CLASF  = '245 ' AND  COD-COMPL-CLASF  =  '20' AND
280400          COD-TARIF-S01U034 > 1001
280500          MOVE  1224138 TO  COD-ERR-NORMA-WS.
280600     IF   COD-CLASF  = '245 ' AND  COD-COMPL-CLASF  =  '21' AND
280700          COD-TARIF-S01U034 > 1001
280800          MOVE  1224139 TO  COD-ERR-NORMA-WS.
280900     IF   COD-CLASF  = '492 ' AND  COD-COMPL-CLASF  =  '20' AND
281000          COD-TARIF-S01U034 > 1001
281100          MOVE  1224140 TO  COD-ERR-NORMA-WS.
281200     IF   COD-CLASF  = '492 ' AND  COD-COMPL-CLASF  =  '21' AND
281300          COD-TARIF-S01U034 > 1001
281400          MOVE  1224141 TO  COD-ERR-NORMA-WS.
281500     IF   COD-CLASF  = '263 ' AND  COD-COMPL-CLASF  =  '10' AND
281600          COD-TARIF-S01U034 > 1001
281700          MOVE  1224119 TO  COD-ERR-NORMA-WS.
281800     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '10' AND
281900          COD-TARIF-S01U034 > 965
282000          MOVE  122500  TO  COD-ERR-NORMA-WS.
282100     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '12' AND
282200          COD-TARIF-S01U034 > 965
282300          MOVE  122500  TO  COD-ERR-NORMA-WS.
282400     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '20' AND
282500          COD-TARIF-S01U034 > 965
282600          MOVE  122500  TO  COD-ERR-NORMA-WS.
282700     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '21' AND
282800          COD-TARIF-S01U034 > 965
282900          MOVE  122500  TO  COD-ERR-NORMA-WS.
283000     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '22' AND
283100          COD-TARIF-S01U034 > 965
283200          MOVE  122500  TO  COD-ERR-NORMA-WS.
283300     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '23' AND
283400          COD-TARIF-S01U034 > 965
283500          MOVE  122500  TO  COD-ERR-NORMA-WS.
283600     IF   COD-CLASF  = '434 ' AND  COD-TARIF-S01U034 > 965
283700          MOVE  122503  TO  COD-ERR-NORMA-WS.
283800     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '11' AND
283900          COD-TARIF-S01U034 > 969
284000          MOVE  122504  TO  COD-ERR-NORMA-WS.
284100     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '14' AND
284200          COD-TARIF-S01U034 > 969
284300          MOVE  122505  TO  COD-ERR-NORMA-WS.
284400     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '30' AND
284500          COD-TARIF-S01U034 > 969
284600          MOVE  122506  TO  COD-ERR-NORMA-WS.
284700     IF   COD-CLASF  = '374 ' AND  COD-COMPL-CLASF  =  '18' AND
284800          COD-TARIF-S01U034 > 969
284900          MOVE  122507  TO  COD-ERR-NORMA-WS.
285000     IF   COD-CLASF  = '382 ' AND  COD-COMPL-CLASF  =  '10' AND
285100          COD-TARIF-S01U034 > 969
285200          MOVE  122508  TO  COD-ERR-NORMA-WS.
285300     IF   COD-CLASF  = '472 ' AND  COD-COMPL-CLASF  =  '10' AND
285400          COD-TARIF-S01U034 > 969
285500          MOVE  122509  TO  COD-ERR-NORMA-WS.
285600     IF   COD-CLASF  = '523 ' AND  COD-COMPL-CLASF  =  '17' AND
285700          COD-TARIF-S01U034 > 969
285800          MOVE  122510  TO  COD-ERR-NORMA-WS.
285900     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '20' AND
286000          COD-TARIF-S01U034 > 975
286100          MOVE  122511  TO  COD-ERR-NORMA-WS.
286200     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '21' AND
286300          COD-TARIF-S01U034 > 975
286400          MOVE  122512  TO  COD-ERR-NORMA-WS.
286500     IF   COD-CLASF  = '202 ' AND COD-TARIF-S01U034 > 975
286600          MOVE  122513  TO  COD-ERR-NORMA-WS.
286700     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '13' AND
286800          COD-TARIF-S01U034 > 981
286900          MOVE  122514  TO  COD-ERR-NORMA-WS.
287000     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '14' AND
287100          COD-TARIF-S01U034 > 981
287200          MOVE  122515  TO  COD-ERR-NORMA-WS.
287300     IF   COD-ERR-NORMA-WS  NOT EQUAL ZEROS
287400          MOVE   10     TO   COD-IDEN-STAT-WS
287500          PERFORM  GRAVA-ERROS
287600     END-IF.
287700     GO TO 112-NORMA-4-2.
287800
287900 112-NORMA-4-1-2.
288000     MOVE ZEROS  TO  COD-ERR-NORMA-WS.
288100     IF   COD-CLASF  = '424 ' AND  COD-COMPL-CLASF  =  '10'
288200          MOVE  1223119  TO  COD-ERR-NORMA-WS.
288300     IF   COD-CLASF  = '004 ' AND  COD-COMPL-CLASF  =  '24'
288400          MOVE  1223100  TO  COD-ERR-NORMA-WS.
288500     IF   COD-CLASF  = '018 '
288600          IF CORR-LIB-APISUL = 'SIM' AND COD-COMPL-CLASF = '11'
288700             CONTINUE
288800          ELSE
288900             MOVE  1223101  TO  COD-ERR-NORMA-WS
289000          END-IF
289100     END-IF
289200     IF   COD-CLASF  = '019 ' AND CORR-LIB-RUBR-019 = 'NAO'
289300          MOVE  1223102 TO  COD-ERR-NORMA-WS
289400     END-IF
289500     IF   COD-CLASF  = '433 '
289600          MOVE  1223120  TO  COD-ERR-NORMA-WS.
289700     IF   COD-CLASF  = '527 '
289800          MOVE  1223139  TO  COD-ERR-NORMA-WS.
289900     IF   COD-CLASF  = '235 '
290000          MOVE  1223110  TO  COD-ERR-NORMA-WS.
290100     IF   COD-CLASF  = '246 '
290200          MOVE  1223111  TO  COD-ERR-NORMA-WS.
290300     IF   COD-CLASF  = '364 '
290400          MOVE  1223112  TO  COD-ERR-NORMA-WS.
290500     IF   COD-CLASF  = '380 '
290600          MOVE  1223114 TO  COD-ERR-NORMA-WS.
290700     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '25'
290800          MOVE  1223116 TO  COD-ERR-NORMA-WS.
290900     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '26'
291000          MOVE  1223117 TO  COD-ERR-NORMA-WS.
291100     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '27'
291200          MOVE  1223118 TO  COD-ERR-NORMA-WS.
291300     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '10'
291400          MOVE  1223122 TO  COD-ERR-NORMA-WS.
291500     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '12'
291600          MOVE  1223123 TO  COD-ERR-NORMA-WS.
291700     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '20'
291800          MOVE  1223124 TO  COD-ERR-NORMA-WS.
291900     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '22'
292000          MOVE  1223125 TO  COD-ERR-NORMA-WS.
292100     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '24'
292200          MOVE  1223126 TO  COD-ERR-NORMA-WS.
292300     IF   COD-CLASF  = '437 ' AND  COD-COMPL-CLASF  =  '25'
292400          MOVE  1223127 TO  COD-ERR-NORMA-WS.
292500     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '10'
292600          MOVE  1223128 TO  COD-ERR-NORMA-WS.
292700     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '20'
292800          MOVE  1223131 TO  COD-ERR-NORMA-WS.
292900     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '22'
293000          MOVE  1223132 TO  COD-ERR-NORMA-WS.
293100     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '24'
293200          MOVE  1223133 TO  COD-ERR-NORMA-WS.
293300     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '24'
293400          MOVE  1223135 TO  COD-ERR-NORMA-WS.
293500     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '25'
293600          MOVE  1223136 TO  COD-ERR-NORMA-WS.
293700     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '26'
293800          MOVE  1223137 TO  COD-ERR-NORMA-WS.
293900     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '11'
294000          MOVE  1224120 TO  COD-ERR-NORMA-WS.
294100     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '12'
294200          MOVE  1224121 TO  COD-ERR-NORMA-WS.
294300     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '13'
294400          MOVE  1224122 TO  COD-ERR-NORMA-WS.
294500     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '14'
294600          MOVE  1224123 TO  COD-ERR-NORMA-WS.
294700     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '15'
294800          MOVE  1224124 TO  COD-ERR-NORMA-WS.
294900     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '33'
295000          MOVE  1224125 TO  COD-ERR-NORMA-WS.
295100     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '34'
295200          MOVE  1224126 TO  COD-ERR-NORMA-WS.
295300     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '30'
295400          MOVE  1224127 TO  COD-ERR-NORMA-WS.
295500     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '31'
295600          MOVE  1224128 TO  COD-ERR-NORMA-WS.
295700     IF   COD-CLASF  = '020 ' AND  COD-COMPL-CLASF  =  '20'
295800          MOVE  1224129 TO  COD-ERR-NORMA-WS.
295900     IF   COD-CLASF  = '020 ' AND  COD-COMPL-CLASF  =  '21'
296000          MOVE  1224130 TO  COD-ERR-NORMA-WS.
296100     IF   COD-CLASF  = '115 ' AND  COD-COMPL-CLASF  =  '20'
296200          MOVE  1224131 TO  COD-ERR-NORMA-WS.
296300     IF   COD-CLASF  = '115 ' AND  COD-COMPL-CLASF  =  '21'
296400          MOVE  1224132 TO  COD-ERR-NORMA-WS.
296500     IF   COD-CLASF  = '115 ' AND  COD-COMPL-CLASF  =  '22'
296600          MOVE  1224133 TO  COD-ERR-NORMA-WS.
296700     IF   COD-CLASF  = '117 ' AND  COD-COMPL-CLASF  =  '20'
296800          MOVE  1224134 TO  COD-ERR-NORMA-WS.
296900     IF   COD-CLASF  = '117 ' AND  COD-COMPL-CLASF  =  '21'
297000          MOVE  1224135 TO  COD-ERR-NORMA-WS.
297100     IF   COD-CLASF  = '117 ' AND  COD-COMPL-CLASF  =  '22'
297200          MOVE  1224136 TO  COD-ERR-NORMA-WS.
297300     IF   COD-CLASF  = '231 ' AND  COD-COMPL-CLASF  =  '20'
297400          MOVE  1224137 TO  COD-ERR-NORMA-WS.
297500     IF   COD-CLASF  = '245 ' AND  COD-COMPL-CLASF  =  '20'
297600          MOVE  1224138 TO  COD-ERR-NORMA-WS.
297700     IF   COD-CLASF  = '245 ' AND  COD-COMPL-CLASF  =  '21'
297800          MOVE  1224139 TO  COD-ERR-NORMA-WS.
297900     IF   COD-CLASF  = '492 ' AND  COD-COMPL-CLASF  =  '20'
298000          MOVE  1224140 TO  COD-ERR-NORMA-WS.
298100     IF   COD-CLASF  = '492 ' AND  COD-COMPL-CLASF  =  '21'
298200          MOVE  1224141 TO  COD-ERR-NORMA-WS.
298300     IF   COD-CLASF  = '263 ' AND  COD-COMPL-CLASF  =  '10'
298400          MOVE  1224119 TO  COD-ERR-NORMA-WS.
298500     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '10'
298600          MOVE  1223103  TO  COD-ERR-NORMA-WS.
298700     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '12'
298800          MOVE  1223103  TO  COD-ERR-NORMA-WS.
298900     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '20'
299000          MOVE  1223103  TO  COD-ERR-NORMA-WS.
299100     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '21'
299200          MOVE  1223103  TO  COD-ERR-NORMA-WS.
299300     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '22'
299400          MOVE  1223103  TO  COD-ERR-NORMA-WS.
299500     IF   COD-CLASF  = '130 ' AND  COD-COMPL-CLASF  =  '23'
299600          MOVE  1223103  TO  COD-ERR-NORMA-WS.
299700     IF   COD-CLASF  = '434 '
299800          MOVE  1223121  TO  COD-ERR-NORMA-WS.
299900     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '11'
300000          MOVE  1223104  TO  COD-ERR-NORMA-WS.
300100     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '14'
300200          MOVE  1223105  TO  COD-ERR-NORMA-WS.
300300     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '30'
300400          MOVE  1223108 TO  COD-ERR-NORMA-WS.
300500     IF   COD-CLASF  = '374 ' AND  COD-COMPL-CLASF  =  '18'
300600          MOVE  1223113  TO  COD-ERR-NORMA-WS.
300700     IF   COD-CLASF  = '378 ' AND  COD-COMPL-CLASF  =  '10'
300800***  1100864 - TARIFA 1018 E 1019 SETEMBRO 2011 ALTERADO ABAIXO
300900          MOVE  1223115  TO  COD-ERR-NORMA-WS.
301000***       MOVE  1223256  TO  COD-ERR-NORMA-WS.
301100     IF   COD-CLASF  = '472 ' AND  COD-COMPL-CLASF  =  '10'
301200          MOVE  1223134  TO  COD-ERR-NORMA-WS.
301300     IF   COD-CLASF  = '523 ' AND  COD-COMPL-CLASF  =  '17'
301400          MOVE  1223138  TO  COD-ERR-NORMA-WS.
301500     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '20'
301600          MOVE  1223106  TO  COD-ERR-NORMA-WS.
301700     IF   COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '21'
301800          MOVE  1223107  TO  COD-ERR-NORMA-WS.
301900     IF   COD-CLASF  = '202 '
302000          MOVE  1223109  TO  COD-ERR-NORMA-WS.
302100     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '13'
302200          MOVE  1223129  TO  COD-ERR-NORMA-WS.
302300     IF   COD-CLASF  = '438 ' AND  COD-COMPL-CLASF  =  '14'
302400          MOVE  1223130  TO  COD-ERR-NORMA-WS.
302500
302600     IF   COD-ERR-NORMA-WS  NOT EQUAL ZEROS
302700          MOVE   10     TO   COD-IDEN-STAT-WS
302800          PERFORM  GRAVA-ERROS
302900     END-IF.
303000 112-NORMA-4-2.
303100
303200     PERFORM 100-00-CLASSE-CONSTRUCAO
303300     IF   CUMPRE-NORMA  =  'NAO'
303400          MOVE   10     TO  COD-IDEN-STAT-WS
303500          MOVE  122421  TO  COD-ERR-NORMA-WS
303600          PERFORM  GRAVA-ERROS
303700     END-IF.
303800
303900 112-NORMA-4-3-1.
304000
304100     IF  COD-CLASF NOT = '018 ' AND
304200         COD-CLASF NOT = '138 '
304300         GO TO 112-NORMA-4-3-1-X.
304400
304500     MOVE    'SIM'    TO    CUMPRE-NORMA
304600     MOVE     1       TO   IND-WS
304700     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
304800        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS    OR
304900        CUMPRE-NORMA = 'NAO'
305000**FICHA 0801347
305100           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
305200           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
305300               IF CORR-LIB-APISUL = 'SIM' AND
305400                  VAL-IS-AUX < 300000,01
305500                  CONTINUE
305600               ELSE
305700                  MOVE  122431  TO  COD-ERR-NORMA-WS
305800                  MOVE  'NAO'   TO  CUMPRE-NORMA
305900               END-IF
306000           END-IF
306100           ADD     1         TO   IND-WS
306200     END-PERFORM.
306300
306400     IF   CUMPRE-NORMA =  'NAO'
306500          MOVE   10    TO  COD-IDEN-STAT-WS
306600          PERFORM  GRAVA-ERROS
306700     END-IF.
306800
306900 112-NORMA-4-3-1-X.
307000
307100     IF   COD-CLASF NOT = '374'
307200          GO TO 112-NORMA-4-3-2.
307300
307400     MOVE     ZEROS     TO   VAL-IS-4-3-1-WS
307500     MOVE     1         TO   IND-WS
307600     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
307700       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
307800           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
307900           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
308000               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-1-WS
308100           END-IF
308200           ADD     1         TO   IND-WS
308300     END-PERFORM.
308400
308500     IF   VAL-IS-4-3-1-WS   >   200000,00
308600          MOVE      10  TO  COD-IDEN-STAT-WS
308700          MOVE  122431  TO  COD-ERR-NORMA-WS
308800          PERFORM  GRAVA-ERROS
308900     END-IF.
309000
309100 112-NORMA-4-3-2.
309200
309300     IF  COD-CLASF NOT = '001 ' AND
309400         COD-CLASF NOT = '006 ' AND
309500         COD-CLASF NOT = '232 ' AND
309600         COD-CLASF NOT = '420 '
309700         GO TO 112-NORMA-4-3-5.
309800
309900     MOVE    'SIM'    TO   CUMPRE-NORMA
310000     MOVE     1       TO   IND-WS
310100     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
310200        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS    OR
310300        CUMPRE-NORMA = 'NAO'
310400           IF  TAB-COD-COBERT-WS(IND-WS) = '0024'
310500               MOVE  122432  TO  COD-ERR-NORMA-WS
310600               MOVE  'NAO'   TO  CUMPRE-NORMA
310700           END-IF
310800           IF  TAB-COD-COBERT-WS(IND-WS) = '0025'
310900               MOVE  122433  TO  COD-ERR-NORMA-WS
311000               MOVE  'NAO'   TO  CUMPRE-NORMA
311100           END-IF
311200           IF  TAB-COD-COBERT-WS(IND-WS) = '0026'
311300               MOVE  122434  TO  COD-ERR-NORMA-WS
311400               MOVE  'NAO'   TO  CUMPRE-NORMA
311500           END-IF
311600           ADD     1         TO   IND-WS
311700     END-PERFORM.
311800
311900     IF   CUMPRE-NORMA = 'NAO'
312000          MOVE   10  TO  COD-IDEN-STAT-WS
312100          PERFORM  GRAVA-ERROS
312200     END-IF.
312300
312400 112-NORMA-4-3-5.
312500
312600     IF  COD-CLASF NOT = '471 '
312700         GO TO 112-NORMA-4-3-7.
312800
312900     MOVE    'SIM'    TO    CUMPRE-NORMA
313000     MOVE     1       TO   IND-WS
313100     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
313200        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS    OR
313300        CUMPRE-NORMA = 'NAO'
313400           IF  TAB-COD-COBERT-WS(IND-WS) = '0009'
313500               MOVE  122435  TO  COD-ERR-NORMA-WS
313600               MOVE  'NAO'   TO  CUMPRE-NORMA
313700           END-IF
313800           IF  TAB-COD-COBERT-WS(IND-WS) = '0010'
313900               MOVE  122436  TO  COD-ERR-NORMA-WS
314000               MOVE  'NAO'   TO  CUMPRE-NORMA
314100           END-IF
314200           IF  TAB-COD-COBERT-WS(IND-WS) = '0028'
314300               MOVE  122437  TO  COD-ERR-NORMA-WS
314400               MOVE  'NAO'   TO  CUMPRE-NORMA
314500           END-IF
314600           IF  TAB-COD-COBERT-WS(IND-WS) = '0029'
314700               MOVE  122438  TO  COD-ERR-NORMA-WS
314800               MOVE  'NAO'   TO  CUMPRE-NORMA
314900           END-IF
315000           IF  TAB-COD-COBERT-WS(IND-WS) = '0038'
315100               MOVE  122439  TO  COD-ERR-NORMA-WS
315200               MOVE  'NAO'   TO  CUMPRE-NORMA
315300           END-IF
315400           ADD     1         TO   IND-WS
315500     END-PERFORM.
315600
315700     IF   CUMPRE-NORMA = 'NAO'
315800          MOVE   10  TO  COD-IDEN-STAT-WS
315900          PERFORM  GRAVA-ERROS
316000     END-IF.
316100
316200 112-NORMA-4-3-7.
316300
316400     IF  COD-CLASF NOT = '024 '
316500         GO TO 112-NORMA-4-3-9.
316600
316700     MOVE    'SIM'    TO    CUMPRE-NORMA
316800     MOVE     1       TO   IND-WS
316900     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
317000        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS    OR
317100        CUMPRE-NORMA = 'NAO'
317200           IF  TAB-COD-COBERT-WS(IND-WS) = '0028'
317300               MOVE  122437  TO  COD-ERR-NORMA-WS
317400               MOVE  'NAO'   TO  CUMPRE-NORMA
317500           END-IF
317600           IF  TAB-COD-COBERT-WS(IND-WS) = '0029'
317700               MOVE  122438  TO  COD-ERR-NORMA-WS
317800               MOVE  'NAO'   TO  CUMPRE-NORMA
317900           END-IF
318000           IF  TAB-COD-COBERT-WS(IND-WS) = '0038'
318100               MOVE  122439  TO  COD-ERR-NORMA-WS
318200               MOVE  'NAO'   TO  CUMPRE-NORMA
318300           END-IF
318400           ADD     1         TO   IND-WS
318500     END-PERFORM.
318600
318700     IF   CUMPRE-NORMA = 'NAO'
318800          MOVE   10  TO  COD-IDEN-STAT-WS
318900          PERFORM  GRAVA-ERROS
319000     END-IF.
319100
319200 112-NORMA-4-3-9.
319300
319400     IF  COD-CLASF NOT = '281 '
319500         GO TO 112-NORMA-4-3-9-X.
319600
319700     MOVE    'SIM'    TO    CUMPRE-NORMA
319800     MOVE     1       TO   IND-WS
319900     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
320000        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS    OR
320100        CUMPRE-NORMA = 'NAO'
320200           IF  TAB-COD-COBERT-WS(IND-WS) = '0038'
320300               MOVE  122439  TO  COD-ERR-NORMA-WS
320400               MOVE  'NAO'   TO  CUMPRE-NORMA
320500           END-IF
320600           ADD     1         TO  IND-WS
320700     END-PERFORM.
320800
320900     IF   CUMPRE-NORMA = 'NAO'
321000          MOVE   10  TO  COD-IDEN-STAT-WS
321100          PERFORM  GRAVA-ERROS
321200     END-IF.
321300
321400 112-NORMA-4-3-9-X.
321500
321600     IF   COD-CLASF        NOT  =  '134 ' OR
321700         (COD-COMPL-CLASF  NOT  =  '17'   AND
321800          COD-COMPL-CLASF  NOT  =  '18')
321900          GO   TO    112-NORMA-4-3-10.
322000     MOVE     ZEROS     TO   VAL-IS-4-3-9-WS
322100     MOVE     1         TO   IND-WS
322200     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS   OR
322300       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
322400           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
322500           IF  TAB-COD-COBERT-WS(IND-WS) = '0038'
322600               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-9-WS
322700           END-IF
322800           ADD     1         TO   IND-WS
322900     END-PERFORM.
323000
323100     IF   VAL-IS-4-3-9-WS   >   30000,00
323200          MOVE      10  TO  COD-IDEN-STAT-WS
323300          MOVE  122439  TO  COD-ERR-NORMA-WS
323400          PERFORM  GRAVA-ERROS
323500     END-IF.
323600
323700 112-NORMA-4-3-10.
323800     IF  COD-TARIF-S01U034 < 950   GO  TO 112-NORMA-4-3-X.
323900
324000     IF  COD-CLASF NOT = '138 '
324100         GO TO 112-NORMA-4-3-X.
324200
324300     MOVE    'SIM'    TO    CUMPRE-NORMA
324400     MOVE     1       TO   IND-WS
324500     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
324600        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS    OR
324700        CUMPRE-NORMA = 'NAO'
324800           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
324900               MOVE  122431  TO  COD-ERR-NORMA-WS
325000               MOVE  'NAO'   TO  CUMPRE-NORMA
325100           END-IF
325200           ADD     1         TO   IND-WS
325300     END-PERFORM.
325400
325500     IF   CUMPRE-NORMA = 'NAO'
325600          MOVE   10  TO  COD-IDEN-STAT-WS
325700          PERFORM  GRAVA-ERROS
325800     END-IF.
325900
326000*112-NORMA-4-3-11.
326100*    IF  COD-TARIF-S01U034 < 966   GO  TO 112-NORMA-4-3-X.
326200*
326300*    MOVE    'SIM'    TO    CUMPRE-NORMA
326400*    MOVE     1       TO   IND-WS
326500*    PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
326600*       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS    OR
326700*       CUMPRE-NORMA = 'NAO'
326800*          IF  TAB-COD-COBERT-WS(IND-WS) = '0120'
326900*              MOVE  1223914 TO  COD-ERR-NORMA-WS
327000*              MOVE  'NAO'   TO  CUMPRE-NORMA
327100*          END-IF
327200*          IF  TAB-COD-COBERT-WS(IND-WS) = '0121'
327300*              MOVE  1223915 TO  COD-ERR-NORMA-WS
327400*              MOVE  'NAO'   TO  CUMPRE-NORMA
327500*          END-IF
327600*          ADD     1         TO   IND-WS
327700*    END-PERFORM.
327800*
327900*    IF   CUMPRE-NORMA = 'NAO'
328000*         MOVE   10  TO  COD-IDEN-STAT-WS
328100*         PERFORM  GRAVA-ERROS
328200*    END-IF.
328300
328400 112-NORMA-4-3-X.
328500
328600     MOVE 'R'   TO  COD-TIP-AUX
328700     PERFORM 120-00-COBERTURAS.
328800     MOVE     1         TO   IND-WS
328900     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
329000       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
329100           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
329200*** FICHA 1101068 - COBERTURAS PARA CLASSE 4
329300*          IF  TAB-COD-COBERT-WS(IND-WS) = '0009'
329400*              MOVE 'NAO'   TO CUMPRE-NORMA
329500*              MOVE 1224373 TO COD-ERR-NORMA-WS
329600*              MOVE 10  TO  COD-IDEN-STAT-WS
329700*              PERFORM  GRAVA-ERROS
329800*          END-IF
329900*** FICHA 1101068 - COBERTURAS PARA CLASSE 4
330000*          IF  TAB-COD-COBERT-WS(IND-WS) = '0010'
330100*              MOVE 'NAO'   TO CUMPRE-NORMA
330200*              MOVE 1224374 TO COD-ERR-NORMA-WS
330300*              MOVE 10  TO  COD-IDEN-STAT-WS
330400*              PERFORM  GRAVA-ERROS
330500*          END-IF
330600**FICHA 1001144
330700           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
330800               IF CORR-LIB-AON-HOLD-MACAE = 'SIM' AND
330900                  VAL-IS-AUX < 200000,01
331000                  CONTINUE
331100               ELSE
331200                  MOVE  122431  TO  COD-ERR-NORMA-WS
331300                  MOVE  'NAO'   TO  CUMPRE-NORMA
331400               END-IF
331500           END-IF
331600           IF  TAB-COD-COBERT-WS(IND-WS) = '0033'
331700**FICHA 0801203
331800               IF (CORR-LIB2 = 'SIM' OR
331900                   CORR-LIB-PROSER-ACF = 'SIM') AND
332000                  VAL-IS-AUX < 200000,01
332100                  CONTINUE
332200               ELSE
332300**FICHA 0801203 E 1000665 E 1001144
332400                  IF (CORR-LIB-AON = 'SIM' OR
332500                      CORR-LIB-AON-HOLD-RJ = 'SIM' OR
332600                      CORR-LIB-AON-HOLD-ES = 'SIM' OR
332700                      CORR-LIB-AON-HOLD-MACAE = 'SIM') AND
332800                     VAL-IS-AUX < 100000,01
332900                     CONTINUE
333000                  ELSE
333100**FICHA 0901562
333200                     IF CORR-LIB-AON-HOLD-SP = 'SIM'  AND
333300                        VAL-IS-AUX < 500000,01
333400                        CONTINUE
333500                     ELSE
333600**FICHA 1000408
333700                        IF CORR-LIB-AON-HOLD-PR = 'SIM'  AND
333800                           VAL-IS-AUX < 100000,01
333900                           CONTINUE
334000                        ELSE
334100                           MOVE 'NAO'   TO CUMPRE-NORMA
334200                           MOVE 1224310 TO COD-ERR-NORMA-WS
334300                           MOVE 10  TO  COD-IDEN-STAT-WS
334400                           PERFORM  GRAVA-ERROS
334500                        END-IF
334600                     END-IF
334700                  END-IF
334800               END-IF
334900           END-IF
335000           IF  TAB-COD-COBERT-WS(IND-WS) = '0034'
335100**FICHA 0801203
335200               IF (CORR-LIB2 = 'SIM' OR
335300                   CORR-LIB-PROSER-ACF = 'SIM') AND
335400                  VAL-IS-AUX < 200000,01
335500                  CONTINUE
335600               ELSE
335700**FICHA 0801203 E 1000665 E 1001144
335800                  IF (CORR-LIB-AON = 'SIM' OR
335900                      CORR-LIB-AON-HOLD-RJ = 'SIM' OR
336000                      CORR-LIB-AON-HOLD-ES = 'SIM' OR
336100                      CORR-LIB-AON-HOLD-MACAE = 'SIM') AND
336200                     VAL-IS-AUX < 100000,01
336300                     CONTINUE
336400                  ELSE
336500**FICHA 0901562
336600                     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
336700                        VAL-IS-AUX < 500000,01
336800                        CONTINUE
336900                     ELSE
337000**FICHA 1000408
337100                        IF CORR-LIB-AON-HOLD-PR = 'SIM' AND
337200                           VAL-IS-AUX < 100000,01
337300                           CONTINUE
337400                        ELSE
337500                           MOVE 'NAO'   TO CUMPRE-NORMA
337600                           MOVE 1224311 TO COD-ERR-NORMA-WS
337700                           MOVE 10  TO  COD-IDEN-STAT-WS
337800                           PERFORM  GRAVA-ERROS
337900                        END-IF
338000                     END-IF
338100                  END-IF
338200               END-IF
338300           END-IF
338400***        1200292 - TARIFA 1034 E 1035 ABRIL 2012
338500           IF TAB-COD-COBERT-WS(IND-WS) = '0035'
338600              IF (COD-TARIF-S01U034 >= 1034)
338700                 IF (VAL-IS-AUX > 400000,00)
338800                    MOVE  'NAO'   TO  CUMPRE-NORMA
338900                    MOVE  1224312 TO  COD-ERR-NORMA-WS
339000                    MOVE 10  TO  COD-IDEN-STAT-WS
339100                    PERFORM  GRAVA-ERROS
339200                 END-IF
339300              END-IF
339400           END-IF
339500           IF  TAB-COD-COBERT-WS(IND-WS) = '0053'
339600***FICHA 1100237
339700             IF COD-TARIF-S01U034 > 1007
339800***FICHA 1100589
339900               MOVE 'NAO' TO FLG-LIBERADO
340000               IF (COD-TARIF-S01U034 >= 1014) AND
340100                  (COD-CORR-CTRL = 715734)    AND
340200                  (COD-CLASF = '496 ')        AND
340300                  (COD-COMPL-CLASF = '10'
340400                   OR COD-COMPL-CLASF = '11') AND
340500                  (VAL-IS-AUX < 20000,01)
340600                  MOVE 'SIM' TO FLG-LIBERADO
340700               END-IF
340800***1101045 - TARIFA 1022 E 1023 NOVEMBRO 2011
340900               IF (COD-TARIF-S01U034 >= 1022) AND
341000                  (COD-CORR-CTRL = 724258)    AND
341100                  (COD-CLASF = '496 ')        AND
341200                  (COD-COMPL-CLASF = '10')    AND
341300                  (VAL-IS-AUX < 50000,01)
341400                  MOVE 'SIM' TO FLG-LIBERADO
341500               END-IF
341600
340800***1200539 - TARIFA 1038 E 1039 JUNHO 2012 - ITEM 11
340900               IF (COD-TARIF-S01U034 >= 1038) AND
341000                  (COD-CORR-CTRL = 448101)    AND
341100                  (COD-CLASF = '122 ')        AND
341200                  (COD-COMPL-CLASF = '10' OR
341200                   COD-COMPL-CLASF = '11')    AND
341300                  (VAL-IS-AUX < 7000,01)
341400                  MOVE 'SIM' TO FLG-LIBERADO
341500               END-IF
341600
341700***  1100864 - TARIFA 1018 E 1019 SETEMBRO 2011
341800               IF (COD-TARIF-S01U034 >= 1018) AND
341900                  (VAL-IS-AUX < 10000,01) AND
342000                  ((COD-CLASF = '282 ' AND
342100                    COD-COMPL-CLASF = '10') OR
342200                    (COD-CLASF = '282A' AND
342300                    COD-COMPL-CLASF = '10'))
342400                   MOVE 'SIM' TO FLG-LIBERADO
342500               END-IF
342600
342700               IF VAL-IS-AUX < 10000,01 AND
342800                  COD-CLASF = '061 '
342900                             CONTINUE
343000               ELSE
343100                  IF (CORR-LIB2 = 'SIM' OR
343200                      CORR-LIB-PROSER-ACF = 'SIM') AND
343300                      VAL-IS-AUX < 50000,01
343400                      CONTINUE
343500                  ELSE
343600                     IF CORR-LIB-AON = 'SIM' AND
343700                        VAL-IS-AUX < 100000,01
343800                        CONTINUE
343900                     ELSE
344000                        IF CORR-LIB-LOCK = 'SIM' AND
344100                           VAL-IS-AUX < 20000,01
344200                           CONTINUE
344300                        ELSE
344400                         IF (CORR-LIB-MAHESO = 'SIM') AND
344500                            (VAL-IS-AUX < 50000,01)   AND
344600                            (COD-TARIF-S01U034 > 981) AND
344700                            (COD-CLASF = '496 ' AND
344800                             (COD-COMPL-CLASF = '10' OR
344900                              COD-COMPL-CLASF = '11'))
345000                              CONTINUE
345100                         ELSE
345200                           IF CORR-LIB-SEKURIT = 'SIM' AND
345300                              VAL-IS-AUX < 20000,01 AND
345400                              COD-TARIF-S01U034 > 987 AND
345500                              (COD-CLASF = '496 ' AND
345600                              COD-COMPL-CLASF =  '10')
345700                                CONTINUE
345800                           ELSE
345900                             IF CORR-LIB-SEKURIT = 'SIM' AND
346000                                VAL-IS-AUX < 20000,01 AND
346100                                COD-TARIF-S01U034 > 987 AND
346200                                (COD-CLASF = '496 ' AND
346300                                COD-COMPL-CLASF =  '11')
346400                                  CONTINUE
346500                             ELSE
346600***FICHA 1100589
346700                              IF FLG-LIBERADO = 'NAO'
346800                                MOVE 'NAO'   TO CUMPRE-NORMA
346900                                MOVE 1224314 TO COD-ERR-NORMA-WS
347000                                MOVE 10  TO  COD-IDEN-STAT-WS
347100                                PERFORM  GRAVA-ERROS
347200                              END-IF
347300                             END-IF
347400                           END-IF
347500                         END-IF
347600                        END-IF
347700                     END-IF
347800                  END-IF
347900               END-IF
348000             ELSE
348100               IF (CORR-LIB2 = 'SIM' OR
348200                   CORR-LIB-PROSER-ACF = 'SIM') AND
348300                   VAL-IS-AUX < 50000,01
348400                  CONTINUE
348500               ELSE
348600**FICHA 0801203
348700                  IF CORR-LIB-AON = 'SIM' AND
348800                     VAL-IS-AUX < 100000,01
348900                     CONTINUE
349000                  ELSE
349100**FICHA 901790
349200                     IF CORR-LIB-LOCK = 'SIM' AND
349300                        VAL-IS-AUX < 20000,01
349400                        CONTINUE
349500                     ELSE
349600**FICHA 1000253
349700                      IF CORR-LIB-MAHESO = 'SIM' AND
349800                         VAL-IS-AUX < 50000,01 AND
349900                         COD-TARIF-S01U034 > 981 AND
350000                         COD-CLASF = '496 ' AND
350100                         COD-COMPL-CLASF =  '10'
350200                           CONTINUE
350300                      ELSE
350400**FICHA 1000611
350500                        IF CORR-LIB-SEKURIT = 'SIM' AND
350600                           VAL-IS-AUX < 20000,01 AND
350700                           COD-TARIF-S01U034 > 987 AND
350800                           (COD-CLASF = '496 ' AND
350900                           COD-COMPL-CLASF =  '10')
351000                             CONTINUE
351100                        ELSE
351200                          IF CORR-LIB-SEKURIT = 'SIM' AND
351300                             VAL-IS-AUX < 20000,01 AND
351400                             COD-TARIF-S01U034 > 987 AND
351500                             (COD-CLASF = '496 ' AND
351600                             COD-COMPL-CLASF =  '11')
351700                               CONTINUE
351800                          ELSE
351900                            MOVE 'NAO'   TO CUMPRE-NORMA
352000                            MOVE 1224314 TO COD-ERR-NORMA-WS
352100                            MOVE 10  TO  COD-IDEN-STAT-WS
352200                            PERFORM  GRAVA-ERROS
352300                          END-IF
352400                        END-IF
352500                      END-IF
352600                     END-IF
352700                  END-IF
352800               END-IF
352900             END-IF
353000           END-IF
353100**FICHA 0801203
353200           IF  TAB-COD-COBERT-WS(IND-WS) = '0059'
353300***FICHA 1100237
353400             IF COD-TARIF-S01U034 > 1007
353500***FICHA 1100589
353600               MOVE 'NAO' TO FLG-LIBERADO
353700               IF (COD-TARIF-S01U034 >= 1014) AND
353800                  (COD-CORR-CTRL = 715734)    AND
353900                  (COD-CLASF = '496 ')        AND
354000                  (COD-COMPL-CLASF = '10'
354100                  OR COD-COMPL-CLASF = '11')  AND
354200                  (VAL-IS-AUX < 50000,01)
354300                  MOVE 'SIM' TO FLG-LIBERADO
354400               END-IF
354500
354600               IF (CORR-LIB-MAHESO = 'SIM') AND
354700                  (VAL-IS-AUX < 300000,01)   AND
354800                  (COD-CLASF = '496 ' AND
354900                   (COD-COMPL-CLASF = '10' OR
355000                    COD-COMPL-CLASF = '11'))
355100                  MOVE 'SIM' TO FLG-LIBERADO
355200               END-IF
355300
355400***  1100864 - TARIFA 1018 E 1019 SETEMBRO 2011
355500               IF (COD-TARIF-S01U034 >= 1018) AND
355600                  (VAL-IS-AUX < 50000,01) AND
355700                  ((COD-CLASF = '282 ' AND
355800                    COD-COMPL-CLASF = '10') OR
355900                    (COD-CLASF = '282A' AND
356000                    COD-COMPL-CLASF = '10'))
356100                   MOVE 'SIM' TO FLG-LIBERADO
356200               END-IF
356300
356400               IF VAL-IS-AUX < 50000,01 AND
356500                  COD-CLASF = '061 '
356600                             CONTINUE
356700               ELSE
356800                  IF CORR-LIB-AON = 'SIM' AND
356900                     VAL-IS-AUX < 100000,01
357000                     CONTINUE
357100                  ELSE
357200                     IF (CORR-LIB-MAHESO = 'SIM' OR
357300                         CORR-LIB-SEKURIT = 'SIM') AND
357400                        VAL-IS-AUX < 50000,01 AND
357500                        COD-CLASF = '496 ' AND
357600                        COD-COMPL-CLASF =  '10'
357700                            CONTINUE
357800                     ELSE
357900                        IF  CORR-LIB-SEKURIT = 'SIM' AND
358000                           VAL-IS-AUX < 50000,01 AND
358100                           COD-CLASF = '496 ' AND
358200                           COD-COMPL-CLASF =  '11'
358300                              CONTINUE
358400                        ELSE
358500                         IF FLG-LIBERADO = 'NAO'
358600                           MOVE 'NAO'   TO CUMPRE-NORMA
358700                           MOVE 1224315 TO COD-ERR-NORMA-WS
358800                           MOVE 10  TO  COD-IDEN-STAT-WS
358900                           PERFORM  GRAVA-ERROS
359000                         END-IF
359100                        END-IF
359200                     END-IF
359300                  END-IF
359400               END-IF
359500             ELSE
359600               IF CORR-LIB-AON = 'SIM' AND
359700                  VAL-IS-AUX < 100000,01
359800                  CONTINUE
359900               ELSE
360000                  IF (CORR-LIB-MAHESO = 'SIM' OR
360100                      CORR-LIB-SEKURIT = 'SIM') AND
360200                     VAL-IS-AUX < 50000,01 AND
360300                     COD-TARIF-S01U034 > 987 AND
360400                     COD-CLASF = '496 ' AND
360500                     COD-COMPL-CLASF =  '10'
360600                         CONTINUE
360700                  ELSE
360800                     IF  CORR-LIB-SEKURIT = 'SIM' AND
360900                        VAL-IS-AUX < 50000,01 AND
361000                        COD-TARIF-S01U034 > 987 AND
361100                        COD-CLASF = '496 ' AND
361200                        COD-COMPL-CLASF =  '11'
361300                           CONTINUE
361400                     ELSE
361500                        MOVE 'NAO'   TO CUMPRE-NORMA
361600                        MOVE 1224315 TO COD-ERR-NORMA-WS
361700                        MOVE 10  TO  COD-IDEN-STAT-WS
361800                        PERFORM  GRAVA-ERROS
361900                     END-IF
362000                  END-IF
362100               END-IF
362200             END-IF
362300           END-IF
362400           IF  TAB-COD-COBERT-WS(IND-WS) = '0060'
362500               MOVE 'NAO' TO FLG-LIBERADO
362600               IF CORR-LIB-AON = 'SIM' AND
362700                  VAL-IS-AUX < 100000,01
362800                  MOVE 'SIM' TO FLG-LIBERADO
362900               END-IF
363000***            1200429 - TARIFA 1036 E 1037 MAIO 2012
363100               IF (COD-TARIF-S01U034 >= 1036) AND
363200                  (VAL-IS-AUX < 200000,01) AND
363300                  (CORR-LIB-AON-HOLD-SP = 'SIM')
363400                  MOVE 'SIM' TO FLG-LIBERADO
363500               END-IF
363600***            1100864 - TARIFA 1018 E 1019 SETEMBRO 2011
363700               IF (COD-TARIF-S01U034 >= 1018) AND
363800                  (VAL-IS-AUX < 50000,01) AND
363900                  ((COD-CLASF = '282 ' AND
364000                    COD-COMPL-CLASF = '10') OR
364100                    (COD-CLASF = '282A' AND
364200                    COD-COMPL-CLASF = '10'))
364300                   MOVE 'SIM' TO FLG-LIBERADO
364400               END-IF
364500***            1200108 - TARIFA 1030 E 1031 FEVEREIRO 2012
364600               IF (COD-TARIF-S01U034 >= 1030) AND
364700                  (COD-CORR-CTRL = 0701401)   AND
364800                  (COD-CLASF = '496 ' AND
364900                    (COD-COMPL-CLASF = '10' OR
365000                     COD-COMPL-CLASF = '11')) AND
365100                  (VAL-IS-AUX < 300000,01)
365200                  MOVE 'SIM' TO FLG-LIBERADO
365300               END-IF
365400               IF FLG-LIBERADO = 'NAO'
365500                  MOVE 'NAO'   TO CUMPRE-NORMA
365600                  MOVE 1224316 TO COD-ERR-NORMA-WS
365700                  MOVE 10  TO  COD-IDEN-STAT-WS
365800                  PERFORM  GRAVA-ERROS
365900               END-IF
366000           END-IF
366100           IF  TAB-COD-COBERT-WS(IND-WS) = '0062'
366200             IF  COD-CORR-CTRL = 0032201 OR
366300                  CORR-LIB-HELLNER = 'SIM'
366400                CONTINUE
366500             ELSE
366600                IF (CORR-LIB2 = 'SIM' OR
366700                    CORR-LIB-PROSER-ACF = 'SIM') AND
366800                     VAL-IS-AUX < 100000,01
366900                   CONTINUE
367000                ELSE
367100                   MOVE 'NAO'   TO CUMPRE-NORMA
367200                   MOVE 1224318 TO COD-ERR-NORMA-WS
367300                   MOVE 10  TO  COD-IDEN-STAT-WS
367400                   PERFORM  GRAVA-ERROS
367500                END-IF
367600             END-IF
367700           END-IF
367800***        1200292 - TARIFA 1034 E 1035 ABRIL 2012
367900           IF  TAB-COD-COBERT-WS(IND-WS) = '0076'
368000               IF (COD-TARIF-S01U034 >= 1034) AND
368100                  (VAL-IS-AUX < 200000,01)
368200                  CONTINUE
368300               ELSE
368400                  MOVE 'NAO'   TO CUMPRE-NORMA
368500                  MOVE 1224319 TO COD-ERR-NORMA-WS
368600                  MOVE 10  TO  COD-IDEN-STAT-WS
368700                  PERFORM  GRAVA-ERROS
368800               END-IF
368900           END-IF
369000**FICHA 0801203
369100           IF  TAB-COD-COBERT-WS(IND-WS) = '0078'
                     MOVE 'NAO' TO FLG-LIBERADO
369200               IF CORR-LIB-AON = 'SIM' AND
369300                  VAL-IS-AUX < 100000,01
369400                  MOVE 'SIM' TO FLG-LIBERADO
369500               END-IF
      *** 1200539 - TARIFA 1038 E 1039 JUNHO 2012 - ITEM 6
                     IF (COD-TARIF-S01U034 >= 1038) AND
                        (COD-CLASF = '374 ')        AND
                        (COD-COMPL-CLASF = '16' OR
                         COD-COMPL-CLASF = '17' OR
                         COD-COMPL-CLASF = '28' OR
                         COD-COMPL-CLASF = '29' OR
                         COD-COMPL-CLASF = '30' OR
                         COD-COMPL-CLASF = '31' OR
                         COD-COMPL-CLASF = '32')    AND
                        (VAL-IS-AUX < 200000,01)
                        MOVE 'SIM' TO FLG-LIBERADO
                     END-IF
                     IF FLG-LIBERADO = 'NAO'
369600                  MOVE 'NAO'   TO CUMPRE-NORMA
369700                  MOVE 1224320 TO COD-ERR-NORMA-WS
369800                  MOVE 10  TO  COD-IDEN-STAT-WS
369900                  PERFORM  GRAVA-ERROS
370000               END-IF
370100           END-IF
370200*** FICHA 1101068 - COBERTURAS PARA CLASSE 4
370300*          IF  TAB-COD-COBERT-WS(IND-WS) = '0079'
370400*              MOVE 'NAO'   TO CUMPRE-NORMA
370500*              MOVE 1224375 TO COD-ERR-NORMA-WS
370600*              MOVE 10  TO  COD-IDEN-STAT-WS
370700*              PERFORM  GRAVA-ERROS
370800*          END-IF
      *** 1200539 - TARIFA 1038 E 1039 JUNHO 2012 - ITEM 6
                 IF  TAB-COD-COBERT-WS(IND-WS) = '0079'
                     IF COD-TARIF-S01U034 >= 1038 AND
                        (COD-CLASF = '374 ')      AND
                        (VAL-IS-AUX > 200000,00)  AND
                        (COD-COMPL-CLASF = '16' OR
                         COD-COMPL-CLASF = '17' OR
                         COD-COMPL-CLASF = '28' OR
                         COD-COMPL-CLASF = '29' OR
                         COD-COMPL-CLASF = '30' OR
                         COD-COMPL-CLASF = '31' OR
                         COD-COMPL-CLASF = '32')
                            MOVE 'NAO'   TO CUMPRE-NORMA
                            MOVE 1224375 TO COD-ERR-NORMA-WS
                            MOVE 10  TO  COD-IDEN-STAT-WS
                            PERFORM  GRAVA-ERROS
                     END-IF
                 END-IF
370900           IF  TAB-COD-COBERT-WS(IND-WS) = '0080'
                     MOVE 'NAO' TO FLG-LIBERADO
371000               IF (CORR-LIB-HELLNER = 'SIM' AND
371100                  VAL-IS-AUX < 100000,01) OR
371200***  1200004 - TARIFA 1028 E 1029 JANEIRO 2012
371300                  (COD-TARIF-S01U034 >= 1028 AND
371400                  CORR-LIB-AON-HOLD-SP = 'SIM' AND
371500                  VAL-IS-AUX < 100000,01)
371600                  MOVE 'SIM' TO FLG-LIBERADO
371700               END-IF
      *** 1200539 - TARIFA 1038 E 1039 JUNHO 2012 - ITEM 6
                     IF (COD-TARIF-S01U034 >= 1038) AND
                        (COD-CLASF = '374 ')        AND
                        (COD-COMPL-CLASF = '16' OR
                         COD-COMPL-CLASF = '17' OR
                         COD-COMPL-CLASF = '28' OR
                         COD-COMPL-CLASF = '29' OR
                         COD-COMPL-CLASF = '30' OR
                         COD-COMPL-CLASF = '31' OR
                         COD-COMPL-CLASF = '32')    AND
                        (VAL-IS-AUX < 200000,01)
                        MOVE 'SIM' TO FLG-LIBERADO
                     END-IF
                     IF FLG-LIBERADO = 'NAO'
371800                  MOVE 'NAO'   TO CUMPRE-NORMA
371900                  MOVE 1224321 TO COD-ERR-NORMA-WS
372000                  MOVE 10  TO  COD-IDEN-STAT-WS
372100                  PERFORM  GRAVA-ERROS
372200               END-IF
372300           END-IF
372400*** 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
372500           IF TAB-COD-COBERT-WS(IND-WS) = '0082'
372600              IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
372700                 VAL-IS-AUX < 2000000,01
372800                 CONTINUE
372900              ELSE
373000                 MOVE 'NAO'   TO CUMPRE-NORMA
373100                 MOVE 1224322 TO COD-ERR-NORMA-WS
373200                 MOVE 10  TO  COD-IDEN-STAT-WS
373300                 PERFORM  GRAVA-ERROS
373400              END-IF
373500           END-IF
373600*** 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
373700           IF TAB-COD-COBERT-WS(IND-WS) = '0083'
373800              IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
373900                 VAL-IS-AUX < 2000000,01
374000                 CONTINUE
374100              ELSE
374200                 MOVE 'NAO'   TO CUMPRE-NORMA
374300                 MOVE 1224323 TO COD-ERR-NORMA-WS
374400                 MOVE 10  TO  COD-IDEN-STAT-WS
374500                 PERFORM  GRAVA-ERROS
374600              END-IF
374700           END-IF
374800** FICHA 1001146
374900           IF  TAB-COD-COBERT-WS(IND-WS) = '0094'
375000               IF (CORR-LIB-AON-HOLD   = 'SIM' OR
375100                   CORR-LIB-AON-HOLD-SP = 'SIM') AND
375200                  (VAL-IS-AUX < 5000,01) AND
375300                  (COD-TARIF-S01U034 > 999)
375400                  CONTINUE
375500               ELSE
375600***FICHA 1100237
375700                  IF  COD-TARIF-S01U034 > 1007 AND
375800                     (COD-CLASF = '197 ' OR
375900                      COD-CLASF = '134') AND
376000                     (VAL-IS-AUX < 5000,01)
376100                      CONTINUE
376200                  ELSE
376300                     MOVE 'NAO'   TO CUMPRE-NORMA
376400                     MOVE 1224330 TO COD-ERR-NORMA-WS
376500                     MOVE 10  TO  COD-IDEN-STAT-WS
376600                     PERFORM  GRAVA-ERROS
376700                  END-IF
376800               END-IF
376900           END-IF
      *** 1200539 - TARIFA 1038 E 1039 JUNHO 2012 - ITEM 6
                 IF  TAB-COD-COBERT-WS(IND-WS) = '0095'
                     MOVE 'NAO' TO FLG-LIBERADO
                     IF (COD-TARIF-S01U034 >= 1038) AND
                        (COD-CLASF = '374 ')        AND
                        (COD-COMPL-CLASF = '16' OR
                         COD-COMPL-CLASF = '17' OR
                         COD-COMPL-CLASF = '28' OR
                         COD-COMPL-CLASF = '29' OR
                         COD-COMPL-CLASF = '30' OR
                         COD-COMPL-CLASF = '31' OR
                         COD-COMPL-CLASF = '32')    AND
                        (VAL-IS-AUX < 200000,01)
                        MOVE 'SIM' TO FLG-LIBERADO
                     END-IF
                     IF FLG-LIBERADO = 'NAO'
                        MOVE 'NAO'   TO CUMPRE-NORMA
                        MOVE 1224331 TO COD-ERR-NORMA-WS
                        MOVE 10  TO  COD-IDEN-STAT-WS
                        PERFORM  GRAVA-ERROS
                     END-IF
                 END-IF
377000*** 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
377100           IF TAB-COD-COBERT-WS(IND-WS) = '0097'
377200              IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
377300                 VAL-IS-AUX < 500000,01
377400                 CONTINUE
377500              ELSE
377600                 MOVE 'NAO'   TO CUMPRE-NORMA
377700                 MOVE 1224364 TO COD-ERR-NORMA-WS
377800                 MOVE 10  TO  COD-IDEN-STAT-WS
377900                 PERFORM  GRAVA-ERROS
378000              END-IF
378100           END-IF
377000*** 1200539 - TARIFA 1038 E 1039 JUNHO 2012 - ITEM 11
377100           IF TAB-COD-COBERT-WS(IND-WS) = '0155'
                    MOVE 'NAO' TO FLG-LIBERADO
377300              IF (COD-TARIF-S01U034 >= 1038) AND
377400                 (COD-CORR-CTRL = 448101)    AND
377500                 (COD-CLASF = '122 ')        AND
377600                 (COD-COMPL-CLASF = '10' OR
                        COD-COMPL-CLASF = '11')    AND
377700                 (VAL-IS-AUX < 2000,01)
377800                 MOVE 'SIM' TO FLG-LIBERADO
377900              END-IF
378000              IF FLG-LIBERADO = 'NAO'
                      MOVE 'NAO'   TO CUMPRE-NORMA
                      MOVE 1224368 TO COD-ERR-NORMA-WS
                      MOVE 10  TO  COD-IDEN-STAT-WS
                      PERFORM  GRAVA-ERROS
                    END-IF
378100           END-IF
377000*** 1200539 - TARIFA 1038 E 1039 JUNHO 2012 - ITEM 11
377100           IF TAB-COD-COBERT-WS(IND-WS) = '0119'
                    MOVE 'NAO' TO FLG-LIBERADO
377300              IF (COD-TARIF-S01U034 >= 1038) AND
377400                 (COD-CORR-CTRL = 448101)    AND
377500                 (COD-CLASF = '122 ')        AND
377600                 (COD-COMPL-CLASF = '10' OR
377600                  COD-COMPL-CLASF = '11')    AND
377700                 (VAL-IS-AUX < 2000,01)
377800                 MOVE 'SIM' TO FLG-LIBERADO
377900              END-IF
378000              IF FLG-LIBERADO = 'NAO'
                      MOVE 'NAO'   TO CUMPRE-NORMA
                      MOVE 1224337 TO COD-ERR-NORMA-WS
                      MOVE 10  TO  COD-IDEN-STAT-WS
                      PERFORM  GRAVA-ERROS
                    END-IF
378100           END-IF
378200           ADD     1         TO   IND-WS
378300     END-PERFORM.
378400 112-NORMA-4-4.
378500
378600     MOVE     ZEROS     TO   VAL-IS-4-4-1-WS
378700     MOVE     ZEROS     TO   VAL-IS-4-4-2-WS
378800     MOVE     ZEROS     TO   VAL-IS-4-4-3-WS
378900     MOVE     ZEROS     TO   VAL-IS-4-4-4-WS
379000     MOVE     ZEROS     TO   VAL-IS-4-4-5-WS
379100     MOVE     ZEROS     TO   VAL-IS-4-4-6-WS
379200     MOVE     ZEROS     TO   VAL-IS-4-4-7-WS
379300     MOVE     ZEROS     TO   VAL-IS-4-4-8-WS
379400     MOVE     ZEROS     TO   VAL-IS-4-4-9-WS
379500     MOVE     ZEROS     TO   VAL-IS-4-5-0-WS
379600     MOVE     ZEROS     TO   VAL-IS-4-5-1-WS
379700     MOVE     ZEROS     TO   VAL-IS-4-5-2-WS
379800     MOVE     ZEROS     TO   VAL-IS-4-5-3-WS
379900     MOVE     ZEROS     TO   VAL-IS-4-5-4-WS
380000     MOVE     ZEROS     TO   VAL-IS-4-5-5-WS
380100     MOVE     ZEROS     TO   VAL-IS-4-5-6-WS
380200     MOVE     ZEROS     TO   VAL-IS-4-5-7-WS
380300     MOVE     ZEROS     TO   VAL-IS-4-5-8-WS
380400     MOVE     ZEROS     TO   VAL-IS-4-5-9-WS
380500     MOVE     ZEROS     TO   VAL-IS-4-6-0-WS
380600     MOVE     ZEROS     TO   VAL-IS-4-6-1-WS
380700     MOVE     ZEROS     TO   VAL-IS-4-6-2-WS
380800     MOVE     ZEROS     TO   VAL-IS-4-6-3-WS
380900     MOVE     ZEROS     TO   VAL-IS-4-6-4-WS
381000     MOVE     ZEROS     TO   VAL-IS-4-6-5-WS
381100     MOVE     ZEROS     TO   VAL-IS-4-6-6-WS
381200     MOVE     ZEROS     TO   VAL-IS-4-6-7-WS
381300*** 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
381400     MOVE     ZEROS     TO  VAL-IS-COB-112-003
381500     MOVE     ZEROS     TO  VAL-IS-COB-112-007
381600     MOVE     ZEROS     TO  VAL-IS-COB-112-009
381700*    MOVE     ZEROS     TO  VAL-IS-COB-112-010
381800     MOVE     ZEROS     TO  VAL-IS-COB-112-011
381900     MOVE     ZEROS     TO  VAL-IS-COB-112-012
382000     MOVE     ZEROS     TO  VAL-IS-COB-112-013
382100     MOVE     ZEROS     TO  VAL-IS-COB-112-014
382200     MOVE     ZEROS     TO  VAL-IS-COB-112-015
382300     MOVE     ZEROS     TO  VAL-IS-COB-112-016
382400     MOVE     ZEROS     TO  VAL-IS-COB-112-017
382500     MOVE     ZEROS     TO  VAL-IS-COB-112-021
382600***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
382700     MOVE     ZEROS     TO  VAL-IS-COB-112-028
382800     MOVE     ZEROS     TO  VAL-IS-COB-112-035
382900     MOVE     ZEROS     TO  VAL-IS-COB-112-038
383000     MOVE     ZEROS     TO  VAL-IS-COB-112-040
383100     MOVE     ZEROS     TO  VAL-IS-COB-112-043
383200     MOVE     ZEROS     TO  VAL-IS-COB-112-044
383300     MOVE     ZEROS     TO  VAL-IS-COB-112-054
383400     MOVE     ZEROS     TO  VAL-IS-COB-112-055
383500     MOVE     ZEROS     TO  VAL-IS-COB-112-063
383600     MOVE     1         TO   IND-WS
383700     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
383800       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
383900           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
384000           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
384100               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-1-WS
384200           END-IF
384300***  1100674 - VERSAO PERSONALIZADA - AON HONDINGS
384400           IF  TAB-COD-COBERT-WS(IND-WS) = '0003'
384500                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-003
384600           END-IF
384700           IF  TAB-COD-COBERT-WS(IND-WS) = '0007'
384800                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-007
384900           END-IF
385000           IF  TAB-COD-COBERT-WS(IND-WS) = '0009'
385100                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-009
385200           END-IF
385300*          IF  TAB-COD-COBERT-WS(IND-WS) = '0010'
385400*               MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-010
385500*          END-IF
385600           IF  TAB-COD-COBERT-WS(IND-WS) = '0011'
385700                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-011
385800           END-IF
385900           IF  TAB-COD-COBERT-WS(IND-WS) = '0012'
386000                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-012
386100           END-IF
386200           IF  TAB-COD-COBERT-WS(IND-WS) = '0013'
386300                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-013
386400           END-IF
386500           IF  TAB-COD-COBERT-WS(IND-WS) = '0014'
386600                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-014
386700           END-IF
386800           IF  TAB-COD-COBERT-WS(IND-WS) = '0015'
386900                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-015
387000           END-IF
387100           IF  TAB-COD-COBERT-WS(IND-WS) = '0016'
387200                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-016
387300           END-IF
387400           IF  TAB-COD-COBERT-WS(IND-WS) = '0017'
387500                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-017
387600           END-IF
387700           IF  TAB-COD-COBERT-WS(IND-WS) = '0021'
387800                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-021
387900           END-IF
388000***        1200292 - TARIFA 1034 E 1035 ABRIL 2012
388100           IF  TAB-COD-COBERT-WS(IND-WS) = '0028'
388200                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-028
388300           END-IF
388400           IF  TAB-COD-COBERT-WS(IND-WS) = '0035'
388500                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-035
388600           END-IF
388700           IF  TAB-COD-COBERT-WS(IND-WS) = '0038'
388800                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-038
388900           END-IF
389000           IF  TAB-COD-COBERT-WS(IND-WS) = '0040'
389100                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-040
389200           END-IF
389300           IF  TAB-COD-COBERT-WS(IND-WS) = '0043'
389400                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-043
389500           END-IF
389600           IF  TAB-COD-COBERT-WS(IND-WS) = '0044'
389700                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-044
389800           END-IF
389900           IF  TAB-COD-COBERT-WS(IND-WS) = '0054'
390000                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-054
390100           END-IF
390200           IF  TAB-COD-COBERT-WS(IND-WS) = '0055'
390300                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-055
390400           END-IF
390500           IF  TAB-COD-COBERT-WS(IND-WS) = '0063'
390600                MOVE VAL-IS-AUX  TO  VAL-IS-COB-112-063
390700           END-IF
390800           IF  TAB-COD-COBERT-WS(IND-WS) = '0022'
390900               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-2-WS
391000               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-8-WS
391100           END-IF
391200           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
391300               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-3-WS
391400           END-IF
391500           IF  TAB-COD-COBERT-WS(IND-WS) = '0024'
391600               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-4-WS
391700           END-IF
391800           IF  TAB-COD-COBERT-WS(IND-WS) = '0025'
391900               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-5-WS
392000           END-IF
392100           IF  TAB-COD-COBERT-WS(IND-WS) = '0026'
392200               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-6-WS
392300           END-IF
392400           IF  TAB-COD-COBERT-WS(IND-WS) = '0030'
392500               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-7-WS
392600           END-IF
392700           IF  TAB-COD-COBERT-WS(IND-WS) = '0058'
392800               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-8-WS
392900           END-IF
393000           IF  TAB-COD-COBERT-WS(IND-WS) = '0059'
393100               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-8-WS
393200           END-IF
393300           IF  TAB-COD-COBERT-WS(IND-WS) = '0060'
393400               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-8-WS
393500           END-IF
393600           IF  TAB-COD-COBERT-WS(IND-WS) = '0061'
393700               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-8-WS
393800           END-IF
393900           IF  TAB-COD-COBERT-WS(IND-WS) = '0062'
394000               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-8-WS
394100           END-IF
394200           IF  TAB-COD-COBERT-WS(IND-WS) = '0032'
394300               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-9-WS
394400           END-IF
394500           IF  TAB-COD-COBERT-WS(IND-WS) = '0039'
394600               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-9-WS
394700           END-IF
394800           IF  TAB-COD-COBERT-WS(IND-WS) = '0042'
394900               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-9-WS
395000           END-IF
395100           IF  TAB-COD-COBERT-WS(IND-WS) = '0084'
395200               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-9-WS
395300           END-IF
395400           IF  TAB-COD-COBERT-WS(IND-WS) = '0010'
395500               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-0-WS
395600           END-IF
395700           IF  TAB-COD-COBERT-WS(IND-WS) = '0018'
395800               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-1-WS
395900           END-IF
396000           IF  TAB-COD-COBERT-WS(IND-WS) = '0028'
396100               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-2-WS
396200           END-IF
396300*          IF  TAB-COD-COBERT-WS(IND-WS) = '0029'
396400*              MOVE VAL-IS-AUX  TO  VAL-IS-4-5-3-WS
396500*          END-IF
396600           IF  TAB-COD-COBERT-WS(IND-WS) = '0038'
396700               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-4-WS
396800           END-IF
396900           IF  TAB-COD-COBERT-WS(IND-WS) = '0102'
397000               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-5-WS
397100           END-IF
397200           IF  TAB-COD-COBERT-WS(IND-WS) = '0103'
397300               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-6-WS
397400           END-IF
397500           IF  TAB-COD-COBERT-WS(IND-WS) = '0104'
397600               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-7-WS
397700           END-IF
397800           IF  TAB-COD-COBERT-WS(IND-WS) = '0105'
397900               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-8-WS
398000           END-IF
398100           IF  TAB-COD-COBERT-WS(IND-WS) = '0106'
398200               MOVE VAL-IS-AUX  TO  VAL-IS-4-5-9-WS
398300           END-IF
398400           IF  TAB-COD-COBERT-WS(IND-WS) = '0107'
398500               MOVE VAL-IS-AUX  TO  VAL-IS-4-6-0-WS
398600           END-IF
398700           IF  TAB-COD-COBERT-WS(IND-WS) = '0108'
398800               MOVE VAL-IS-AUX  TO  VAL-IS-4-6-1-WS
398900           END-IF
399000           IF  TAB-COD-COBERT-WS(IND-WS) = '0109'
399100               MOVE VAL-IS-AUX  TO  VAL-IS-4-6-2-WS
399200           END-IF
399300           IF  TAB-COD-COBERT-WS(IND-WS) = '0110'
399400               MOVE VAL-IS-AUX  TO  VAL-IS-4-6-3-WS
399500           END-IF
399600           IF  TAB-COD-COBERT-WS(IND-WS) = '0111'
399700               MOVE VAL-IS-AUX  TO  VAL-IS-4-6-4-WS
399800           END-IF
399900           IF  TAB-COD-COBERT-WS(IND-WS) = '0112'
400000               MOVE VAL-IS-AUX  TO  VAL-IS-4-6-5-WS
400100           END-IF
400200           IF  TAB-COD-COBERT-WS(IND-WS) = '0113'
400300               MOVE VAL-IS-AUX  TO  VAL-IS-4-6-6-WS
400400           END-IF
400500           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
400600               MOVE VAL-IS-AUX  TO  VAL-IS-4-6-7-WS
400700           END-IF
400800           ADD     1         TO   IND-WS
400900     END-PERFORM.
401000     MOVE ZEROES             TO VAL-IS-COMPARAR
401100     IF (CORR-LIB = 'SIM'  OR (CORR-LIB-MARSH = 'SIM' AND
401200         COD-TARIF-S01U034 < 950)) AND
401300            COD-CLASF = '022 ' AND
401400               COD-COMPL-CLASF =  '13'
401500        MOVE 20000000,00       TO    VAL-IS-COMPARAR
401600     ELSE
401700        IF CORR-LIB2 = 'SIM' OR COD-CORR-CTRL = 0688801 OR
401800           CORR-LIB-PROSER-ACF = 'SIM' OR
401900           CORR-LIB-AON-HOLD-RS = 'SIM'
402000            MOVE 15000000,00       TO    VAL-IS-COMPARAR
402100        ELSE
402200           IF CORR-LIB-HELLNER = 'SIM'
402300              MOVE 20000000,00       TO    VAL-IS-COMPARAR
402400           ELSE
402500*---FICHA 0801203 E 1000665
402600              IF CORR-LIB-AON = 'SIM' OR
402700                 CORR-LIB-AON-HOLD = 'SIM' OR
402800                 CORR-LIB-AON-HOLD-RJ = 'SIM' OR
402900                 CORR-LIB-AON-HOLD-ES = 'SIM'
403000                 MOVE 20000000,00 TO VAL-IS-COMPARAR
403100              ELSE
403200***              1200004 - TARIFA 1028 E 1029 JANEIRO 2012
403300                 IF (COD-TARIF-S01U034 >= 1028) AND
403400                    (COD-CLASF = '022 ' AND
403500                     COD-COMPL-CLASF = '13') AND
403600                    (COD-TARIF-S01U034 < 1034)
403700                    MOVE 10000000,00 TO VAL-IS-COMPARAR
403800                 ELSE
403900***                 1200292 - TARIFA 1034 E 1035 ABRIL 2012
404000                    IF (COD-TARIF-S01U034 >= 1034)
404100                       MOVE 15000000,00 TO VAL-IS-COMPARAR
404200                    ELSE
404300                       MOVE  8000000,00 TO VAL-IS-COMPARAR
404400                    END-IF
404500                 END-IF
404600              END-IF
404700           END-IF
404800        END-IF
404900     END-IF
405000*---FICHA 0801203
405100     IF   COD-CORR-CTRL   = 0218101 OR 0683204 OR 0632007 OR
405200                            0677807 OR 0257307 OR 0331007 OR
405300                            0006907
405400          MOVE 20000000,00       TO    VAL-IS-COMPARAR
405500     END-IF
405600*---FICHA 0801347
405700     IF   CORR-LIB-SOS    = 'SIM'
405800          MOVE 20000000,00       TO    VAL-IS-COMPARAR
405900     END-IF
406000
406100     IF   CORR-LIB-PUNCH = 'SIM' AND
406200          COD-TARIF-S01U034 > 959
406300          MOVE 15000000,00  TO    VAL-IS-COMPARAR
406400     END-IF
406500
406600     IF   CORR-LIB-GANDINI = 'SIM' AND
406700          COD-TARIF-S01U034 > 961
406800          MOVE 20000000,00  TO    VAL-IS-COMPARAR
406900     END-IF
407000
407100     IF   CORR-LIB-JUL-09  = 'SIM' AND
407200          COD-TARIF-S01U034 > 967
407300          MOVE 15000000,00  TO    VAL-IS-COMPARAR
407400     END-IF
407500
407600     IF   CORR-LIB-ADD = 'SIM' AND
407700          COD-TARIF-S01U034 > 971
407800          MOVE 15000000,00  TO    VAL-IS-COMPARAR
407900     END-IF
408000**FICHA 1000183
408100     IF   CORR-LIB-LAZAM = 'SIM' AND
408200          COD-TARIF-S01U034 > 981
408300          MOVE 15000000,00  TO    VAL-IS-COMPARAR
408400     END-IF
408500
408600**FICHA 1000408
408700     IF   CORR-LIB-AON-HOLD-SP = 'SIM' AND
408800          COD-TARIF-S01U034 > 985
408900          MOVE 30000000,00  TO    VAL-IS-COMPARAR
409000     END-IF
409100
409200     IF   CORR-LIB-AON-HOLD-PR = 'SIM' AND
409300          COD-TARIF-S01U034 > 985
409400          MOVE 20000000,00  TO    VAL-IS-COMPARAR
409500     END-IF
409600
409700     IF   CORR-LIB-RECIFE = 'SIM' AND
409800          COD-TARIF-S01U034 > 987
409900          MOVE 15000000,00  TO    VAL-IS-COMPARAR
410000     END-IF
410100
410200**FICHA 1000655
410300     IF  (CORR-LIB-SCAVASEG = 'SIM' OR CORR-LIB-LARES = 'SIM') AND
410400          COD-TARIF-S01U034 > 989
410500          MOVE 10000000,00  TO    VAL-IS-COMPARAR
410600     END-IF
410700     IF  (CORR-LIB-SEGURALTA = 'SIM' OR
410800          CORR-LIB-TONETTE = 'SIM') AND
410900          COD-TARIF-S01U034 > 989
411000          MOVE 13000000,00  TO    VAL-IS-COMPARAR
411100     END-IF
411200     IF  (CORR-LIB-ASSIS = 'SIM' OR CORR-LIB-DL = 'SIM' OR
411300          CORR-LIB-GARSEG = 'SIM') AND
411400          COD-TARIF-S01U034 > 989
411500          MOVE 8000000,00  TO    VAL-IS-COMPARAR
411600     END-IF
411700     IF   CORR-LIB-INVEST = 'SIM' AND
411800          COD-TARIF-S01U034 > 989
411900          MOVE 7000000,00  TO    VAL-IS-COMPARAR
412000     END-IF
412100     IF CORR-LIB-APISUL = 'SIM' AND COD-CLASF = '018 ' AND
412200               COD-COMPL-CLASF =  '11'
412300          MOVE 2000000,00  TO    VAL-IS-COMPARAR
412400     END-IF
412500**FICHA 1000851
412600     IF   CORR-LIB-WALKER = 'SIM' AND
412700          COD-TARIF-S01U034 > 993
412800          MOVE 15000000,00  TO    VAL-IS-COMPARAR
412900     END-IF
413000
413100     IF CORR-LIB-GANDINI = 'SIM' AND COD-CLASF = '197 ' AND
413200               COD-COMPL-CLASF =  '17'
413300          MOVE 15000000,00 TO    VAL-IS-COMPARAR
413400     END-IF
413500     IF CORR-LIB-GANDINI = 'SIM' AND COD-CLASF = '197 ' AND
413600               COD-COMPL-CLASF =  '18'
413700          MOVE 15000000,00 TO    VAL-IS-COMPARAR
413800     END-IF
413900
414000     IF CORR-LIB-AON-HOLD-MACAE = 'SIM'
414100         MOVE 20000000,00  TO    VAL-IS-COMPARAR
414200     END-IF
414300
414400*FICHA - 1100118
414500*    IF  COD-CORR-CTRL = 0715427 AND
414600*        COD-TARIF-S01U034 > 1003
414700*        COD-TARIF-S01U034 < 1034
414800*        MOVE 10000000,00  TO    VAL-IS-COMPARAR
414900*    END-IF
415000
415100*FICHA - 1100352 - TARIFA 1010 E 1011 MAIO 2011
415200     IF  COD-CORR-CTRL = 0032201 AND
415300         COD-CLASF = '022 ' AND COD-COMPL-CLASF =  '13' AND
415400         COD-TARIF-S01U034 > 1009
415500         MOVE 20000000,00  TO    VAL-IS-COMPARAR
415600     END-IF
415700
415800*FICHA - 1100352 - TARIFA 1010 E 1011 MAIO 2011
415900     IF  COD-CORR-CTRL = 0035701 AND
416000         COD-CLASF = '022 ' AND COD-COMPL-CLASF =  '13' AND
416100         COD-TARIF-S01U034 > 1009 AND
416200         COD-TARIF-S01U034 < 1034
416300         MOVE 10000000,00  TO    VAL-IS-COMPARAR
416400     END-IF
416500
416600*** 1100705 - TARIFA 1016 E 1017 AGOSTO 2011
416700     IF (COD-CORR-CTRL =  0008001 OR 0008002 OR 0008003 OR
416800                          0008004 OR 0008005 OR 0008006 OR
416900                          0008008 OR 0008011 OR 0008014 OR
417000                          0008028) AND (COD-CLASF = '022 ' AND
417100         COD-COMPL-CLASF = '13' AND COD-TARIF-S01U034 >= 1016)
417200         MOVE 30000000,00  TO    VAL-IS-COMPARAR
417300     END-IF
417400
417500***  1100864 - TARIFA 1018 E 1019 SETEMBRO 2011
417600     IF  (COD-TARIF-S01U034 >= 1018) AND
417700         ((COD-CLASF = '282 ' AND COD-COMPL-CLASF = '10') OR
417800          (COD-CLASF = '282A' AND COD-COMPL-CLASF = '10'))
417900         MOVE 20000000,00  TO    VAL-IS-COMPARAR
418000     END-IF
418100
418200***  1100864 - TARIFA 1018 E 1019 SETEMBRO 2011
418300     IF  (COD-TARIF-S01U034 >= 1018) AND
418400         (COD-CORR-CTRL = 0328999 OR COD-CORR-CTRL = 0742205)
418500         MOVE 20000000,00  TO    VAL-IS-COMPARAR
418600     END-IF
418700
418800***  1200108 -  TARIFA 1030 E 1031 FEVEREIRO 2012
418900     IF  (COD-TARIF-S01U034 >= 1030) AND
419000         (COD-CORR-CTRL = 0701401) AND
419100         (COD-CLASF = '496 ' AND
419200         (COD-COMPL-CLASF = '10' OR COD-COMPL-CLASF = '11'))
419300        MOVE 15000000,00  TO    VAL-IS-COMPARAR
419400     END-IF
419500
419600     IF   VAL-IS-4-4-1-WS   >   VAL-IS-COMPARAR
419700          MOVE      10  TO  COD-IDEN-STAT-WS
419800          MOVE  122441  TO  COD-ERR-NORMA-WS
419900          PERFORM  GRAVA-ERROS
420000     END-IF
420100
420200     IF   VAL-IS-4-4-2-WS   >   2500000,00
420300          MOVE      10  TO  COD-IDEN-STAT-WS
420400          MOVE  122442  TO  COD-ERR-NORMA-WS
420500          PERFORM  GRAVA-ERROS
420600     END-IF
420700     IF   CORR-LIB2     =   'SIM' OR
420800          CORR-LIB-HELLNER = 'SIM' OR
420900          CORR-LIB-PROSER-ACF = 'SIM'
421000          MOVE 300000,00     TO    VAL-IS-COMPARAR
421100     ELSE
421200          MOVE 200000,00     TO    VAL-IS-COMPARAR
421300     END-IF
421400     IF   COD-CORR-CTRL   = 0218101 OR 0683204
421500          MOVE 300000,00     TO    VAL-IS-COMPARAR
421600     END-IF
421700     IF   CORR-LIB-PUNCH = 'SIM' AND
421800          COD-TARIF-S01U034 > 959 AND  COD-CLASF NOT = '022 '
421900          MOVE 200000,00     TO    VAL-IS-COMPARAR
422000     END-IF
422100** FICHA 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
422200     IF  CORR-LIB-AON-HOLD-SP = 'SIM'
422300          MOVE 500000,00     TO    VAL-IS-COMPARAR
422400     END-IF
422500     IF   VAL-IS-4-4-3-WS   >   VAL-IS-COMPARAR
422600          MOVE      10  TO  COD-IDEN-STAT-WS
422700          MOVE  122443  TO  COD-ERR-NORMA-WS
422800          PERFORM  GRAVA-ERROS
422900     END-IF
423000
423100***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
423200     IF (COD-TARIF-S01U034 >= 1034)
423300        MOVE 100000,00 TO VAL-IS-COMPARAR
423400     ELSE
423500        MOVE 312000,00 TO VAL-IS-COMPARAR
423600     END-IF
423700     IF   VAL-IS-4-4-4-WS   >   VAL-IS-COMPARAR
423800          MOVE      10  TO  COD-IDEN-STAT-WS
423900          MOVE  122444  TO  COD-ERR-NORMA-WS
424000          PERFORM  GRAVA-ERROS
424100     END-IF.
424200
424300***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
424400     IF (COD-TARIF-S01U034 >= 1034)
424500        MOVE 100000,00 TO VAL-IS-COMPARAR
424600     ELSE
424700        MOVE 312000,00 TO VAL-IS-COMPARAR
424800     END-IF
424900     IF   VAL-IS-4-4-5-WS   >   VAL-IS-COMPARAR
425000          MOVE      10  TO  COD-IDEN-STAT-WS
425100          MOVE  122445  TO  COD-ERR-NORMA-WS
425200          PERFORM  GRAVA-ERROS
425300     END-IF
425400
425500***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
425600     IF (COD-TARIF-S01U034 >= 1034)
425700        MOVE 100000,00 TO VAL-IS-COMPARAR
425800     ELSE
425900        MOVE 312000,00 TO VAL-IS-COMPARAR
426000     END-IF
426100     IF   VAL-IS-4-4-6-WS   >   VAL-IS-COMPARAR
426200          MOVE      10  TO  COD-IDEN-STAT-WS
426300          MOVE  122446  TO  COD-ERR-NORMA-WS
426400          PERFORM  GRAVA-ERROS
426500     END-IF
426600
426700     IF   VAL-IS-4-4-7-WS   >   175000,00
426800          MOVE      10  TO  COD-IDEN-STAT-WS
426900          MOVE  122447  TO  COD-ERR-NORMA-WS
427000          PERFORM  GRAVA-ERROS
427100     END-IF
427200
427300     IF   VAL-IS-4-4-8-WS   >   2500000,00
427400          MOVE      10  TO  COD-IDEN-STAT-WS
427500          MOVE  122448  TO  COD-ERR-NORMA-WS
427600          PERFORM  GRAVA-ERROS
427700     END-IF.
427800
427900     IF   VAL-IS-4-4-9-WS   >   12500000,00
428000          MOVE      10  TO  COD-IDEN-STAT-WS
428100          MOVE  122449  TO  COD-ERR-NORMA-WS
428200          PERFORM  GRAVA-ERROS
428300     END-IF.
428400
428500** FICHA 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
428600     IF CORR-LIB-AON-HOLD-SP = 'SIM'
428700        MOVE 500000,00     TO    VAL-IS-COMPARAR
428800     ELSE
428900        MOVE 200000,00     TO    VAL-IS-COMPARAR
429000     END-IF
429100
429200     IF   VAL-IS-4-5-0-WS   >   VAL-IS-COMPARAR
429300          MOVE      10  TO  COD-IDEN-STAT-WS
429400          MOVE  122450  TO  COD-ERR-NORMA-WS
429500          PERFORM  GRAVA-ERROS
429600     END-IF
429700
429800     IF   VAL-IS-4-5-1-WS   >   200000,00
429900          MOVE      10  TO  COD-IDEN-STAT-WS
430000          MOVE  122466  TO  COD-ERR-NORMA-WS
430100          PERFORM  GRAVA-ERROS
430200     END-IF
430300
430400     IF   VAL-IS-4-5-2-WS   >   8000000,00
430500          MOVE      10  TO  COD-IDEN-STAT-WS
430600          MOVE  122467  TO  COD-ERR-NORMA-WS
430700          PERFORM  GRAVA-ERROS
430800     END-IF
430900
431000*    IF   VAL-IS-4-5-3-WS   >   8000000,00
431100*         MOVE      10  TO  COD-IDEN-STAT-WS
431200*         MOVE  122468  TO  COD-ERR-NORMA-WS
431300*         PERFORM  GRAVA-ERROS
431400*    END-IF.
431500
431600** FICHA 901094
431700*    IF   VAL-IS-4-5-4-WS   >      30000,00 AND
431800*         (COD-CLASF EQUAL '024 ' OR '471 ' OR '281 ' OR
431900*         (COD-CLASF  = '134 ' AND  COD-COMPL-CLASF  =  '17') OR
432000*         (COD-CLASF  = '134 ' AND  COD-COMPL-CLASF  =  '18'))
432100*         MOVE      10  TO  COD-IDEN-STAT-WS
432200*         MOVE  122469  TO  COD-ERR-NORMA-WS
432300*         PERFORM  GRAVA-ERROS
432400*    END-IF.
432500
432600***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
432700     IF  (COD-TARIF-S01U034  >= 1034)  AND
432800         (VAL-IS-4-5-4-WS > 200000,00)
432900          MOVE      10  TO  COD-IDEN-STAT-WS
433000          MOVE  122469  TO  COD-ERR-NORMA-WS
433100          PERFORM  GRAVA-ERROS
433200     END-IF.
433300
433400***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
433500     IF (COD-TARIF-S01U034 >= 1034)
433600        MOVE 500000,00 TO VAL-IS-COMPARAR
433700     ELSE
433800        MOVE 200000,00 TO VAL-IS-COMPARAR
433900     END-IF
434000     IF   VAL-IS-4-5-5-WS > VAL-IS-COMPARAR
434100          MOVE      10  TO  COD-IDEN-STAT-WS
434200          MOVE  122470  TO  COD-ERR-NORMA-WS
434300          PERFORM  GRAVA-ERROS
434400     END-IF.
434500
434600***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
434700     IF (COD-TARIF-S01U034 >= 1034)
434800        MOVE 500000,00 TO VAL-IS-COMPARAR
434900     ELSE
435000        MOVE 200000,00 TO VAL-IS-COMPARAR
435100     END-IF
435200     IF   VAL-IS-4-5-6-WS > VAL-IS-COMPARAR
435300          MOVE      10  TO  COD-IDEN-STAT-WS
435400          MOVE  122476  TO  COD-ERR-NORMA-WS
435500          PERFORM  GRAVA-ERROS
435600     END-IF.
435700
435800***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
435900     IF (COD-TARIF-S01U034 >= 1034)
436000        MOVE 500000,00 TO VAL-IS-COMPARAR
436100     ELSE
436200        MOVE 200000,00 TO VAL-IS-COMPARAR
436300     END-IF
436400     IF   VAL-IS-4-5-7-WS > VAL-IS-COMPARAR
436500          MOVE      10  TO  COD-IDEN-STAT-WS
436600          MOVE  122472  TO  COD-ERR-NORMA-WS
436700          PERFORM  GRAVA-ERROS
436800     END-IF.
436900
437000***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
437100     IF (COD-TARIF-S01U034 >= 1034)
437200        MOVE 500000,00 TO VAL-IS-COMPARAR
437300     ELSE
437400        MOVE 200000,00 TO VAL-IS-COMPARAR
437500     END-IF
437600     IF   VAL-IS-4-5-8-WS > VAL-IS-COMPARAR
437700          MOVE      10  TO  COD-IDEN-STAT-WS
437800          MOVE  122473  TO  COD-ERR-NORMA-WS
437900          PERFORM  GRAVA-ERROS
438000     END-IF.
438100
438200***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
438300     IF (COD-TARIF-S01U034 >= 1034)
438400        MOVE 500000,00 TO VAL-IS-COMPARAR
438500     ELSE
438600        MOVE 200000,00 TO VAL-IS-COMPARAR
438700     END-IF
438800     IF   VAL-IS-4-5-9-WS > VAL-IS-COMPARAR
438900          MOVE      10  TO  COD-IDEN-STAT-WS
439000          MOVE  122474  TO  COD-ERR-NORMA-WS
439100          PERFORM  GRAVA-ERROS
439200     END-IF.
439300
439400     IF   VAL-IS-4-6-0-WS   >     200000,00
439500          MOVE      10  TO  COD-IDEN-STAT-WS
439600          MOVE  122460  TO  COD-ERR-NORMA-WS
439700          PERFORM  GRAVA-ERROS
439800     END-IF.
439900
440000     IF   VAL-IS-4-6-1-WS   >     200000,00
440100          MOVE      10  TO  COD-IDEN-STAT-WS
440200          MOVE  122475  TO  COD-ERR-NORMA-WS
440300          PERFORM  GRAVA-ERROS
440400     END-IF.
440500
440600     IF   VAL-IS-4-6-2-WS   >     200000,00
440700          MOVE      10  TO  COD-IDEN-STAT-WS
440800          MOVE  122462  TO  COD-ERR-NORMA-WS
440900          PERFORM  GRAVA-ERROS
441000     END-IF.
441100
441200     IF   VAL-IS-4-6-3-WS   >     200000,00
441300          MOVE      10  TO  COD-IDEN-STAT-WS
441400          MOVE  122463  TO  COD-ERR-NORMA-WS
441500          PERFORM  GRAVA-ERROS
441600     END-IF.
441700
441800     IF   VAL-IS-4-6-4-WS   >     200000,00
441900          MOVE      10  TO  COD-IDEN-STAT-WS
442000          MOVE  122464  TO  COD-ERR-NORMA-WS
442100          PERFORM  GRAVA-ERROS
442200     END-IF.
442300
442400     IF   VAL-IS-4-6-5-WS   >     200000,00
442500          MOVE      10  TO  COD-IDEN-STAT-WS
442600          MOVE  122465  TO  COD-ERR-NORMA-WS
442700          PERFORM  GRAVA-ERROS
442800     END-IF.
442900
443000** FICHA 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
443100     IF CORR-LIB-AON-HOLD-SP = 'SIM'
443200        MOVE 500000,00  TO  VAL-IS-COMPARAR
443300     ELSE
443400        IF (COD-TARIF-S01U034 >= 1034)
443500           MOVE 200000,00   TO  VAL-IS-COMPARAR
443600        ELSE
443700           MOVE 50000,00   TO  VAL-IS-COMPARAR
443800        END-IF
443900     END-IF.
444000     IF   VAL-IS-4-6-6-WS   >  VAL-IS-COMPARAR
444100          MOVE      10  TO  COD-IDEN-STAT-WS
444200          MOVE  122477  TO  COD-ERR-NORMA-WS
444300          PERFORM  GRAVA-ERROS
444400     END-IF.
444500
444600     IF   VAL-IS-4-6-7-WS   >     250000,00
444700          MOVE      10  TO  COD-IDEN-STAT-WS
444800          MOVE  122478  TO  COD-ERR-NORMA-WS
444900          PERFORM  GRAVA-ERROS
445000     END-IF.
445100
445200** FICHA 1100674 - VERSAO PERSONALIZADA - AON HONDINGS
445300     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
445400        VAL-IS-COB-112-003 > 500000,00
445500          MOVE      10  TO  COD-IDEN-STAT-WS
445600          MOVE  122482  TO  COD-ERR-NORMA-WS
445700          PERFORM  GRAVA-ERROS
445800     END-IF.
445900     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
446000        VAL-IS-COB-112-007 > 250000,00
446100          MOVE      10  TO  COD-IDEN-STAT-WS
446200          MOVE  122483  TO  COD-ERR-NORMA-WS
446300          PERFORM  GRAVA-ERROS
446400     END-IF.
446500     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
446600        VAL-IS-COB-112-009 > 500000,00
446700          MOVE      10  TO  COD-IDEN-STAT-WS
446800          MOVE  122484  TO  COD-ERR-NORMA-WS
446900          PERFORM  GRAVA-ERROS
447000     END-IF.
447100*    IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
447200*       VAL-IS-COB-112-010 > 500000,00
447300*         MOVE      10  TO  COD-IDEN-STAT-WS
447400*         MOVE  122485  TO  COD-ERR-NORMA-WS
447500*         PERFORM  GRAVA-ERROS
447600*    END-IF.
447700     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
447800        VAL-IS-COB-112-011 > 500000,00
447900          MOVE      10  TO  COD-IDEN-STAT-WS
448000          MOVE  122486  TO  COD-ERR-NORMA-WS
448100          PERFORM  GRAVA-ERROS
448200     END-IF.
448300     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
448400        VAL-IS-COB-112-012 > 500000,00
448500          MOVE      10  TO  COD-IDEN-STAT-WS
448600          MOVE  122487  TO  COD-ERR-NORMA-WS
448700          PERFORM  GRAVA-ERROS
448800     END-IF.
448900     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
449000        VAL-IS-COB-112-013 > 500000,00
449100          MOVE      10  TO  COD-IDEN-STAT-WS
449200          MOVE  122488  TO  COD-ERR-NORMA-WS
449300          PERFORM  GRAVA-ERROS
449400     ELSE
449500***     1200292 - TARIFA 1034 E 1035 ABRIL 2012
449600        IF (COD-TARIF-S01U034  >= 1034)  AND
449700           (VAL-IS-COB-112-013 > 200000,00)
449800             MOVE      10  TO  COD-IDEN-STAT-WS
449900             MOVE  122488  TO  COD-ERR-NORMA-WS
450000             PERFORM  GRAVA-ERROS
450100        END-IF
450200     END-IF.
450300     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
450400        VAL-IS-COB-112-014 > 500000,00
450500          MOVE      10  TO  COD-IDEN-STAT-WS
450600          MOVE  122489  TO  COD-ERR-NORMA-WS
450700          PERFORM  GRAVA-ERROS
450800     ELSE
450900***     1200292 - TARIFA 1034 E 1035 ABRIL 2012
451000        IF (COD-TARIF-S01U034  >= 1034)  AND
451100           (VAL-IS-COB-112-014 > 200000,00)
451200             MOVE      10  TO  COD-IDEN-STAT-WS
451300             MOVE  122489  TO  COD-ERR-NORMA-WS
451400             PERFORM  GRAVA-ERROS
451500        END-IF
451600     END-IF.
451700     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
451800        VAL-IS-COB-112-015 > 500000,00
451900          MOVE      10  TO  COD-IDEN-STAT-WS
452000          MOVE  122490  TO  COD-ERR-NORMA-WS
452100          PERFORM  GRAVA-ERROS
452200     ELSE
452300***     1200292 - TARIFA 1034 E 1035 ABRIL 2012
452400        IF (COD-TARIF-S01U034  >= 1034)  AND
452500           (VAL-IS-COB-112-015 > 200000,00)
452600             MOVE      10  TO  COD-IDEN-STAT-WS
452700             MOVE  122490  TO  COD-ERR-NORMA-WS
452800             PERFORM  GRAVA-ERROS
452900        END-IF
453000     END-IF.
453100     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
453200        VAL-IS-COB-112-016 > 500000,00
453300          MOVE      10  TO  COD-IDEN-STAT-WS
453400          MOVE  122516  TO  COD-ERR-NORMA-WS
453500          PERFORM  GRAVA-ERROS
453600     ELSE
453700***     1200292 - TARIFA 1034 E 1035 ABRIL 2012
453800        IF (COD-TARIF-S01U034  >= 1034)  AND
453900           (VAL-IS-COB-112-016 > 200000,00)
454000             MOVE      10  TO  COD-IDEN-STAT-WS
454100             MOVE  122516  TO  COD-ERR-NORMA-WS
454200             PERFORM  GRAVA-ERROS
454300        END-IF
454400     END-IF.
454500     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
454600        VAL-IS-COB-112-017 > 500000,00
454700          MOVE      10  TO  COD-IDEN-STAT-WS
454800          MOVE  122517  TO  COD-ERR-NORMA-WS
454900          PERFORM  GRAVA-ERROS
455000     ELSE
455100***     1200292 - TARIFA 1034 E 1035 ABRIL 2012
455200        IF (COD-TARIF-S01U034  >= 1034)  AND
455300           (VAL-IS-COB-112-017 > 200000,00)
455400             MOVE      10  TO  COD-IDEN-STAT-WS
455500             MOVE  122517  TO  COD-ERR-NORMA-WS
455600             PERFORM  GRAVA-ERROS
455700        END-IF
455800     END-IF.
455900     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
456000        VAL-IS-COB-112-021 > 500000,00
456100          MOVE      10  TO  COD-IDEN-STAT-WS
456200          MOVE  122518  TO  COD-ERR-NORMA-WS
456300          PERFORM  GRAVA-ERROS
456400     END-IF.
456500
456600***  1200292 - TARIFA 1034 E 1035 ABRIL 2012
456700     IF (COD-TARIF-S01U034  >= 1034)  AND
456800        (VAL-IS-COB-112-028 > 400000,00)
456900          MOVE      10  TO  COD-IDEN-STAT-WS
457000          MOVE  1234354 TO  COD-ERR-NORMA-WS
457100          PERFORM  GRAVA-ERROS
457200     END-IF.
457300
457400     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
457500        VAL-IS-COB-112-038 > 500000,00
457600          MOVE      10  TO  COD-IDEN-STAT-WS
457700          MOVE  122519  TO  COD-ERR-NORMA-WS
457800          PERFORM  GRAVA-ERROS
457900     END-IF.
458000     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
458100        VAL-IS-COB-112-040 > 500000,00
458200          MOVE      10  TO  COD-IDEN-STAT-WS
458300          MOVE  122520  TO  COD-ERR-NORMA-WS
458400          PERFORM  GRAVA-ERROS
458500     END-IF.
458600     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
458700        VAL-IS-COB-112-043 > 500000,00
458800          MOVE      10  TO  COD-IDEN-STAT-WS
458900          MOVE  122521  TO  COD-ERR-NORMA-WS
459000          PERFORM  GRAVA-ERROS
459100     END-IF.
459200     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
459300        VAL-IS-COB-112-044 > 500000,00
459400          MOVE      10  TO  COD-IDEN-STAT-WS
459500          MOVE  122522  TO  COD-ERR-NORMA-WS
459600          PERFORM  GRAVA-ERROS
459700     END-IF.
459800     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
459900        VAL-IS-COB-112-054 > 500000,00
460000          MOVE      10  TO  COD-IDEN-STAT-WS
460100          MOVE  122523  TO  COD-ERR-NORMA-WS
460200          PERFORM  GRAVA-ERROS
460300     END-IF.
460400     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
460500        VAL-IS-COB-112-055 > 500000,00
460600          MOVE      10  TO  COD-IDEN-STAT-WS
460700          MOVE  122524  TO  COD-ERR-NORMA-WS
460800          PERFORM  GRAVA-ERROS
460900     END-IF.
461000     IF CORR-LIB-AON-HOLD-SP = 'SIM' AND
461100        VAL-IS-COB-112-063 > 500000,00
461200          MOVE      10  TO  COD-IDEN-STAT-WS
461300          MOVE  122525  TO  COD-ERR-NORMA-WS
461400          PERFORM  GRAVA-ERROS
461500     ELSE
461600***     1200292 - TARIFA 1034 E 1035 ABRIL 2012
461700        IF (COD-TARIF-S01U034  >= 1034)  AND
461800           (VAL-IS-COB-112-063 > 200000,00)
461900             MOVE      10  TO  COD-IDEN-STAT-WS
462000             MOVE  122525  TO  COD-ERR-NORMA-WS
462100             PERFORM  GRAVA-ERROS
462200        END-IF
462300     END-IF.
462400
462500 112-NORMA-4-5.
462600
462700     MOVE    ZEROES   TO  VAL-IS-COMPARAR
462800     IF CORR-LIB2 = 'SIM'
462900         IF  COD-CLASF EQUAL '194 ' OR '195 '
463000             MOVE 1500000,00   TO   VAL-IS-COMPARAR
463100         ELSE
463200             MOVE 4000000,00   TO   VAL-IS-COMPARAR
463300         END-IF
463400     ELSE
463500         MOVE 1500000,00   TO   VAL-IS-COMPARAR
463600     END-IF
463700     IF CORR-LIB-PROSER-ACF = 'SIM'
463800             MOVE 4000000,00   TO   VAL-IS-COMPARAR
463900     END-IF
464000*** FICHA 1100454 - FEITO EM 12/08/2011
464100     IF (COD-TARIF-S01U034 >= 1016) AND
464200        (COD-CORR-CTRL = 0714208 OR COD-CORR-CTRL = 0714308)
464300             MOVE 10000000,00   TO   VAL-IS-COMPARAR
464400     END-IF
464500     IF   VAL-VR  >  VAL-IS-COMPARAR
464600       IF CORR-LIB = 'NAO' AND CORR-LIB-AON-HOLD-SP = 'NAO'
464700              AND (CORR-LIB-MARSH = 'NAO' OR
464800                  (CORR-LIB-MARSH = 'SIM' AND
464900                    COD-TARIF-S01U034 > 949))
465000              AND (CORR-LIB-PUNCH = 'NAO' AND
465100                  COD-TARIF-S01U034 > 959)
465200              AND (CORR-LIB-GANDINI = 'NAO' AND
465300                  COD-TARIF-S01U034 > 961)
465400*** 1100352 - TARIFA 1010 E 1011 MAIO 2011
465500              AND (COD-CORR-CTRL NOT = 0032201 AND
465600                  COD-TARIF-S01U034 > 1009)
465700              AND (COD-CORR-CTRL NOT = 0035701 AND
465800                  COD-TARIF-S01U034 > 1009)
465900                  IF COD-CLASF = '022 ' AND
466000                     COD-COMPL-CLASF =  '13'
466100                     IF (COD-TARIF-S01U034 > 1027 AND
466200                         COD-TARIF-S01U034 < 1034 AND
466300                        VAL-VR > 10000000,00) OR
466400                        (COD-TARIF-S01U034 <= 1027)
466500                          MOVE 10     TO COD-IDEN-STAT-WS
466600                          MOVE 122453 TO COD-ERR-NORMA-WS
466700                          PERFORM  GRAVA-ERROS
466800                     END-IF
466900                  END-IF
467000       END-IF
467100       IF COD-CLASF  = '067 ' AND  COD-COMPL-CLASF  =  '11'
467200          MOVE  10      TO  COD-IDEN-STAT-WS
467300          MOVE  122454  TO  COD-ERR-NORMA-WS
467400          PERFORM  GRAVA-ERROS
467500       END-IF
467600       IF COD-CLASF  = '067 ' AND  COD-COMPL-CLASF  =  '12'
467700          MOVE  10      TO  COD-IDEN-STAT-WS
467800          MOVE  122455  TO  COD-ERR-NORMA-WS
467900          PERFORM  GRAVA-ERROS
468000       END-IF
468100       IF COD-CLASF  = '067 ' AND  COD-COMPL-CLASF  =  '13'
468200          MOVE  10      TO  COD-IDEN-STAT-WS
468300          MOVE  122456  TO  COD-ERR-NORMA-WS
468400          PERFORM  GRAVA-ERROS
468500       END-IF
468600       IF COD-CLASF  = '071 ' AND COD-TARIF-S01U034 < 950
468700          MOVE  10      TO  COD-IDEN-STAT-WS
468800          MOVE  122457  TO  COD-ERR-NORMA-WS
468900          PERFORM  GRAVA-ERROS
469000       END-IF
469100       IF COD-CLASF  = '125 '
469200          MOVE  10      TO  COD-IDEN-STAT-WS
469300          MOVE  122458  TO  COD-ERR-NORMA-WS
469400          PERFORM  GRAVA-ERROS
469500       END-IF
469600       IF COD-CLASF  = '131 ' AND COD-TARIF-S01U034 < 950
469700          MOVE  10      TO  COD-IDEN-STAT-WS
469800          MOVE  122459  TO  COD-ERR-NORMA-WS
469900          PERFORM  GRAVA-ERROS
470000       END-IF
470100       IF COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '13'
470200          MOVE  10      TO  COD-IDEN-STAT-WS
470300          MOVE  1224510 TO  COD-ERR-NORMA-WS
470400          PERFORM  GRAVA-ERROS
470500       END-IF
470600       IF COD-CLASF  = '192 ' AND  COD-COMPL-CLASF  =  '14'
470700          MOVE  10      TO  COD-IDEN-STAT-WS
470800          MOVE  1224511 TO  COD-ERR-NORMA-WS
470900          PERFORM  GRAVA-ERROS
471000       END-IF
471100       IF COD-CLASF  = '194 '
471200          MOVE  10      TO  COD-IDEN-STAT-WS
471300          MOVE  1224512 TO  COD-ERR-NORMA-WS
471400          PERFORM  GRAVA-ERROS
471500       END-IF
471600       IF COD-CLASF  = '195 '
471700          MOVE  10      TO  COD-IDEN-STAT-WS
471800          MOVE  1224513 TO  COD-ERR-NORMA-WS
471900          PERFORM  GRAVA-ERROS
472000       END-IF
472100       IF COD-CLASF  = '230 ' AND  COD-COMPL-CLASF  =  '20'
472200          MOVE  10      TO  COD-IDEN-STAT-WS
472300          MOVE  1224514 TO  COD-ERR-NORMA-WS
472400          PERFORM  GRAVA-ERROS
472500       END-IF
472600       IF COD-CLASF  = '230 ' AND  COD-COMPL-CLASF  =  '21'
472700          MOVE  10      TO  COD-IDEN-STAT-WS
472800          MOVE  1224515 TO  COD-ERR-NORMA-WS
472900          PERFORM  GRAVA-ERROS
473000       END-IF
473100       IF COD-CLASF  = '230 ' AND  COD-COMPL-CLASF  =  '22'
473200          MOVE  10      TO  COD-IDEN-STAT-WS
473300          MOVE  1224516 TO  COD-ERR-NORMA-WS
473400          PERFORM  GRAVA-ERROS
473500       END-IF
473600       IF COD-CLASF  = '260 ' AND  COD-COMPL-CLASF  =  '13'
473700          MOVE  10      TO  COD-IDEN-STAT-WS
473800          MOVE  1224517 TO  COD-ERR-NORMA-WS
473900          PERFORM  GRAVA-ERROS
474000       END-IF
474100       IF COD-CLASF  = '364 ' AND COD-TARIF-S01U034 < 950
474200          MOVE  10      TO  COD-IDEN-STAT-WS
474300          MOVE  1224518 TO  COD-ERR-NORMA-WS
474400          PERFORM  GRAVA-ERROS
474500       END-IF
474600       IF COD-CLASF  = '380 ' AND COD-TARIF-S01U034 < 950
474700          MOVE  10      TO  COD-IDEN-STAT-WS
474800          MOVE  1224519 TO  COD-ERR-NORMA-WS
474900          PERFORM  GRAVA-ERROS
475000       END-IF
475100       IF COD-CLASF  = '422 ' AND COD-TARIF-S01U034 < 950
475200          MOVE  10      TO  COD-IDEN-STAT-WS
475300          MOVE  1224520 TO  COD-ERR-NORMA-WS
475400          PERFORM  GRAVA-ERROS
475500       END-IF
475600       IF COD-CLASF  = '436 ' AND COD-TARIF-S01U034 < 950
475700          MOVE  10      TO  COD-IDEN-STAT-WS
475800          MOVE  1224521 TO  COD-ERR-NORMA-WS
475900          PERFORM  GRAVA-ERROS
476000       END-IF
476100       IF COD-CLASF  = '437 ' AND COD-TARIF-S01U034 < 950
476200          MOVE  10      TO  COD-IDEN-STAT-WS
476300          MOVE  1224522 TO  COD-ERR-NORMA-WS
476400          PERFORM  GRAVA-ERROS
476500       END-IF
476600       IF COD-CLASF  = '438 ' AND COD-TARIF-S01U034 < 950
476700          MOVE  10      TO  COD-IDEN-STAT-WS
476800          MOVE  1224523 TO  COD-ERR-NORMA-WS
476900          PERFORM  GRAVA-ERROS
477000       END-IF
477100       IF COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '14'
477200          MOVE  10      TO  COD-IDEN-STAT-WS
477300          MOVE  1224524 TO  COD-ERR-NORMA-WS
477400          PERFORM  GRAVA-ERROS
477500       END-IF
477600       IF COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '15'
477700          MOVE  10      TO  COD-IDEN-STAT-WS
477800          MOVE  1224525 TO  COD-ERR-NORMA-WS
477900          PERFORM  GRAVA-ERROS
478000       END-IF
478100       IF COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '33'
478200          MOVE  10      TO  COD-IDEN-STAT-WS
478300          MOVE  1224526 TO  COD-ERR-NORMA-WS
478400          PERFORM  GRAVA-ERROS
478500       END-IF
478600       IF COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '34'
478700          MOVE  10      TO  COD-IDEN-STAT-WS
478800          MOVE  1224527 TO  COD-ERR-NORMA-WS
478900          PERFORM  GRAVA-ERROS
479000       END-IF
479100
479200*      IF COD-CLASF  = '527 '
479300*         MOVE  10      TO  COD-IDEN-STAT-WS
479400*         MOVE  1224528 TO  COD-ERR-NORMA-WS
479500*         PERFORM  GRAVA-ERROS
479600*      END-IF
479700     END-IF
479800*** 1101181 - TARIFA 1022 E 1023 DEZEMBRO 2011
479900     IF COD-CLASF  = '190 ' AND  COD-TARIF-S01U034 >= 1026
480000        MOVE  10      TO  COD-IDEN-STAT-WS
480100        MOVE  1224530 TO  COD-ERR-NORMA-WS
480200        PERFORM  GRAVA-ERROS
480300     END-IF
480400*** FICHA 1100705 - TARIFA 1016 E 1017 AGOSTO 2011
480500     IF COD-CLASF  = '496 ' AND COD-TARIF-S01U034 > 1015
480600***     1100885 - CORRETOR MAHESO LMG ACIMA 8MI
480700        IF (COD-CORR-CTRL = 0701401)   AND
480800           (COD-CLASF = '496 ' AND
480900           (COD-COMPL-CLASF = '10' OR
481000            COD-COMPL-CLASF = '11')) AND
481100***        1200108 - TARIFA 1030 E 1031 FEVEREIRO 2012
481200           VAL-VR  < 15000000,01
481300           GO TO 112-NORMA-4-6
481400        ELSE
481500*** 1101045 - TARIFA 1022 E 1023 NOVEMBRO 2011
481600           IF COD-TARIF-S01U034 >= 1022 AND
481700              COD-CORR-CTRL = 0724258 AND
481800              COD-COMPL-CLASF = '10'
481900              GO TO 112-NORMA-4-6
482000           ELSE
482100              MOVE  10      TO  COD-IDEN-STAT-WS
482200              MOVE  1224529 TO  COD-ERR-NORMA-WS
482300              PERFORM  GRAVA-ERROS
482400           END-IF
482500        END-IF
482600     END-IF.
482700
482800 112-NORMA-4-6.
482900
483000     IF  NOT  RENOVA
483100         GO  TO  112-NORMA-4-6-F.
483200
483300     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
483400         GO  TO  112-NORMA-4-6-F.
483500
483600*    1200089 - RENOVACOES COM SINISTRO
483700*    PERFORM   200-00-BUSCA-RENOV
483800*    IF   QTD-RENOV-SIN NOT = ZEROS
483900*          MOVE      10  TO  COD-IDEN-STAT-WS
484000*          MOVE  122461  TO  COD-ERR-NORMA-WS
484100*          PERFORM  GRAVA-ERROS
484200*    END-IF.
484300
484400 112-NORMA-4-6-F.
484500
484600 112-NORMA-4-7.
484700
484800     MOVE    'SIM'    TO    CUMPRE-NORMA
484900     MOVE     1       TO   IND-WS
485000     PERFORM  UNTIL  IND-WS  >  NUM-OCOR-COBERT-WS   OR
485100            TAB-COD-COBERT-WS(IND-WS)  EQUAL ZEROS   OR
485200            CUMPRE-NORMA = 'NAO'
485300            IF  TAB-PER-DESC-COML-WS-R(IND-WS)  >  PERC-DSC-CML-WS
485400                MOVE       'NAO'    TO       CUMPRE-NORMA
485500            END-IF
485600        ADD     1         TO   IND-WS
485700     END-PERFORM.
485800
485900     IF   CUMPRE-NORMA = 'NAO'
486000          MOVE   10     TO  COD-IDEN-STAT-WS
486100          MOVE  122471  TO  COD-ERR-NORMA-WS
486200          PERFORM  GRAVA-ERROS
486300     END-IF.
486400
486500 112-NORMA-4-8.
486600**==================================================================
486700**         DESCONSIDERADO CONFORME E-MAIL SHIBA 27/07/2007
486800**==================================================================
486900
487000 112-NOTA-5.
487100
487200 1200-99-PROCESSA-112.
487300     EXIT.
487400
487500*=======================================*
487600 1300-00-PROCESSA-113 SECTION.
487700*=======================================*
487800 1300-01-PROCESSA-113.
487900
488000      IF  ENDOSSO
488100          GO   TO  113-NORMA-3-6.
488200
488300 113-NORMA-1-4-1.
488400
488500      PERFORM 160-00-INSPECAO.
488600      IF  INSP-OBRIG-WS = 'SIM'
488700          MOVE  55   TO  COD-IDEN-STAT-WS
488800          MOVE  5223 TO  COD-ERR-NORMA-WS
488900          PERFORM  GRAVA-ERROS
489000      END-IF.
489100
489200 113-NORMA-1-4-2.
489300
489400     IF  NOT  RENOVA
489500         GO  TO  113-NORMA-3-2-1.
489600
489700     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
489800         GO  TO  113-NORMA-3-2-1.
489900
490000     PERFORM   200-00-BUSCA-RENOV
490100     IF   QTD-RENOV-SIN NOT = ZEROS
490200          PERFORM 065-00-CARREGA-TAB-COB-SIN
490300          PERFORM 170-00-INSPECAO-SIN
490400          IF  INSP-OBRIG-WS = 'SIM'
490500              MOVE  55   TO  COD-IDEN-STAT-WS
490600              MOVE  5223 TO  COD-ERR-NORMA-WS
490700              PERFORM  GRAVA-ERROS
490800          END-IF
490900     END-IF.
491000
491100 113-NORMA-3-1.
491200
491300**FICHA 0701423
491400**   IF   PERC-CORR-WS   >   60,00
491500**        MOVE   80     TO   COD-IDEN-STAT-WS
491600**        MOVE  123311  TO   COD-ERR-NORMA-WS
491700**        PERFORM  GRAVA-ERROS
491800**   END-IF.
491900
492000 113-NORMA-3-2-1.
492100
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       WHENEVER  NOT FOUND GO TO :113-NORMA-3-2-1-NLOC     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
492200     EXEC SQL
492300            WHENEVER  NOT FOUND GO TO :113-NORMA-3-2-1-NLOC
492400     END-EXEC
492500     MOVE  ZEROS   TO   NUM-ITEM-WS
492600
492700     IF  (COD-CLASF = '001 ' AND COD-COMPL-CLASF = '12')
492800       AND  SEGURO-NOVO
      *** 1200539 - TARIFA 1038 E 1039 JUNHO 2012
             AND COD-TARIF-S01U034 < 1038
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '    EXEC SQL                                               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         SELECT  COUNT(*)                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '             INTO :NUM-ITEM-WS                             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '           FROM      TAB_PED_LOC                           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          WHERE  NUM_PED       =     :NUM-PED              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND  COD_RAMO      =     :COD-RAMO             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND  COD_ORG       =     :COD-ORG              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND  NUM_ITEM      <>    :NUM-ITEM             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND  COD_CLASF        =  "001 "                '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND (COD_COMPL_CLASF  =  "11"                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '             OR  COD_COMPL_CLASF  =  "21")                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '    END-EXEC                                               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00175)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00156)
492900         EXEC SQL
493000              SELECT  COUNT(*)
493100                  INTO :NUM-ITEM-WS
493200                FROM      TAB_PED_LOC
493300               WHERE  NUM_PED       =     :NUM-PED
493400                 AND  COD_RAMO      =     :COD-RAMO
493500                 AND  COD_ORG       =     :COD-ORG
493600                 AND  NUM_ITEM      <>    :NUM-ITEM
493700                 AND  COD_CLASF        =  '001 '
493800                 AND (COD_COMPL_CLASF  =  '11'
493900                  OR  COD_COMPL_CLASF  =  '21')
494000         END-EXEC
494100         IF   NUM-ITEM-WS    =   0
494200              MOVE   80     TO   COD-IDEN-STAT-WS
494300              MOVE  123321  TO   COD-ERR-NORMA-WS
494400              PERFORM  GRAVA-ERROS
494500         END-IF
494600     END-IF.
494700
494800 113-NORMA-3-2-2.
494900
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       WHENEVER  NOT FOUND GO TO :113-NORMA-3-2-2-NLOC     '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
495000     EXEC SQL
495100            WHENEVER  NOT FOUND GO TO :113-NORMA-3-2-2-NLOC
495200     END-EXEC
495300     IF (COD-CLASF = '001 ' AND COD-COMPL-CLASF = '22')
495400        AND  SEGURO-NOVO
      *** 1200539 - TARIFA 1038 E 1039 JUNHO 2012
              AND COD-TARIF-S01U034 < 1038
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '    EXEC SQL                                               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '         SELECT  COUNT(*)                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '             INTO :NUM-ITEM-WS                             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '           FROM      TAB_PED_LOC                           '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '          WHERE  NUM_PED       =     :NUM-PED              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND  COD_RAMO      =     :COD-RAMO             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND  COD_ORG       =     :COD-ORG              '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND  NUM_ITEM      <>    :NUM-ITEM             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND  COD_CLASF        =  "001"                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '            AND (COD_COMPL_CLASF  =  "11"                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '             OR  COD_COMPL_CLASF  =  "21")                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '    END-EXEC                                               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00175)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00003)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00002)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00001)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00156)
495500         EXEC SQL
495600              SELECT  COUNT(*)
495700                  INTO :NUM-ITEM-WS
495800                FROM      TAB_PED_LOC
495900               WHERE  NUM_PED       =     :NUM-PED
496000                 AND  COD_RAMO      =     :COD-RAMO
496100                 AND  COD_ORG       =     :COD-ORG
496200                 AND  NUM_ITEM      <>    :NUM-ITEM
496300                 AND  COD_CLASF        =  '001'
496400                 AND (COD_COMPL_CLASF  =  '11'
496500                  OR  COD_COMPL_CLASF  =  '21')
496600         END-EXEC
496700         IF   NUM-ITEM-WS    =   0
496800              MOVE   80     TO   COD-IDEN-STAT-WS
496900              MOVE  123322  TO   COD-ERR-NORMA-WS
497000              PERFORM  GRAVA-ERROS
497100         END-IF
497200     END-IF
497300     GO TO  113-NORMA-3-2-F.
497400
497500 113-NORMA-3-2-1-NLOC.
497600     MOVE     80   TO  COD-IDEN-STAT-WS
497700     MOVE  123321  TO  COD-ERR-NORMA-WS.
497800     PERFORM  GRAVA-ERROS.
497900     GO TO  113-NORMA-3-2-F.
498000
498100 113-NORMA-3-2-2-NLOC.
498200     MOVE     80   TO  COD-IDEN-STAT-WS
498300     MOVE  123322  TO  COD-ERR-NORMA-WS.
498400     PERFORM  GRAVA-ERROS.
498500 113-NORMA-3-2-F.
498600
498700 113-NORMA-3-3.
498800
498900      MOVE 'N'   TO  COD-TIP-AUX
499000      PERFORM 120-00-COBERTURAS.
499100
499200     MOVE     1         TO   IND-WS
499300     MOVE     ZEROS     TO   VAL-IS-CALC-COBERT
499400                             VAL-IS-COBERT-BAS
499500
499600     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
499700       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
499800           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
499900
500000           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
500100               MOVE VAL-IS-AUX TO VAL-IS-COBERT-BAS
500200           END-IF
500300
500400***FICHA 1000975
500500           IF  TAB-COD-COBERT-WS(IND-WS) = '0016'
500600               IF COD-TARIF-S01U034 > 995
500700                  PERFORM 0016-00-AJUSTE-PONTUAL
500800               ELSE
500900                  PERFORM 0016-00-AJUSTE-PONTUAL-ANTES
501000               END-IF
501100           END-IF
501200
501300           IF TAB-COD-COBERT-WS(IND-WS) = '0019'
501400              IF CORR-LIB-VOLKS-RES = 'SIM'
501500                 IF VAL-IS-AUX < 10000,01 AND
501600                    COD-TARIF-S01U034 > 969
501700                    CONTINUE
501800                 ELSE
501900                    MOVE 'NAO'   TO CUMPRE-NORMA
502000                    MOVE 124333  TO COD-ERR-NORMA-WS
502100                    MOVE 10  TO  COD-IDEN-STAT-WS
502200                    PERFORM  GRAVA-ERROS
502300                 END-IF
502400              ELSE
502500                 IF CORR-LIB-HELLNER = 'SIM' OR
502600                     CORR-LIB-RESIDENCIAL = 'SIM'  OR
502700                     CORR-LIB-MARINE  = 'SIM'  OR
502800                     CORR-LIB-LAZAM = 'SIM'
502900                    IF VAL-IS-AUX < 5000,01
503000                       CONTINUE
503100                    ELSE
503200                       MOVE 'NAO'   TO CUMPRE-NORMA
503300                       MOVE 123333  TO COD-ERR-NORMA-WS
503400                       MOVE 10  TO  COD-IDEN-STAT-WS
503500                       PERFORM  GRAVA-ERROS
503600                    END-IF
503700                 ELSE
503800                    IF CORR-LIB-MERCEDES = 'SIM'
503900                        IF VAL-IS-AUX < 5000,01
504000                           CONTINUE
504100                        ELSE
504200                           MOVE 'NAO'   TO CUMPRE-NORMA
504300                           MOVE 124333  TO COD-ERR-NORMA-WS
504400                           MOVE 10  TO  COD-IDEN-STAT-WS
504500                           PERFORM  GRAVA-ERROS
504600                        END-IF
504700                    ELSE
504800                        MOVE 'NAO'   TO CUMPRE-NORMA
504900                        MOVE 123333  TO COD-ERR-NORMA-WS
505000                        MOVE 10  TO  COD-IDEN-STAT-WS
505100                        PERFORM  GRAVA-ERROS
505200                    END-IF
505300                 END-IF
505400              END-IF
505500           END-IF
505600
505700           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
505800               IF (CORR-LIB-MERCEDES = 'SIM' OR
505900                  CORR-LIB-MARINE = 'SIM' )
506000                  IF VAL-IS-AUX < 50000,01
506100                     CONTINUE
506200                  ELSE
506300                     MOVE 'NAO'   TO CUMPRE-NORMA
506400                     MOVE 124330  TO COD-ERR-NORMA-WS
506500                     MOVE 10  TO  COD-IDEN-STAT-WS
506600                     PERFORM  GRAVA-ERROS
506700                     MOVE   'NAO'  TO  LMG-WS
506800                  END-IF
506900               END-IF
507000           END-IF
507100
507200           IF  TAB-COD-COBERT-WS(IND-WS) = '0021'
507300               IF (CORR-LIB-MERCEDES = 'SIM' OR
507400                  CORR-LIB-MARINE = 'SIM') AND
507500                  COD-TARIF-S01U034 > 949 AND
507600                  VAL-IS-AUX > 50000,00
507700                  MOVE 'NAO'   TO CUMPRE-NORMA
507800                  MOVE 124331  TO COD-ERR-NORMA-WS
507900                  MOVE 10  TO  COD-IDEN-STAT-WS
508000                  PERFORM  GRAVA-ERROS
508100               END-IF
508200           END-IF
508300
508400           IF  TAB-COD-COBERT-WS(IND-WS) = '0022'
508500               IF (CORR-LIB-RESIDENCIAL = 'SIM' OR
508600                  CORR-LIB-MARINE = 'SIM' ) AND
508700                  VAL-IS-AUX < 100000,01
508800                  CONTINUE
508900               ELSE
509000                  IF CORR-LIB-MERCEDES = 'SIM' AND
509100                     COD-TARIF-S01U034 > 949
509200                     IF VAL-IS-AUX < 100000,01
509300                        CONTINUE
509400                     ELSE
509500                        MOVE 'NAO'   TO CUMPRE-NORMA
509600                        MOVE 124334  TO COD-ERR-NORMA-WS
509700                        MOVE 10  TO  COD-IDEN-STAT-WS
509800                        PERFORM  GRAVA-ERROS
509900                        MOVE   'NAO'  TO  LMG-WS
510000                     END-IF
510100                  ELSE
510200                     IF CORR-LIB-LAZAM = 'SIM' AND
510300                        COD-TARIF-S01U034 > 981
510400                        IF VAL-IS-AUX < 1000000,01
510500                           CONTINUE
510600                        ELSE
510700                           MOVE 'NAO'   TO CUMPRE-NORMA
510800                           MOVE 124334  TO COD-ERR-NORMA-WS
510900                           MOVE 10  TO  COD-IDEN-STAT-WS
511000                           PERFORM  GRAVA-ERROS
511100                           MOVE   'NAO'  TO  LMG-WS
511200                        END-IF
511300                     ELSE
511400                        MOVE 'NAO'   TO CUMPRE-NORMA
511500                        MOVE 123334  TO COD-ERR-NORMA-WS
511600                        MOVE 10  TO  COD-IDEN-STAT-WS
511700                        PERFORM  GRAVA-ERROS
511800                     END-IF
511900                 END-IF
512000               END-IF
512100           END-IF
512200           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
512300               IF CORR-LIB-VOLKS-RES = 'SIM'
512400                  IF VAL-IS-AUX < 10000,01 AND
512500                     COD-TARIF-S01U034 > 969
512600                     CONTINUE
512700                  ELSE
512800                     MOVE 'NAO'   TO CUMPRE-NORMA
512900                     MOVE 124335  TO COD-ERR-NORMA-WS
513000                     MOVE 10  TO  COD-IDEN-STAT-WS
513100                     PERFORM  GRAVA-ERROS
513200                  END-IF
513300               ELSE
513400                  IF CORR-LIB-MARINE = 'SIM'
513500                     IF VAL-IS-AUX < 10000,01
513600                        CONTINUE
513700                     ELSE
513800                        MOVE 'NAO'   TO CUMPRE-NORMA
513900                        MOVE 123335  TO COD-ERR-NORMA-WS
514000                        MOVE 10  TO  COD-IDEN-STAT-WS
514100                        PERFORM  GRAVA-ERROS
514200                     END-IF
514300                  ELSE
514400                    IF CORR-LIB-RESIDENCIAL = 'SIM'
514500                       IF VAL-IS-AUX < 100000,01
514600                          CONTINUE
514700                       ELSE
514800                          MOVE 'NAO'   TO CUMPRE-NORMA
514900                          MOVE 123335  TO COD-ERR-NORMA-WS
515000                          MOVE 10  TO  COD-IDEN-STAT-WS
515100                          PERFORM  GRAVA-ERROS
515200                       END-IF
515300                    ELSE
515400                       IF CORR-LIB-MERCEDES = 'SIM'
515500                         IF VAL-IS-AUX < 10000,01
515600                            CONTINUE
515700                         ELSE
515800                            MOVE 'NAO'   TO CUMPRE-NORMA
515900                            MOVE 124335  TO COD-ERR-NORMA-WS
516000                            MOVE 10  TO  COD-IDEN-STAT-WS
516100                            PERFORM  GRAVA-ERROS
516200                            MOVE   'NAO'  TO  LMG-WS
516300                         END-IF
516400                       ELSE
516500                         IF CORR-LIB-LAZAM = 'SIM'
516600                            IF VAL-IS-AUX < 10000,01 AND
516700                              COD-TARIF-S01U034 > 981
516800                              CONTINUE
516900                            ELSE
517000                              MOVE 'NAO'   TO CUMPRE-NORMA
517100                              MOVE 124335  TO COD-ERR-NORMA-WS
517200                              MOVE 10  TO  COD-IDEN-STAT-WS
517300                              PERFORM  GRAVA-ERROS
517400                              MOVE   'NAO'  TO  LMG-WS
517500                            END-IF
517600                         ELSE
517700                            MOVE 'NAO'   TO CUMPRE-NORMA
517800                            MOVE 123335  TO COD-ERR-NORMA-WS
517900                            MOVE 10  TO  COD-IDEN-STAT-WS
518000**FICHA 1001220
518100                            IF COD-TARIF-S01U034 > 1001
518200                               PERFORM  GRAVA-ERROS
518300                               MOVE   'NAO'  TO  LMG-WS
518400                            END-IF
518500                         END-IF
518600                      END-IF
518700                    END-IF
518800                  END-IF
518900               END-IF
519000           END-IF
519100
519200           IF  TAB-COD-COBERT-WS(IND-WS) = '0024'
519300               COMPUTE VAL-IS-CALC-COBERT ROUNDED =
519400                    (VAL-IS-COBERT-BAS * 20) / 100
519500               IF (CORR-LIB-MERCEDES = 'SIM' AND
519600                  COD-TARIF-S01U034 > 949) OR
519700                  (CORR-LIB-MARINE = 'SIM' AND
519800                  COD-TARIF-S01U034 > 951)
519900                  AND VAL-IS-AUX > VAL-IS-CALC-COBERT
520000                  MOVE 'NAO'   TO CUMPRE-NORMA
520100                  MOVE 124332  TO COD-ERR-NORMA-WS
520200                  MOVE 10  TO  COD-IDEN-STAT-WS
520300                  PERFORM  GRAVA-ERROS
520400                  MOVE   'NAO'  TO  LMG-WS
520500               END-IF
520600           END-IF
520700
520800           IF COD-TARIF-S01U034 < 996
520900              IF  TAB-COD-COBERT-WS(IND-WS) = '0025'
521000                  IF CORR-LIB-RESIDENCIAL = 'SIM' OR
521100                     CORR-LIB-MARINE = 'SIM'
521200                     IF VAL-IS-AUX < 100000,01
521300                        CONTINUE
521400                     ELSE
521500                        MOVE 'NAO'   TO CUMPRE-NORMA
521600                        MOVE 123336  TO COD-ERR-NORMA-WS
521700                        MOVE 10  TO  COD-IDEN-STAT-WS
521800                        PERFORM  GRAVA-ERROS
521900                     END-IF
522000                  ELSE
522100                    IF CORR-LIB-MERCEDES = 'SIM'
522200                       IF VAL-IS-AUX < 100000,01
522300                          CONTINUE
522400                       ELSE
522500                          MOVE 'NAO'   TO CUMPRE-NORMA
522600                          MOVE 124336  TO COD-ERR-NORMA-WS
522700                          MOVE 10  TO  COD-IDEN-STAT-WS
522800                          PERFORM  GRAVA-ERROS
522900                          MOVE   'NAO'  TO  LMG-WS
523000                       END-IF
523100                    ELSE
523200                      IF CORR-LIB-VOLKS-RES = 'SIM'
523300                         IF VAL-IS-AUX < 5000,01 AND
523400                            COD-TARIF-S01U034 > 969
523500                            CONTINUE
523600                         ELSE
523700                            MOVE 'NAO'   TO CUMPRE-NORMA
523800                            MOVE 124336  TO COD-ERR-NORMA-WS
523900                            MOVE 10  TO  COD-IDEN-STAT-WS
524000                            PERFORM  GRAVA-ERROS
524100                         END-IF
524200                      ELSE
524300                         IF CORR-LIB-LAZAM = 'SIM'
524400                            IF VAL-IS-AUX < 100000,01 AND
524500                               COD-TARIF-S01U034 > 981
524600                               CONTINUE
524700                            ELSE
524800                               MOVE 'NAO'   TO CUMPRE-NORMA
524900                               MOVE 123336  TO COD-ERR-NORMA-WS
525000                               MOVE 10  TO  COD-IDEN-STAT-WS
525100                               PERFORM  GRAVA-ERROS
525200                            END-IF
525300                         ELSE
525400                            MOVE 'NAO'   TO CUMPRE-NORMA
525500                            MOVE 123336  TO COD-ERR-NORMA-WS
525600                            MOVE 10  TO  COD-IDEN-STAT-WS
525700                            PERFORM  GRAVA-ERROS
525800                         END-IF
525900                      END-IF
526000                  END-IF
526100                END-IF
526200              END-IF
526300           ELSE
526400               IF TAB-COD-COBERT-WS(IND-WS) = '0025'
526500                   IF CORR-LIB-RESIDENCIAL = 'SIM' OR
526600                      CORR-LIB-MARINE = 'SIM' OR
526700                      CORR-LIB-HELLNER = 'SIM' OR
526800                      CORR-LIB-VOLKS-RES = 'SIM' OR
526900                      CORR-LIB-MERCEDES = 'SIM'
527000                      IF VAL-IS-AUX < 12500,01
527100                         CONTINUE
527200                      ELSE
527300                         MOVE 'NAO'   TO CUMPRE-NORMA
527400                         MOVE 123336  TO COD-ERR-NORMA-WS
527500                         MOVE 10  TO  COD-IDEN-STAT-WS
527600                         PERFORM  GRAVA-ERROS
527700                      END-IF
527800                   ELSE
527900                       IF CORR-LIB-LAZAM = 'SIM'
528000                          IF VAL-IS-AUX < 100000,01 AND
528100                             COD-TARIF-S01U034 > 981
528200                             CONTINUE
528300                          ELSE
528400                             MOVE 'NAO'   TO CUMPRE-NORMA
528500                             MOVE 123336  TO COD-ERR-NORMA-WS
528600                             MOVE 10  TO  COD-IDEN-STAT-WS
528700                             PERFORM  GRAVA-ERROS
528800                          END-IF
528900                       ELSE
529000                          MOVE 'NAO'   TO CUMPRE-NORMA
529100                          MOVE 123336  TO COD-ERR-NORMA-WS
529200                          MOVE 10  TO  COD-IDEN-STAT-WS
529300                          PERFORM  GRAVA-ERROS
529400                       END-IF
529500                   END-IF
529600               END-IF
529700           END-IF
529800
529900           IF COD-TARIF-S01U034 > 995
530000               IF  TAB-COD-COBERT-WS(IND-WS) = '0027'
530100                   IF CORR-LIB-RESIDENCIAL = 'SIM' OR
530200                      CORR-LIB-MARINE = 'SIM' OR
530300                      CORR-LIB-HELLNER = 'SIM' OR
530400                      CORR-LIB-VOLKS-RES = 'SIM' OR
530500                      CORR-LIB-MERCEDES = 'SIM'
530600                      IF VAL-IS-AUX < 10000,01
530700                         CONTINUE
530800                      ELSE
530900                         MOVE 'NAO'   TO CUMPRE-NORMA
531000                         MOVE 123338  TO COD-ERR-NORMA-WS
531100                         MOVE 10  TO  COD-IDEN-STAT-WS
531200                         PERFORM  GRAVA-ERROS
531300                      END-IF
531400                   ELSE
531500                       IF CORR-LIB-AON-HOLD = 'SIM' OR
531600                          CORR-LIB-AON-HOLD-SP = 'SIM'
531700                          IF VAL-IS-AUX < 20000,01
531800                             CONTINUE
531900                          ELSE
532000                             MOVE 'NAO'   TO CUMPRE-NORMA
532100                             MOVE 124338  TO COD-ERR-NORMA-WS
532200                             MOVE 10  TO  COD-IDEN-STAT-WS
532300                             PERFORM  GRAVA-ERROS
532400                             MOVE   'NAO'  TO  LMG-WS
532500                          END-IF
532600                       ELSE
532700                           IF (CORR-LIB-LAZAM = 'SIM' AND
532800                               VAL-IS-AUX < 100000,01 AND
532900                               COD-TARIF-S01U034 > 981) OR
533000                              (COD-CORR-CTRL = 718601 AND
533100                               VAL-IS-AUX < 3000,01 AND
533200                               COD-TARIF-S01U034 > 1027)
533300                                 CONTINUE
533400                           ELSE
      ***  1200539 - TARIFA 1038 E 1039 JUNHO 2012
                                   IF COD-TARIF-S01U034 >= 1038 AND
                                      VAL-IS-AUX < 10000,01
                                       CONTINUE
                                   ELSE
533500                                MOVE 'NAO'   TO CUMPRE-NORMA
533600                                MOVE 123338  TO COD-ERR-NORMA-WS
533700                                MOVE 10  TO  COD-IDEN-STAT-WS
533800                                PERFORM  GRAVA-ERROS
                                   END-IF
533900                           END-IF
534000                       END-IF
534100                   END-IF
534200               END-IF
534300           ELSE
534400               IF  TAB-COD-COBERT-WS(IND-WS) = '0027'
534500                   IF CORR-LIB-MARINE = 'SIM'
534600                      IF VAL-IS-AUX < 10000,01
534700                         CONTINUE
534800                      ELSE
534900                         MOVE 'NAO'   TO CUMPRE-NORMA
535000                         MOVE 123338  TO COD-ERR-NORMA-WS
535100                         MOVE 10  TO  COD-IDEN-STAT-WS
535200                         PERFORM  GRAVA-ERROS
535300                      END-IF
535400                   ELSE
535500                     IF CORR-LIB-RESIDENCIAL = 'SIM'
535600                        IF VAL-IS-AUX < 100000,01
535700                           CONTINUE
535800                        ELSE
535900                           MOVE 'NAO'   TO CUMPRE-NORMA
536000                           MOVE 123338  TO COD-ERR-NORMA-WS
536100                           MOVE 10  TO  COD-IDEN-STAT-WS
536200                           PERFORM  GRAVA-ERROS
536300                        END-IF
536400                     ELSE
536500                       IF CORR-LIB-MERCEDES = 'SIM'
536600                          IF VAL-IS-AUX < 10000,01
536700                             CONTINUE
536800                          ELSE
536900                             MOVE 'NAO'   TO CUMPRE-NORMA
537000                             MOVE 124338  TO COD-ERR-NORMA-WS
537100                             MOVE 10  TO  COD-IDEN-STAT-WS
537200                             PERFORM  GRAVA-ERROS
537300                             MOVE   'NAO'  TO  LMG-WS
537400                          END-IF
537500                       ELSE
537600                         IF CORR-LIB-AON-HOLD = 'SIM' OR
537700                            CORR-LIB-AON-HOLD-SP = 'SIM'
537800                           IF VAL-IS-AUX < 20000,01
537900                              CONTINUE
538000                           ELSE
538100                              MOVE 'NAO'   TO CUMPRE-NORMA
538200                              MOVE 124338  TO COD-ERR-NORMA-WS
538300                              MOVE 10  TO  COD-IDEN-STAT-WS
538400                              PERFORM  GRAVA-ERROS
538500                              MOVE   'NAO'  TO  LMG-WS
538600                           END-IF
538700                        ELSE
538800                         IF CORR-LIB-VOLKS-RES = 'SIM'
538900                            IF VAL-IS-AUX < 10000,01 AND
539000                               COD-TARIF-S01U034 > 969
539100                               CONTINUE
539200                            ELSE
539300                               MOVE 'NAO'   TO CUMPRE-NORMA
539400                               MOVE 124338  TO COD-ERR-NORMA-WS
539500                               MOVE 10  TO  COD-IDEN-STAT-WS
539600                               PERFORM  GRAVA-ERROS
539700                               MOVE   'NAO'  TO  LMG-WS
539800                            END-IF
539900                         ELSE
540000                            IF CORR-LIB-LAZAM = 'SIM'
540100                               IF VAL-IS-AUX < 100000,01 AND
540200                                  COD-TARIF-S01U034 > 981
540300                                  CONTINUE
540400                               ELSE
540500                                  MOVE 'NAO'   TO CUMPRE-NORMA
540600                                  MOVE 123338  TO COD-ERR-NORMA-WS
540700                                  MOVE 10  TO  COD-IDEN-STAT-WS
540800                                  PERFORM  GRAVA-ERROS
540900                                  MOVE   'NAO'  TO  LMG-WS
541000                               END-IF
541100                            ELSE
541200                               MOVE 'NAO'   TO CUMPRE-NORMA
541300                               MOVE 123338  TO COD-ERR-NORMA-WS
541400                               MOVE 10  TO  COD-IDEN-STAT-WS
541500                               PERFORM  GRAVA-ERROS
541600                            END-IF
541700                        END-IF
541800                     END-IF
541900                    END-IF
542000                   END-IF
542100                 END-IF
542200               END-IF
542300           END-IF
542400
542500           IF  TAB-COD-COBERT-WS(IND-WS) = '0028'
542600               COMPUTE VAL-IS-CALC-COBERT ROUNDED =
542700                    (VAL-IS-COBERT-BAS * 10) / 100
542800               IF (CORR-LIB-RESIDENCIAL = 'SIM') OR
542900                  (CORR-LIB-MARINE = 'SIM') OR
543000*** 1200004 - TARIFA 1028 E 1029 JANEIRO 2012
543100                  (COD-TARIF-S01U034 > 1027 AND
543200                   COD-CORR-CTRL = 453399)
543300                  IF  VAL-IS-AUX <= VAL-IS-CALC-COBERT
543400                      CONTINUE
543500                  ELSE
543600                      MOVE 'NAO'   TO CUMPRE-NORMA
543700                      MOVE 123339  TO COD-ERR-NORMA-WS
543800                      MOVE 10  TO  COD-IDEN-STAT-WS
543900                      PERFORM  GRAVA-ERROS
544000                  END-IF
544100               ELSE
544200                  IF CORR-LIB-MERCEDES = 'SIM'
544300                     IF VAL-IS-AUX <= VAL-IS-CALC-COBERT
544400                        CONTINUE
544500                     ELSE
544600                        MOVE 'NAO'   TO CUMPRE-NORMA
544700                        MOVE 124339  TO COD-ERR-NORMA-WS
544800                        MOVE 10  TO  COD-IDEN-STAT-WS
544900                        PERFORM  GRAVA-ERROS
545000                        MOVE   'NAO'  TO  LMG-WS
545100                     END-IF
545200                  ELSE
545300                    IF CORR-LIB-VOLKS-RES = 'SIM'
545400                       IF VAL-IS-AUX < 20000,01 AND
545500                          COD-TARIF-S01U034 > 969
545600                          CONTINUE
545700                       ELSE
545800                          MOVE 'NAO'   TO CUMPRE-NORMA
545900                          MOVE 124339  TO COD-ERR-NORMA-WS
546000                          MOVE 10  TO  COD-IDEN-STAT-WS
546100                          PERFORM  GRAVA-ERROS
546200                          MOVE   'NAO'  TO  LMG-WS
546300                       END-IF
546400                   ELSE
546500**FICHA 0901910 -  PONTO CORRETORA - THAIS
546600                     IF COD-CORR-CTRL = 0672501
546700                       IF VAL-IS-AUX < 5000,01 AND
546800                          COD-TARIF-S01U034 > 977
546900                          CONTINUE
547000                       ELSE
547100                          MOVE 'NAO'   TO CUMPRE-NORMA
547200                          MOVE 124339  TO COD-ERR-NORMA-WS
547300                          MOVE 10  TO  COD-IDEN-STAT-WS
547400                          PERFORM  GRAVA-ERROS
547500                          MOVE   'NAO'  TO  LMG-WS
547600                       END-IF
547700                     ELSE
547800                       IF CORR-LIB-LAZAM = 'SIM'
547900                          IF VAL-IS-AUX <= VAL-IS-CALC-COBERT AND
548000                             COD-TARIF-S01U034 > 981
548100                             CONTINUE
548200                          ELSE
548300                             MOVE 'NAO'   TO CUMPRE-NORMA
548400                             MOVE 123339  TO COD-ERR-NORMA-WS
548500                             MOVE 10  TO  COD-IDEN-STAT-WS
548600                             PERFORM  GRAVA-ERROS
548700                             MOVE   'NAO'  TO  LMG-WS
548800                          END-IF
548900                       ELSE
549000                          MOVE 'NAO'   TO CUMPRE-NORMA
549100                          MOVE 123339  TO COD-ERR-NORMA-WS
549200                          MOVE 10  TO  COD-IDEN-STAT-WS
549300                          PERFORM  GRAVA-ERROS
549400                       END-IF
549500                     END-IF
549600                   END-IF
549700                 END-IF
549800              END-IF
549900           END-IF
550000
550100           IF  TAB-COD-COBERT-WS(IND-WS) = '0029'
550200               IF COD-TARIF-S01U034 > 995
550300                  PERFORM 0029-00-AJUSTE-PONTUAL
550400               ELSE
550500                  PERFORM 0029-00-AJUSTE-PONTUAL-ANTES
550600               END-IF
550700           END-IF
550800
550900           IF COD-TARIF-S01U034 < 996
551000              IF  TAB-COD-COBERT-WS(IND-WS) = '0030'
551100                  IF CORR-LIB-MARINE = 'SIM'
551200                     IF VAL-IS-AUX < 10000,01
551300                        CONTINUE
551400                     ELSE
551500                        MOVE 'NAO'   TO CUMPRE-NORMA
551600                        MOVE 123342  TO COD-ERR-NORMA-WS
551700                        MOVE 10  TO  COD-IDEN-STAT-WS
551800                        PERFORM  GRAVA-ERROS
551900                     END-IF
552000                  ELSE
552100                     IF CORR-LIB-RESIDENCIAL = 'SIM'
552200                        IF VAL-IS-AUX < 100000,01
552300                           CONTINUE
552400                        ELSE
552500                           MOVE 'NAO'   TO CUMPRE-NORMA
552600                           MOVE 123342  TO COD-ERR-NORMA-WS
552700                           MOVE 10  TO  COD-IDEN-STAT-WS
552800                           PERFORM  GRAVA-ERROS
552900                        END-IF
553000                     ELSE
553100                       IF CORR-LIB-MERCEDES = 'SIM'
553200                          IF VAL-IS-AUX < 10000,01
553300                             CONTINUE
553400                          ELSE
553500                             MOVE 'NAO'   TO CUMPRE-NORMA
553600                             MOVE 124342  TO COD-ERR-NORMA-WS
553700                             MOVE 10  TO  COD-IDEN-STAT-WS
553800                             PERFORM  GRAVA-ERROS
553900                             MOVE   'NAO'  TO  LMG-WS
554000                          END-IF
554100                       ELSE
554200                         IF CORR-LIB-AON-HOLD = 'SIM' OR
554300                            CORR-LIB-AON-HOLD-SP = 'SIM'
554400                            IF VAL-IS-AUX < 20000,01
554500                               CONTINUE
554600                            ELSE
554700                               MOVE 'NAO'   TO CUMPRE-NORMA
554800                               MOVE 124342  TO COD-ERR-NORMA-WS
554900                               MOVE 10  TO  COD-IDEN-STAT-WS
555000                               PERFORM  GRAVA-ERROS
555100                               MOVE   'NAO'  TO  LMG-WS
555200                            END-IF
555300                         ELSE
555400                           IF CORR-LIB-VOLKS-RES = 'SIM'
555500                              IF VAL-IS-AUX < 10000,01 AND
555600                                 COD-TARIF-S01U034 > 969
555700                                 CONTINUE
555800                              ELSE
555900                                 MOVE 'NAO'   TO CUMPRE-NORMA
556000                                 MOVE 124342  TO COD-ERR-NORMA-WS
556100                                 MOVE 10  TO  COD-IDEN-STAT-WS
556200                                 PERFORM  GRAVA-ERROS
556300                                 MOVE   'NAO'  TO  LMG-WS
556400                              END-IF
556500                           ELSE
556600                             IF CORR-LIB-LAZAM = 'SIM'
556700                                IF VAL-IS-AUX < 100000,01 AND
556800                                   COD-TARIF-S01U034 > 981
556900                                   CONTINUE
557000                                ELSE
557100                                  MOVE 'NAO'   TO CUMPRE-NORMA
557200                                  MOVE 123342  TO COD-ERR-NORMA-WS
557300                                  MOVE 10  TO  COD-IDEN-STAT-WS
557400                                  PERFORM  GRAVA-ERROS
557500                                  MOVE   'NAO'  TO  LMG-WS
557600                                END-IF
557700                             ELSE
557800                                MOVE 'NAO'   TO CUMPRE-NORMA
557900                                MOVE 123342  TO COD-ERR-NORMA-WS
558000                                MOVE 10  TO  COD-IDEN-STAT-WS
558100                                PERFORM  GRAVA-ERROS
558200                             END-IF
558300                           END-IF
558400                         END-IF
558500                      END-IF
558600                   END-IF
558700                END-IF
558800              END-IF
558900           ELSE
559000              IF  TAB-COD-COBERT-WS(IND-WS) = '0030'
559100                  IF CORR-LIB-RESIDENCIAL = 'SIM' OR
559200                     CORR-LIB-MARINE = 'SIM' OR
559300                     CORR-LIB-HELLNER = 'SIM' OR
559400                     CORR-LIB-VOLKS-RES = 'SIM' OR
559500                     CORR-LIB-MERCEDES = 'SIM'
559600                     IF VAL-IS-AUX < 10000,01
559700                        CONTINUE
559800                     ELSE
559900                        MOVE 'NAO'   TO CUMPRE-NORMA
560000                        MOVE 123342  TO COD-ERR-NORMA-WS
560100                        MOVE 10  TO  COD-IDEN-STAT-WS
560200                        PERFORM  GRAVA-ERROS
560300                     END-IF
560400                  ELSE
560500                      IF CORR-LIB-AON-HOLD = 'SIM' OR
560600                         CORR-LIB-AON-HOLD-SP = 'SIM'
560700                         IF VAL-IS-AUX < 20000,01
560800                            CONTINUE
560900                         ELSE
561000                            MOVE 'NAO'   TO CUMPRE-NORMA
561100                            MOVE 124342  TO COD-ERR-NORMA-WS
561200                            MOVE 10  TO  COD-IDEN-STAT-WS
561300                            PERFORM  GRAVA-ERROS
561400                            MOVE   'NAO'  TO  LMG-WS
561500                         END-IF
561600                      ELSE
561700                          IF CORR-LIB-LAZAM = 'SIM'
561800                             IF VAL-IS-AUX < 100000,01 AND
561900                                COD-TARIF-S01U034 > 981
562000                                CONTINUE
562100                             ELSE
562200                                MOVE 'NAO'   TO CUMPRE-NORMA
562300                                MOVE 123342  TO COD-ERR-NORMA-WS
562400                                MOVE 10  TO  COD-IDEN-STAT-WS
562500                                PERFORM  GRAVA-ERROS
562600                                MOVE   'NAO'  TO  LMG-WS
562700                             END-IF
562800                          ELSE
562900                             MOVE 'NAO'   TO CUMPRE-NORMA
563000                             MOVE 123342  TO COD-ERR-NORMA-WS
563100                             MOVE 10  TO  COD-IDEN-STAT-WS
563200                             PERFORM  GRAVA-ERROS
563300                          END-IF
563400                      END-IF
563500                  END-IF
563600              END-IF
563700           END-IF
563800
563900           IF COD-TARIF-S01U034 < 996
564000               IF TAB-COD-COBERT-WS(IND-WS) = '0031'
564100                  IF CORR-LIB-MARINE = 'SIM'
564200                     IF VAL-IS-AUX < 10000,01
564300                        CONTINUE
564400                     ELSE
564500                        MOVE 'NAO'   TO CUMPRE-NORMA
564600                        MOVE 123343  TO COD-ERR-NORMA-WS
564700                        MOVE 10  TO  COD-IDEN-STAT-WS
564800                        PERFORM  GRAVA-ERROS
564900                     END-IF
565000                  ELSE
565100                     IF CORR-LIB-RESIDENCIAL = 'SIM'
565200                        IF VAL-IS-AUX < 100000,01
565300                           CONTINUE
565400                        ELSE
565500                           MOVE 'NAO'   TO CUMPRE-NORMA
565600                           MOVE 123343  TO COD-ERR-NORMA-WS
565700                           MOVE 10  TO  COD-IDEN-STAT-WS
565800                           PERFORM  GRAVA-ERROS
565900                        END-IF
566000                     ELSE
566100                       IF CORR-LIB-MERCEDES = 'SIM'
566200                          IF VAL-IS-AUX < 10000,01
566300                             CONTINUE
566400                          ELSE
566500                             MOVE 'NAO'   TO CUMPRE-NORMA
566600                             MOVE 124343  TO COD-ERR-NORMA-WS
566700                             MOVE 10  TO  COD-IDEN-STAT-WS
566800                             PERFORM  GRAVA-ERROS
566900                             MOVE   'NAO'  TO  LMG-WS
567000                          END-IF
567100                       ELSE
567200                         IF CORR-LIB-AON-HOLD = 'SIM' OR
567300                            CORR-LIB-AON-HOLD-SP = 'SIM'
567400                            IF VAL-IS-AUX < 20000,01
567500                               CONTINUE
567600                            ELSE
567700                               MOVE 'NAO'   TO CUMPRE-NORMA
567800                               MOVE 124343  TO COD-ERR-NORMA-WS
567900                               MOVE 10  TO  COD-IDEN-STAT-WS
568000                               PERFORM  GRAVA-ERROS
568100                               MOVE   'NAO'  TO  LMG-WS
568200                            END-IF
568300                         ELSE
568400                           IF CORR-LIB-VOLKS-RES = 'SIM'
568500                              IF VAL-IS-AUX < 10000,01 AND
568600                                 COD-TARIF-S01U034 > 969
568700                                 CONTINUE
568800                              ELSE
568900                                MOVE 'NAO'   TO CUMPRE-NORMA
569000                                MOVE 124343  TO COD-ERR-NORMA-WS
569100                                MOVE 10  TO  COD-IDEN-STAT-WS
569200                                PERFORM  GRAVA-ERROS
569300                                MOVE   'NAO'  TO  LMG-WS
569400                              END-IF
569500                           ELSE
569600                              MOVE 'NAO'   TO CUMPRE-NORMA
569700                              MOVE 123343  TO COD-ERR-NORMA-WS
569800                              MOVE 10  TO  COD-IDEN-STAT-WS
569900                              PERFORM  GRAVA-ERROS
570000                          END-IF
570100                        END-IF
570200                     END-IF
570300                   END-IF
570400                  END-IF
570500               END-IF
570600           ELSE
570700               IF TAB-COD-COBERT-WS(IND-WS) = '0031'
570800                  IF  CORR-LIB-RESIDENCIAL = 'SIM' OR
570900                      CORR-LIB-MARINE = 'SIM' OR
571000                      CORR-LIB-HELLNER = 'SIM' OR
571100                      CORR-LIB-VOLKS-RES = 'SIM' OR
571200                      CORR-LIB-MERCEDES = 'SIM'
571300                     IF VAL-IS-AUX < 10000,01
571400                        CONTINUE
571500                     ELSE
571600                        MOVE 'NAO'   TO CUMPRE-NORMA
571700                        MOVE 123343  TO COD-ERR-NORMA-WS
571800                        MOVE 10  TO  COD-IDEN-STAT-WS
571900                        PERFORM  GRAVA-ERROS
572000                     END-IF
572100                  ELSE
572200                      IF CORR-LIB-AON-HOLD = 'SIM' OR
572300                         CORR-LIB-AON-HOLD-SP = 'SIM'
572400                         IF VAL-IS-AUX < 20000,01
572500                            CONTINUE
572600                         ELSE
572700                            MOVE 'NAO'   TO CUMPRE-NORMA
572800                            MOVE 124343  TO COD-ERR-NORMA-WS
572900                            MOVE 10  TO  COD-IDEN-STAT-WS
573000                            PERFORM  GRAVA-ERROS
573100                            MOVE   'NAO'  TO  LMG-WS
573200                         END-IF
573300                      END-IF
573400                  END-IF
573500               END-IF
573600           END-IF
573700
573800       ADD  1     TO     IND-WS
573900     END-PERFORM.
574000
574100 113-NORMA-3-3-X.
574200
574300      MOVE 'N'   TO  COD-TIP-AUX
574400      PERFORM 130-00-COBERTURAS.
574500
574600 113-NORMA-3-4.
574700**FICHA
574800     IF   COD-RAMO = 113
574900          IF  ((COD-PRODUTO >  2000 AND COD-PRODUTO  < 2050) OR
575000               (COD-PRODUTO >  2050 AND COD-PRODUTO  < 2101) OR
575100               (COD-PRODUTO >  2110 AND COD-PRODUTO  < 9999))
575200               MOVE   'NAO'  TO  LMG-WS
575300          END-IF
575400     END-IF
575500
575600     IF   LMG-WS        =   'SIM'
575700          MOVE   80     TO   COD-IDEN-STAT-WS
575800          MOVE  123341  TO   COD-ERR-NORMA-WS
575900          PERFORM  GRAVA-ERROS
576000     END-IF.
576100
576200 113-NORMA-3-5.
576300*===================================================================
576400**  OS CRITERIOS PARA INSPECAO ESTAO SENDO TRATADOS NO PROGRAMA
576500**                          S01U027
576600*===================================================================
576700
576800 113-NORMA-3-6.
576900
577000     IF   NOT  ENDOSSO
577100          GO   TO  113-NORMA-3-7-1.
577200
577300 113-NORMA-3-6-1.
577400
577500     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   03
577600          MOVE  123361  TO   COD-ERR-NORMA-WS
577700          MOVE   80     TO   COD-IDEN-STAT-WS
577800          PERFORM  GRAVA-ERROS
577900     END-IF.
578000
578100 113-NORMA-3-6-2.
578200
578300     IF   COD-IDEN-ACES-WS  EQUAL  ZEROS
578400          MOVE   80     TO   COD-IDEN-STAT-WS
578500          MOVE  123362  TO   COD-ERR-NORMA-WS
578600          PERFORM  GRAVA-ERROS
578700     END-IF.
578800
578900 113-NORMA-3-6-3.
579000
579100     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   05
579200          MOVE  123363  TO   COD-ERR-NORMA-WS
579300          MOVE   80     TO   COD-IDEN-STAT-WS
579400          PERFORM  GRAVA-ERROS
579500     END-IF.
579600
579700     GO   TO   1300-99-PROCESSA-113.
579800
579900 113-NORMA-3-7-1.
580000
580100     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
580200       IF TIP-CUST-EMIS  NOT EQUAL   4   AND   5
580300          MOVE   80     TO   COD-IDEN-STAT-WS
580400          MOVE  123371  TO   COD-ERR-NORMA-WS
580500          PERFORM  GRAVA-ERROS
580600     END-IF.
580700
580800 113-NORMA-3-7-2.
580900
581000     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
581100       IF QTD-PARC   >  07
581200          MOVE   80     TO   COD-IDEN-STAT-WS
581300          MOVE  123372  TO   COD-ERR-NORMA-WS
581400          PERFORM  GRAVA-ERROS
581500     END-IF.
581600
581700 113-NORMA-3-7-3.
581800
581900     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
582000       IF DAT-COMPARA-WS <   365
582100          MOVE   80     TO   COD-IDEN-STAT-WS
582200          MOVE  123373  TO   COD-ERR-NORMA-WS
582300          PERFORM  GRAVA-ERROS
582400     END-IF.
582500
582600 113-NORMA-3-7-4.
582700
582800     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
582900          MOVE   80     TO   COD-IDEN-STAT-WS
583000          MOVE  123374  TO   COD-ERR-NORMA-WS
583100          PERFORM  GRAVA-ERROS
583200     END-IF.
583300
583400 113-NORMA-3-7-5.
583500
583600 113-NORMA-3-8-1.
583700
583800 113-NORMA-4-1.
583900
584000**FICHA 0701423
584100**   IF   PERC-CORR-WS   >   30,00
584200**        MOVE   10     TO   COD-IDEN-STAT-WS
584300**        MOVE  123411  TO   COD-ERR-NORMA-WS
584400**        PERFORM  GRAVA-ERROS
584500**   END-IF.
584600
584700 113-NORMA-4-2.
584800
584900      PERFORM 100-00-CLASSE-CONSTRUCAO.
585000      IF   CUMPRE-NORMA = 'NAO'
585100           MOVE      10  TO  COD-IDEN-STAT-WS
585200           MOVE  123421  TO  COD-ERR-NORMA-WS
585300           PERFORM  GRAVA-ERROS
585400      END-IF.
585500
585600 113-NORMA-4-3-1.
585700
585800      MOVE 'R'   TO  COD-TIP-AUX
585900      PERFORM 120-00-COBERTURAS.
586000
586100 113-NORMA-4-3-4.
586200
586300      MOVE 'R'   TO  COD-TIP-AUX
586400      PERFORM 130-00-COBERTURAS.
586500
586600 113-NORMA-4-3-6.
586700
586800     MOVE    'SIM'    TO    CUMPRE-NORMA
586900     MOVE     1       TO   IND-WS
587000     PERFORM  UNTIL  IND-WS > NUM-OCOR-CLAU-WS   OR
587100              COD-CLAU-WS(IND-WS) EQUAL ZEROS    OR
587200              CUMPRE-NORMA = 'NAO'
587300           IF  COD-CLAU-WS(IND-WS) = 301
587400               MOVE  123436  TO  COD-ERR-NORMA-WS
587500               MOVE  'NAO'   TO  CUMPRE-NORMA
587600           END-IF
587700           IF  COD-CLAU-WS(IND-WS) = 303
587800               MOVE  123437  TO  COD-ERR-NORMA-WS
587900               MOVE  'NAO'   TO  CUMPRE-NORMA
588000           END-IF
588100           ADD     1         TO   IND-WS
588200     END-PERFORM.
588300
588400     IF   CUMPRE-NORMA = 'NAO'
588500          MOVE   10  TO  COD-IDEN-STAT-WS
588600          PERFORM  GRAVA-ERROS
588700     END-IF.
588800
588900 113-NORMA-4-4-1.
589000     MOVE     ZEROS     TO   VAL-IS-4-4-1-10-WS
589100     MOVE     ZEROS     TO   VAL-IS-4-4-1-11-WS
589200     MOVE     1         TO   IND-WS
589300     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
589400       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
589500           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
589600           IF  TAB-COD-COBERT-WS(IND-WS) = '0011'
589700               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-1-10-WS
589800           END-IF
589900           IF  TAB-COD-COBERT-WS(IND-WS) = '0013'
590000               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-1-11-WS
590100           END-IF
590200           ADD     1         TO   IND-WS
590300     END-PERFORM
590400
590500     IF CORR-LIB-VOLKS-RES = 'SIM' AND
590600        COD-TARIF-S01U034 > 969
590700        IF   VAL-IS-4-4-1-10-WS  <  50000,01
590800             CONTINUE
590900        ELSE
591000             MOVE      10  TO  COD-IDEN-STAT-WS
591100             MOVE  123432  TO  COD-ERR-NORMA-WS
591200             PERFORM  GRAVA-ERROS
591300        END-IF
591400     ELSE
591500***FICHA 1000744
591600        IF (CORR-LIB-ENSEG = 'SIM' OR CORR-LIB-HONDA = 'SIM') AND
591700            COD-TARIF-S01U034 > 991
591800            IF   VAL-IS-4-4-1-10-WS  <  100000,01
591900                 CONTINUE
592000            ELSE
592100                 MOVE      10  TO  COD-IDEN-STAT-WS
592200                 MOVE  123432  TO  COD-ERR-NORMA-WS
592300                 PERFORM  GRAVA-ERROS
592400            END-IF
592500        ELSE
592600***     1200108 - TARIFA 1030 E 1031 FEVEREIRO 2012
592700           IF (COD-TARIF-S01U034 >= 1030) AND
592800              (COD-CLASF = '001 ') AND
592900               (COD-COMPL-CLASF = '21' OR
593000                COD-COMPL-CLASF = '22' OR
593100                COD-COMPL-CLASF = '23') AND
593200               (VAL-IS-4-4-1-10-WS < 50000,01)
593300              CONTINUE
593400           ELSE
593500              IF VAL-IS-4-4-1-10-WS  >  ZEROS
593600                 MOVE      10  TO  COD-IDEN-STAT-WS
593700                 MOVE  123432  TO  COD-ERR-NORMA-WS
593800                 PERFORM  GRAVA-ERROS
593900              END-IF
594000           END-IF
594100        END-IF
594200     END-IF
594300
594400     IF CORR-LIB-VOLKS-RES = 'SIM' AND
594500        COD-TARIF-S01U034 > 969
594600        IF   VAL-IS-4-4-1-11-WS  <  50000,01
594700             CONTINUE
594800        ELSE
594900             MOVE      10  TO  COD-IDEN-STAT-WS
595000             MOVE  123431  TO  COD-ERR-NORMA-WS
595100             PERFORM  GRAVA-ERROS
595200        END-IF
595300     ELSE
595400        IF   VAL-IS-4-4-1-11-WS  > ZEROS
595500             MOVE      10  TO  COD-IDEN-STAT-WS
595600             MOVE  123431  TO  COD-ERR-NORMA-WS
595700             PERFORM  GRAVA-ERROS
595800        END-IF
595900     END-IF.
596000
596100     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '11'
596200          PERFORM 113-CLASF-001-11.
596300     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '12'
596400          PERFORM 113-CLASF-001-12.
596500     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '13'
596600          PERFORM 113-CLASF-001-13.
596700     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '21'
596800          PERFORM 113-CLASF-001-21.
596900     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '22'
597000          PERFORM 113-CLASF-001-22.
597100     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '23'
597200          PERFORM 113-CLASF-001-23.
597300
597400     GO TO 113-NORMA-4-5.
597500
597600 113-CLASF-001-11.
597700     MOVE     ZEROS     TO   VAL-IS-4-4-1-1-WS
597800     MOVE     ZEROS     TO   VAL-IS-4-4-1-2-WS
597900     MOVE     ZEROS     TO   VAL-IS-4-4-1-3-WS
598000     MOVE     ZEROS     TO   VAL-IS-4-4-1-4-WS
598100     MOVE     ZEROS     TO   VAL-IS-4-4-1-5-WS
598200     MOVE     ZEROS     TO   VAL-IS-4-4-1-6-WS
598300     MOVE     ZEROS     TO   VAL-IS-4-4-1-7-WS
598400     MOVE     ZEROS     TO   VAL-IS-4-4-1-8-WS
598500     MOVE     ZEROS     TO   VAL-IS-4-4-1-9-WS
598600     MOVE     1         TO   IND-WS
598700     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
598800       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
598900           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
599000           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
599100               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-1-1-WS
599200               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-1-5-WS
599300           END-IF
599400           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
599500               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-1-2-WS
599600           END-IF
599700           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
599800               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-1-3-WS
599900           END-IF
600000           IF  TAB-COD-COBERT-WS(IND-WS) = '0015'
600100               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-1-4-WS
600200           END-IF
600300           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
600400               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-1-5-WS
600500           END-IF
600600           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
600700               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-1-5-WS
600800           END-IF
600900           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
601000               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-1-6-WS
601100           END-IF
601200           IF  TAB-COD-COBERT-WS(IND-WS) = '0021'
601300               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-1-7-WS
601400           END-IF
601500           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
601600               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-1-8-WS
601700           END-IF
601800           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
601900               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-1-9-WS
602000           END-IF
602100           ADD     1         TO   IND-WS
602200     END-PERFORM
602300
602400     IF   VAL-IS-4-4-1-1-WS   >   1800000,00
602500          MOVE      10  TO  COD-IDEN-STAT-WS
602600          MOVE  1234411 TO  COD-ERR-NORMA-WS
602700          PERFORM  GRAVA-ERROS
602800     END-IF
602900
603000     IF   VAL-IS-4-4-1-2-WS   >   175000,00
603100          MOVE      10  TO  COD-IDEN-STAT-WS
603200          MOVE  1234412 TO  COD-ERR-NORMA-WS
603300          PERFORM  GRAVA-ERROS
603400     END-IF
603500
603600     IF   VAL-IS-4-4-1-3-WS   >   50000,00
603700          MOVE      10  TO  COD-IDEN-STAT-WS
603800          MOVE  1234413 TO  COD-ERR-NORMA-WS
603900          PERFORM  GRAVA-ERROS
604000     END-IF
604100
604200     IF   VAL-IS-4-4-1-4-WS   >   50000,00
604300          MOVE      10  TO  COD-IDEN-STAT-WS
604400          MOVE  1234414 TO  COD-ERR-NORMA-WS
604500          PERFORM  GRAVA-ERROS
604600     END-IF
604700
604800     IF   VAL-IS-4-4-1-5-WS   >   1800000,00
604900          MOVE      10  TO  COD-IDEN-STAT-WS
605000          MOVE  1234415 TO  COD-ERR-NORMA-WS
605100          PERFORM  GRAVA-ERROS
605200     END-IF
605300
605400     IF   VAL-IS-4-4-1-6-WS   >   50000,00
605500          MOVE      10  TO  COD-IDEN-STAT-WS
605600          MOVE  1234416 TO  COD-ERR-NORMA-WS
605700          PERFORM  GRAVA-ERROS
605800     END-IF
605900
606000     IF   VAL-IS-4-4-1-7-WS   >  100000,00
606100          MOVE      10  TO  COD-IDEN-STAT-WS
606200          MOVE  1234417 TO  COD-ERR-NORMA-WS
606300          PERFORM  GRAVA-ERROS
606400     END-IF
606500
606600     IF   VAL-IS-4-4-1-8-WS   >  900000,00
606700          MOVE      10  TO  COD-IDEN-STAT-WS
606800          MOVE  1234418 TO  COD-ERR-NORMA-WS
606900          PERFORM  GRAVA-ERROS
607000     END-IF
607100
607200     IF   VAL-IS-4-4-1-9-WS   >  900000,00
607300          MOVE      10  TO  COD-IDEN-STAT-WS
607400          MOVE  1234419 TO  COD-ERR-NORMA-WS
607500          PERFORM  GRAVA-ERROS
607600     END-IF.
607700
607800 113-CLASF-001-21.
607900     MOVE     ZEROS     TO   VAL-IS-4-4-2-1-WS
608000     MOVE     ZEROS     TO   VAL-IS-4-4-2-2-WS
608100     MOVE     ZEROS     TO   VAL-IS-4-4-2-3-WS
608200     MOVE     ZEROS     TO   VAL-IS-4-4-2-4-WS
608300     MOVE     ZEROS     TO   VAL-IS-4-4-2-5-WS
608400     MOVE     ZEROS     TO   VAL-IS-4-4-2-6-WS
608500     MOVE     ZEROS     TO   VAL-IS-4-4-2-7-WS
608600     MOVE     ZEROS     TO   VAL-IS-4-4-2-8-WS
608700     MOVE     ZEROS     TO   VAL-IS-4-4-2-9-WS
608800     MOVE     1         TO   IND-WS
608900     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
609000       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
609100           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
609200           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
609300               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-2-1-WS
609400               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-2-5-WS
609500           END-IF
609600           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
609700               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-2-2-WS
609800           END-IF
609900           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
610000               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-2-3-WS
610100           END-IF
610200           IF  TAB-COD-COBERT-WS(IND-WS) = '0015'
610300               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-2-4-WS
610400           END-IF
610500           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
610600               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-2-5-WS
610700           END-IF
610800           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
610900               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-2-5-WS
611000           END-IF
611100
611200           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
611300               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-2-6-WS
611400           END-IF
611500           IF  TAB-COD-COBERT-WS(IND-WS) = '0021'
611600               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-2-7-WS
611700           END-IF
611800           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
611900               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-2-8-WS
612000           END-IF
612100           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
612200               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-2-9-WS
612300           END-IF
612400           ADD     1         TO   IND-WS
612500     END-PERFORM
612600
612700     IF   VAL-IS-4-4-2-1-WS   >   1800000,00
612800          MOVE      10  TO  COD-IDEN-STAT-WS
612900          MOVE  1234421 TO  COD-ERR-NORMA-WS
613000          PERFORM  GRAVA-ERROS
613100     END-IF
613200
613300     IF   VAL-IS-4-4-2-2-WS   >   175000,00
613400          MOVE      10  TO  COD-IDEN-STAT-WS
613500          MOVE  1234422 TO  COD-ERR-NORMA-WS
613600          PERFORM  GRAVA-ERROS
613700     END-IF
613800
613900     IF   VAL-IS-4-4-2-3-WS   >   80000,00
614000          MOVE      10  TO  COD-IDEN-STAT-WS
614100          MOVE  1234423 TO  COD-ERR-NORMA-WS
614200          PERFORM  GRAVA-ERROS
614300     END-IF
614400
614500     IF   VAL-IS-4-4-2-4-WS   >   80000,00
614600          MOVE      10  TO  COD-IDEN-STAT-WS
614700          MOVE  1234424 TO  COD-ERR-NORMA-WS
614800          PERFORM  GRAVA-ERROS
614900     END-IF
615000
615100     IF   VAL-IS-4-4-2-5-WS   >   1800000,00
615200          MOVE      10  TO  COD-IDEN-STAT-WS
615300          MOVE  1234425 TO  COD-ERR-NORMA-WS
615400          PERFORM  GRAVA-ERROS
615500     END-IF
615600
615700     IF   VAL-IS-4-4-2-6-WS   >     80000,00
615800          MOVE      10  TO  COD-IDEN-STAT-WS
615900          MOVE  1234426 TO  COD-ERR-NORMA-WS
616000          PERFORM  GRAVA-ERROS
616100     END-IF
616200
616300     IF   VAL-IS-4-4-2-7-WS   >    100000,00
616400          MOVE      10  TO  COD-IDEN-STAT-WS
616500          MOVE  1234427 TO  COD-ERR-NORMA-WS
616600          PERFORM  GRAVA-ERROS
616700     END-IF
616800
616900     IF   VAL-IS-4-4-2-8-WS   >    900000,00
617000          MOVE      10  TO  COD-IDEN-STAT-WS
617100          MOVE  1234428 TO  COD-ERR-NORMA-WS
617200          PERFORM  GRAVA-ERROS
617300     END-IF
617400
617500     IF   VAL-IS-4-4-2-9-WS   >    900000,00
617600          MOVE      10  TO  COD-IDEN-STAT-WS
617700          MOVE  1234429 TO  COD-ERR-NORMA-WS
617800          PERFORM  GRAVA-ERROS
617900     END-IF.
618000
618100 113-CLASF-001-12.
618200     MOVE     ZEROS     TO   VAL-IS-4-4-3-1-WS
618300     MOVE     ZEROS     TO   VAL-IS-4-4-3-2-WS
618400     MOVE     ZEROS     TO   VAL-IS-4-4-3-3-WS
618500     MOVE     ZEROS     TO   VAL-IS-4-4-3-4-WS
618600     MOVE     ZEROS     TO   VAL-IS-4-4-3-5-WS
618700     MOVE     ZEROS     TO   VAL-IS-4-4-3-6-WS
618800     MOVE     ZEROS     TO   VAL-IS-4-4-3-7-WS
618900     MOVE     1         TO   IND-WS
619000     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
619100       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
619200           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
619300           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
619400               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-3-1-WS
619500               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-3-4-WS
619600           END-IF
619700           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
619800               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-3-2-WS
619900           END-IF
620000           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
620100               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-3-3-WS
620200           END-IF
620300           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
620400               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-3-4-WS
620500           END-IF
620600           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
620700               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-3-4-WS
620800           END-IF
620900           IF  TAB-COD-COBERT-WS(IND-WS) = '0021'
621000               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-3-5-WS
621100           END-IF
621200           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
621300               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-3-6-WS
621400           END-IF
621500           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
621600               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-3-7-WS
621700           END-IF
621800           ADD     1         TO   IND-WS
621900     END-PERFORM
622000
622100     IF   VAL-IS-4-4-3-1-WS   >   1800000,00
622200          MOVE      10  TO  COD-IDEN-STAT-WS
622300          MOVE  1234431  TO  COD-ERR-NORMA-WS
622400          PERFORM  GRAVA-ERROS
622500     END-IF
622600
622700     IF   VAL-IS-4-4-3-2-WS   >   175000,00
622800          MOVE      10  TO  COD-IDEN-STAT-WS
622900          MOVE  1234432  TO  COD-ERR-NORMA-WS
623000          PERFORM  GRAVA-ERROS
623100     END-IF
623200
623300     IF   VAL-IS-4-4-3-3-WS   >   50000,00
623400          MOVE      10  TO  COD-IDEN-STAT-WS
623500          MOVE  1234433 TO  COD-ERR-NORMA-WS
623600          PERFORM  GRAVA-ERROS
623700     END-IF
623800
623900     IF   VAL-IS-4-4-3-4-WS   >   1800000,00
624000          MOVE      10  TO  COD-IDEN-STAT-WS
624100          MOVE  1234434 TO  COD-ERR-NORMA-WS
624200          PERFORM  GRAVA-ERROS
624300     END-IF
624400
624500     IF   VAL-IS-4-4-3-5-WS   >    100000,00
624600          MOVE      10  TO  COD-IDEN-STAT-WS
624700          MOVE  1234435 TO  COD-ERR-NORMA-WS
624800          PERFORM  GRAVA-ERROS
624900     END-IF
625000
625100     IF   VAL-IS-4-4-3-6-WS   >    900000,00
625200          MOVE      10  TO  COD-IDEN-STAT-WS
625300          MOVE  1234436 TO  COD-ERR-NORMA-WS
625400          PERFORM  GRAVA-ERROS
625500     END-IF
625600
625700     IF   VAL-IS-4-4-3-7-WS   >    900000,00
625800          MOVE      10  TO  COD-IDEN-STAT-WS
625900          MOVE  1234437 TO  COD-ERR-NORMA-WS
626000          PERFORM  GRAVA-ERROS
626100     END-IF.
626200
626300 113-CLASF-001-22.
626400     MOVE     ZEROS     TO   VAL-IS-4-4-4-1-WS
626500     MOVE     ZEROS     TO   VAL-IS-4-4-4-2-WS
626600     MOVE     ZEROS     TO   VAL-IS-4-4-4-3-WS
626700     MOVE     ZEROS     TO   VAL-IS-4-4-4-4-WS
626800     MOVE     ZEROS     TO   VAL-IS-4-4-4-5-WS
626900     MOVE     ZEROS     TO   VAL-IS-4-4-4-6-WS
627000     MOVE     ZEROS     TO   VAL-IS-4-4-4-7-WS
627100     MOVE     1         TO   IND-WS
627200     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
627300       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
627400           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
627500           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
627600               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-4-1-WS
627700               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-4-4-WS
627800           END-IF
627900           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
628000               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-4-2-WS
628100           END-IF
628200           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
628300               MOVE VAL-IS-AUX  TO   VAL-IS-4-4-4-3-WS
628400           END-IF
628500           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
628600               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-4-4-WS
628700           END-IF
628800           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
628900               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-4-4-WS
629000           END-IF
629100
629200           IF  TAB-COD-COBERT-WS(IND-WS) = '0021'
629300               ADD  VAL-IS-AUX  TO  VAL-IS-4-4-4-5-WS
629400           END-IF
629500           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
629600               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-4-6-WS
629700           END-IF
629800           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
629900               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-4-7-WS
630000           END-IF
630100           ADD     1         TO   IND-WS
630200     END-PERFORM
630300
630400     IF   VAL-IS-4-4-4-1-WS   >   1800000,00
630500          MOVE      10  TO  COD-IDEN-STAT-WS
630600          MOVE  1234441 TO  COD-ERR-NORMA-WS
630700          PERFORM  GRAVA-ERROS
630800     END-IF
630900
631000     IF   VAL-IS-4-4-4-2-WS   >   175000,00
631100          MOVE      10  TO  COD-IDEN-STAT-WS
631200          MOVE  1234442 TO  COD-ERR-NORMA-WS
631300          PERFORM  GRAVA-ERROS
631400     END-IF
631500
631600     IF   VAL-IS-4-4-4-3-WS   >   80000,00
631700          MOVE      10  TO  COD-IDEN-STAT-WS
631800          MOVE  1234443 TO  COD-ERR-NORMA-WS
631900          PERFORM  GRAVA-ERROS
632000     END-IF
632100
632200     IF   VAL-IS-4-4-4-4-WS   >   1800000,00
632300          MOVE      10  TO  COD-IDEN-STAT-WS
632400          MOVE  1234444 TO  COD-ERR-NORMA-WS
632500          PERFORM  GRAVA-ERROS
632600     END-IF
632700
632800     IF   VAL-IS-4-4-4-5-WS   >    100000,00
632900          MOVE      10  TO  COD-IDEN-STAT-WS
633000          MOVE  1234445 TO  COD-ERR-NORMA-WS
633100          PERFORM  GRAVA-ERROS
633200     END-IF
633300
633400     IF   VAL-IS-4-4-4-6-WS   >    900000,00
633500          MOVE      10  TO  COD-IDEN-STAT-WS
633600          MOVE  1234446 TO  COD-ERR-NORMA-WS
633700          PERFORM  GRAVA-ERROS
633800     END-IF
633900
634000     IF   VAL-IS-4-4-4-7-WS   >    900000,00
634100          MOVE      10  TO  COD-IDEN-STAT-WS
634200          MOVE  1234447 TO  COD-ERR-NORMA-WS
634300          PERFORM  GRAVA-ERROS
634400     END-IF.
634500
634600 113-CLASF-001-13.
634700     MOVE     ZEROS     TO   VAL-IS-4-4-5-1-WS
634800     MOVE     1         TO   IND-WS
634900     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
635000       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
635100           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
635200           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
635300               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-5-1-WS
635400           END-IF
635500           ADD     1         TO   IND-WS
635600     END-PERFORM
635700
635800     IF   VAL-IS-4-4-5-1-WS   >   1800000,00
635900          MOVE      10  TO  COD-IDEN-STAT-WS
636000          MOVE  1234451 TO  COD-ERR-NORMA-WS
636100          PERFORM  GRAVA-ERROS
636200     END-IF.
636300
636400 113-CLASF-001-23.
636500     MOVE     ZEROS     TO   VAL-IS-4-4-6-1-WS
636600     MOVE     1         TO   IND-WS
636700     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
636800       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
636900           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
637000           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
637100               MOVE VAL-IS-AUX  TO  VAL-IS-4-4-6-1-WS
637200           END-IF
637300       ADD     1         TO   IND-WS
637400     END-PERFORM
637500
637600     IF   VAL-IS-4-4-6-1-WS   >   1800000,00
637700          MOVE      10  TO  COD-IDEN-STAT-WS
637800          MOVE  1234461 TO  COD-ERR-NORMA-WS
637900          PERFORM  GRAVA-ERROS
638000     END-IF.
638100
638200 113-NORMA-4-5.
638300
638400     IF  NOT  RENOVA
638500         GO  TO  113-NORMA-4-5-F.
638600
638700     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
638800         GO  TO  113-NORMA-4-5-F.
638900
639000*    1200089 - RENOVACOES COM SINISTRO
639100*    PERFORM   200-00-BUSCA-RENOV
639200*    IF   QTD-RENOV-SIN NOT = ZEROS
639300*          MOVE      10  TO  COD-IDEN-STAT-WS
639400*          MOVE  123451  TO  COD-ERR-NORMA-WS
639500*          PERFORM  GRAVA-ERROS
639600*    END-IF.
639700
639800 113-NORMA-4-5-F.
639900
640000 113-NORMA-4-6.
640100
640200     MOVE    'SIM'    TO    CUMPRE-NORMA
640300     MOVE     1       TO   IND-WS
640400     PERFORM  UNTIL  IND-WS  >  NUM-OCOR-COBERT-WS    OR
640500            TAB-COD-COBERT-WS(IND-WS)  EQUAL ZEROS    OR
640600            CUMPRE-NORMA = 'NAO'
640700            IF  TAB-PER-DESC-COML-WS-R(IND-WS)  >  PERC-DSC-CML-WS
640800                MOVE       'NAO'    TO       CUMPRE-NORMA
640900            END-IF
641000        ADD     1         TO   IND-WS
641100     END-PERFORM.
641200
641300     IF   CUMPRE-NORMA = 'NAO'
641400          MOVE   10     TO  COD-IDEN-STAT-WS
641500          MOVE  123461  TO  COD-ERR-NORMA-WS
641600          PERFORM  GRAVA-ERROS
641700     END-IF.
641800
641900 113-NORMA-4-7.
642000**==================================================================
642100**         DESCONSIDERADO CONFORME E-MAIL SHIBA 27/07/2007
642200**==================================================================
642300
642400 113-NOTA-2.
642500
642600 1300-99-PROCESSA-113.
642700     EXIT.
642800
642900*=======================================*
643000 1400-00-PROCESSA-114 SECTION.
643100*=======================================*
643200 1400-01-PROCESSA-114.
643300
643400      IF  ENDOSSO
643500          GO   TO  114-NORMA-3-6.
643600
643700 114-NORMA-1-4-1.
643800
643900      PERFORM 160-00-INSPECAO.
644000      IF  INSP-OBRIG-WS = 'SIM'
644100          MOVE  55   TO  COD-IDEN-STAT-WS
644200          MOVE  5224 TO  COD-ERR-NORMA-WS
644300          PERFORM  GRAVA-ERROS
644400      END-IF.
644500
644600 114-NORMA-1-4-2.
644700
644800     IF  NOT  RENOVA
644900         GO  TO  114-NORMA-3-1.
645000
645100     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
645200         GO  TO  114-NORMA-3-1.
645300
645400     PERFORM   200-00-BUSCA-RENOV
645500     IF   QTD-RENOV-SIN NOT = ZEROS
645600          PERFORM 065-00-CARREGA-TAB-COB-SIN
645700          PERFORM 170-00-INSPECAO-SIN
645800          IF  INSP-OBRIG-WS = 'SIM'
645900              MOVE  55   TO  COD-IDEN-STAT-WS
646000              MOVE  5224 TO  COD-ERR-NORMA-WS
646100              PERFORM  GRAVA-ERROS
646200          END-IF
646300     END-IF.
646400
646500 114-NORMA-3-1.
646600
646700**FICHA 0701423
646800**   IF   PERC-CORR-WS   >   60,00
646900**        MOVE   80     TO   COD-IDEN-STAT-WS
647000**        MOVE  124311  TO   COD-ERR-NORMA-WS
647100**        PERFORM  GRAVA-ERROS
647200**   END-IF.
647300
647400 114-NORMA-3-2.
647500
647600     PERFORM 100-00-CLASSE-CONSTRUCAO.
647700     IF   CUMPRE-NORMA   =  'NAO'
647800          MOVE   80     TO   COD-IDEN-STAT-WS
647900          MOVE  124321  TO   COD-ERR-NORMA-WS
648000          PERFORM  GRAVA-ERROS
648100      END-IF.
648200
648300 114-NORMA-3-3.
648400
648500      MOVE 'N'   TO  COD-TIP-AUX
648600      PERFORM 130-00-COBERTURAS.
648700
648800 114-NORMA-3-4.
648900
649000     IF   LMG-WS         =  'SIM'
649100          MOVE   80     TO   COD-IDEN-STAT-WS
649200          MOVE  124341  TO   COD-ERR-NORMA-WS
649300          PERFORM  GRAVA-ERROS
649400     END-IF.
649500
649600 114-NORMA-3-5.
649700
649800*===================================================================
649900**  OS CRITERIOS PARA INSPECAO ESTAO SENDO TRATADOS NO PROGRAMA
650000**                          S01U027
650100*===================================================================
650200
650300 114-NORMA-3-6.
650400
650500     IF   NOT  ENDOSSO
650600          GO   TO  114-NORMA-3-7-1.
650700
650800 114-NORMA-3-6-1.
650900
651000     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   03
651100          MOVE  124361  TO   COD-ERR-NORMA-WS
651200          MOVE   80     TO   COD-IDEN-STAT-WS
651300          PERFORM  GRAVA-ERROS
651400     END-IF.
651500
651600 114-NORMA-3-6-2.
651700
651800     IF   COD-IDEN-ACES-WS  EQUAL  ZEROS
651900          MOVE   80     TO   COD-IDEN-STAT-WS
652000          MOVE  124362  TO   COD-ERR-NORMA-WS
652100          PERFORM  GRAVA-ERROS
652200     END-IF.
652300
652400 114-NORMA-3-6-3.
652500
652600     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   05
652700          MOVE  124363  TO   COD-ERR-NORMA-WS
652800          MOVE   80     TO   COD-IDEN-STAT-WS
652900          PERFORM  GRAVA-ERROS
653000     END-IF.
653100
653200     GO   TO   1400-99-PROCESSA-114.
653300
653400 114-NORMA-3-7-1.
653500
653600     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
653700       IF TIP-CUST-EMIS  NOT EQUAL   4   AND   5
653800          MOVE   80     TO   COD-IDEN-STAT-WS
653900          MOVE  124371  TO   COD-ERR-NORMA-WS
654000          PERFORM  GRAVA-ERROS
654100     END-IF.
654200
654300 114-NORMA-3-7-2.
654400
654500     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
654600       IF QTD-PARC   >  07
654700          MOVE   80     TO   COD-IDEN-STAT-WS
654800          MOVE  124372  TO   COD-ERR-NORMA-WS
654900          PERFORM  GRAVA-ERROS
655000     END-IF.
655100
655200 114-NORMA-3-7-3.
655300
655400     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
655500       IF DAT-COMPARA-WS <   365
655600          MOVE   80     TO   COD-IDEN-STAT-WS
655700          MOVE  124373  TO   COD-ERR-NORMA-WS
655800          PERFORM  GRAVA-ERROS
655900     END-IF.
656000
656100 114-NORMA-3-7-4.
656200
656300     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
656400          MOVE   80     TO   COD-IDEN-STAT-WS
656500          MOVE  124374  TO   COD-ERR-NORMA-WS
656600          PERFORM  GRAVA-ERROS
656700     END-IF.
656800
656900 114-NORMA-3-7-5.
657000
657100 114-NORMA-3-8-1.
657200
657300 114-NORMA-4-1.
657400
657500**FICHA 0701423
657600**   IF   PERC-CORR-WS   >   30,00
657700**        MOVE   10     TO   COD-IDEN-STAT-WS
657800**        MOVE  124411  TO   COD-ERR-NORMA-WS
657900**        PERFORM  GRAVA-ERROS
658000**   END-IF.
658100
658200 114-NORMA-4-2.
658300
658400     MOVE 'R'   TO  COD-TIP-AUX
658500     PERFORM 120-00-COBERTURAS.
658600
658700 114-NORMA-4-3-1.
658800     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '11'
658900     MOVE     ZEROS     TO   VAL-IS-4-3-1-1-WS
659000     MOVE     ZEROS     TO   VAL-IS-4-3-1-2-WS
659100     MOVE     ZEROS     TO   VAL-IS-4-3-1-3-WS
659200     MOVE     ZEROS     TO   VAL-IS-4-3-1-4-WS
659300     MOVE     ZEROS     TO   VAL-IS-4-3-1-5-WS
659400     MOVE     ZEROS     TO   VAL-IS-4-3-1-6-WS
659500     MOVE     ZEROS     TO   VAL-IS-4-3-1-7-WS
659600     MOVE     ZEROS     TO   VAL-IS-4-3-1-8-WS
659700     MOVE     ZEROS     TO   VAL-IS-4-3-1-9-WS
659800     MOVE     ZEROS     TO   VAL-IS-4-3-1-1-0-WS
659900     MOVE     1         TO   IND-WS
660000     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
660100       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
660200           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
660300           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
660400               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-1-1-WS
660500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-6-WS
660600           END-IF
660700           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
660800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-2-WS
660900           END-IF
661000           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
661100               MOVE VAL-IS-AUX  TO   VAL-IS-4-3-1-3-WS
661200               ADD  VAL-IS-AUX  TO   VAL-IS-4-3-1-7-WS
661300           END-IF
661400           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
661500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-6-WS
661600           END-IF
661700           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
661800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-5-WS
661900               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-6-WS
662000           END-IF
662100           IF  TAB-COD-COBERT-WS(IND-WS) = '0007'
662200               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-5-WS
662300               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-6-WS
662400           END-IF
662500           IF  TAB-COD-COBERT-WS(IND-WS) = '0008'
662600               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-5-WS
662700               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-6-WS
662800           END-IF
662900           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
663000               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-5-WS
663100               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-6-WS
663200           END-IF
663300           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
663400               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-5-WS
663500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-6-WS
663600           END-IF
663700           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
663800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-1-6-WS
663900           END-IF
664000           IF  TAB-COD-COBERT-WS(IND-WS) = '0024'
664100               MOVE VAL-IS-AUX  TO   VAL-IS-4-3-1-4-WS
664200               ADD  VAL-IS-AUX  TO   VAL-IS-4-3-1-7-WS
664300           END-IF
664400           IF  TAB-COD-COBERT-WS(IND-WS) = '0002'
664500               MOVE VAL-IS-AUX  TO   VAL-IS-4-3-1-8-WS
664600           END-IF
664700           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
664800               MOVE VAL-IS-AUX  TO   VAL-IS-4-3-1-9-WS
664900           END-IF
665000           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
665100               MOVE VAL-IS-AUX  TO   VAL-IS-4-3-1-1-0-WS
665200           END-IF
665300           ADD     1         TO   IND-WS
665400     END-PERFORM
665500
665600     IF COD-TARIF-S01U034 >= 952
665700       IF COD-CORR-CTRL EQUAL 0257307 OR 0358307 OR 0282507 OR
665800                               0331007 OR 0632007
665900         MOVE 20000000,00    TO VAL-IS-COMPARAR
666000       ELSE
666100          MOVE 15000000,00    TO VAL-IS-COMPARAR
666200        END-IF
666300     ELSE
666400        MOVE  15000000,00     TO VAL-IS-COMPARAR
666500     END-IF
666600     IF   VAL-IS-4-3-1-1-WS   >   VAL-IS-COMPARAR
666700          MOVE      10  TO  COD-IDEN-STAT-WS
666800          MOVE  1244311 TO  COD-ERR-NORMA-WS
666900          PERFORM  GRAVA-ERROS
667000     END-IF
667100
667200     IF   VAL-IS-4-3-1-2-WS   >   175000,00
667300          MOVE      10  TO  COD-IDEN-STAT-WS
667400          MOVE  1244312 TO  COD-ERR-NORMA-WS
667500          PERFORM  GRAVA-ERROS
667600     END-IF
667700
667800     IF   VAL-IS-4-3-1-3-WS   >   375000,00
667900          MOVE      10  TO  COD-IDEN-STAT-WS
668000          MOVE  1244313 TO  COD-ERR-NORMA-WS
668100          PERFORM  GRAVA-ERROS
668200     END-IF
668300
668400     IF   VAL-IS-4-3-1-4-WS   >   125000,00
668500          MOVE      10  TO  COD-IDEN-STAT-WS
668600          MOVE  1244314 TO  COD-ERR-NORMA-WS
668700          PERFORM  GRAVA-ERROS
668800     END-IF
668900
669000     IF   VAL-IS-4-3-1-5-WS   >   2500000,00
669100          MOVE      10  TO  COD-IDEN-STAT-WS
669200          MOVE  1244315 TO  COD-ERR-NORMA-WS
669300          PERFORM  GRAVA-ERROS
669400     END-IF
669500
669600     IF   VAL-IS-4-3-1-6-WS   >   VAL-IS-COMPARAR
669700          MOVE      10  TO  COD-IDEN-STAT-WS
669800          MOVE  1244316 TO  COD-ERR-NORMA-WS
669900          PERFORM  GRAVA-ERROS
670000     END-IF
670100
670200     IF   VAL-IS-4-3-1-7-WS   >   375000,00
670300          MOVE      10  TO  COD-IDEN-STAT-WS
670400          MOVE  1244317 TO  COD-ERR-NORMA-WS
670500          PERFORM  GRAVA-ERROS
670600     END-IF.
670700
670800     IF   VAL-IS-4-3-1-8-WS   >  1500000,00
670900          MOVE      10  TO  COD-IDEN-STAT-WS
671000          MOVE  1244318 TO  COD-ERR-NORMA-WS
671100          PERFORM  GRAVA-ERROS
671200     END-IF.
671300
671400     IF   VAL-IS-4-3-1-9-WS   >  1000000,00
671500          MOVE      10  TO  COD-IDEN-STAT-WS
671600          MOVE  1244319 TO  COD-ERR-NORMA-WS
671700          PERFORM  GRAVA-ERROS
671800     END-IF.
671900
672000     IF   VAL-IS-4-3-1-1-0-WS   >  4500000,00
672100          MOVE      10   TO  COD-IDEN-STAT-WS
672200          MOVE  12443110 TO  COD-ERR-NORMA-WS
672300          PERFORM  GRAVA-ERROS
672400     END-IF.
672500
672600 114-NORMA-4-3-2.
672700     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '12'
672800     MOVE     ZEROS     TO   VAL-IS-4-3-2-1-WS
672900     MOVE     ZEROS     TO   VAL-IS-4-3-2-2-WS
673000     MOVE     ZEROS     TO   VAL-IS-4-3-2-3-WS
673100     MOVE     ZEROS     TO   VAL-IS-4-3-2-4-WS
673200     MOVE     ZEROS     TO   VAL-IS-4-3-2-5-WS
673300     MOVE     ZEROS     TO   VAL-IS-4-3-2-6-WS
673400     MOVE     1         TO   IND-WS
673500     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
673600       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
673700           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
673800           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
673900               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-2-1-WS
674000               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-5-WS
674100           END-IF
674200           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
674300               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-2-WS
674400           END-IF
674500           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
674600               MOVE VAL-IS-AUX  TO   VAL-IS-4-3-2-3-WS
674700           END-IF
674800           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
674900               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-4-WS
675000               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-5-WS
675100           END-IF
675200           IF  TAB-COD-COBERT-WS(IND-WS) = '0007'
675300               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-4-WS
675400               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-5-WS
675500           END-IF
675600           IF  TAB-COD-COBERT-WS(IND-WS) = '0008'
675700               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-4-WS
675800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-5-WS
675900           END-IF
676000           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
676100               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-4-WS
676200               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-5-WS
676300           END-IF
676400           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
676500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-4-WS
676600               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-2-5-WS
676700           END-IF
676800           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
676900               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-2-6-WS
677000           END-IF
677100           ADD     1         TO   IND-WS
677200     END-PERFORM
677300
677400     IF COD-TARIF-S01U034 >= 952
677500        IF COD-CORR-CTRL EQUAL 0257307 OR 0358307 OR 0282507 OR
677600                               0331007 OR 0632007
677700          MOVE 20000000,00    TO VAL-IS-COMPARAR
677800        ELSE
677900          MOVE 15000000,00    TO VAL-IS-COMPARAR
678000        END-IF
678100     ELSE
678200        MOVE  15000000,00     TO VAL-IS-COMPARAR
678300     END-IF
678400     IF   VAL-IS-4-3-2-1-WS   >   VAL-IS-COMPARAR
678500          MOVE      10  TO  COD-IDEN-STAT-WS
678600          MOVE  1244321 TO  COD-ERR-NORMA-WS
678700          PERFORM  GRAVA-ERROS
678800     END-IF
678900
679000     IF   VAL-IS-4-3-2-2-WS   >   175000,00
679100          MOVE      10  TO  COD-IDEN-STAT-WS
679200          MOVE  1244322 TO  COD-ERR-NORMA-WS
679300          PERFORM  GRAVA-ERROS
679400     END-IF
679500
679600     IF   VAL-IS-4-3-2-3-WS   >   375000,00
679700          MOVE      10  TO  COD-IDEN-STAT-WS
679800          MOVE  1244323 TO  COD-ERR-NORMA-WS
679900          PERFORM  GRAVA-ERROS
680000     END-IF
680100
680200     IF   VAL-IS-4-3-2-4-WS   >   2500000,00
680300          MOVE      10  TO  COD-IDEN-STAT-WS
680400          MOVE  1244324 TO  COD-ERR-NORMA-WS
680500          PERFORM  GRAVA-ERROS
680600     END-IF
680700
680800     IF   VAL-IS-4-3-2-5-WS   >   VAL-IS-COMPARAR
680900          MOVE      10  TO  COD-IDEN-STAT-WS
681000          MOVE  1244325 TO  COD-ERR-NORMA-WS
681100          PERFORM  GRAVA-ERROS
681200     END-IF.
681300
681400     IF   VAL-IS-4-3-2-6-WS   >   1000000,00
681500          MOVE      10  TO  COD-IDEN-STAT-WS
681600          MOVE  1244326 TO  COD-ERR-NORMA-WS
681700          PERFORM  GRAVA-ERROS
681800     END-IF.
681900
682000 114-NORMA-4-3-3.
682100     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '13'
682200     MOVE     ZEROS     TO   VAL-IS-4-3-3-1-WS
682300     MOVE     ZEROS     TO   VAL-IS-4-3-3-2-WS
682400     MOVE     ZEROS     TO   VAL-IS-4-3-3-3-WS
682500     MOVE     ZEROS     TO   VAL-IS-4-3-3-4-WS
682600     MOVE     ZEROS     TO   VAL-IS-4-3-3-5-WS
682700     MOVE     ZEROS     TO   VAL-IS-4-3-3-6-WS
682800     MOVE     ZEROS     TO   VAL-IS-4-3-3-7-WS
682900     MOVE     1         TO   IND-WS
683000     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
683100       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
683200           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
683300           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
683400               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-3-1-WS
683500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-5-WS
683600           END-IF
683700           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
683800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-2-WS
683900           END-IF
684000           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
684100               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-3-3-WS
684200           END-IF
684300           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
684400               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-4-WS
684500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-5-WS
684600           END-IF
684700           IF  TAB-COD-COBERT-WS(IND-WS) = '0007'
684800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-4-WS
684900               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-5-WS
685000           END-IF
685100           IF  TAB-COD-COBERT-WS(IND-WS) = '0008'
685200               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-4-WS
685300               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-5-WS
685400           END-IF
685500           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
685600               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-4-WS
685700               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-5-WS
685800           END-IF
685900           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
686000               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-4-WS
686100               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-3-5-WS
686200           END-IF
686300           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
686400               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-3-6-WS
686500           END-IF
686600           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
686700               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-3-7-WS
686800           END-IF
686900           ADD     1         TO   IND-WS
687000     END-PERFORM
687100
687200     IF COD-TARIF-S01U034 >= 952
687300        IF COD-CORR-CTRL EQUAL 0257307 OR 0358307 OR 0282507 OR
687400                               0331007 OR 0632007
687500          MOVE 20000000,00    TO VAL-IS-COMPARAR
687600        ELSE
687700          MOVE 5000000,00     TO VAL-IS-COMPARAR
687800        END-IF
687900     ELSE
688000        MOVE 5000000,00       TO VAL-IS-COMPARAR
688100     END-IF
688200     IF   VAL-IS-4-3-3-1-WS   >   VAL-IS-COMPARAR
688300          MOVE      10  TO  COD-IDEN-STAT-WS
688400          MOVE  1244331 TO  COD-ERR-NORMA-WS
688500          PERFORM  GRAVA-ERROS
688600     END-IF
688700
688800     IF   VAL-IS-4-3-3-2-WS   >   175000,00
688900          MOVE      10  TO  COD-IDEN-STAT-WS
689000          MOVE  1244332 TO  COD-ERR-NORMA-WS
689100          PERFORM  GRAVA-ERROS
689200     END-IF
689300
689400     IF   VAL-IS-4-3-3-3-WS   >   375000,00
689500          MOVE      10  TO  COD-IDEN-STAT-WS
689600          MOVE  1244333 TO  COD-ERR-NORMA-WS
689700          PERFORM  GRAVA-ERROS
689800     END-IF
689900
690000     IF   VAL-IS-4-3-3-4-WS   >   2500000,00
690100          MOVE      10  TO  COD-IDEN-STAT-WS
690200          MOVE  1244334 TO  COD-ERR-NORMA-WS
690300          PERFORM  GRAVA-ERROS
690400     END-IF
690500
690600     IF   VAL-IS-4-3-3-5-WS   >   VAL-IS-COMPARAR
690700          MOVE      10  TO  COD-IDEN-STAT-WS
690800          MOVE  1244335 TO  COD-ERR-NORMA-WS
690900          PERFORM  GRAVA-ERROS
691000     END-IF.
691100
691200     IF   VAL-IS-4-3-3-6-WS   >   1000000,00
691300          MOVE      10  TO  COD-IDEN-STAT-WS
691400          MOVE  1244336 TO  COD-ERR-NORMA-WS
691500          PERFORM  GRAVA-ERROS
691600     END-IF.
691700
691800     IF   VAL-IS-4-3-3-7-WS   >   2500000,00
691900          MOVE      10  TO  COD-IDEN-STAT-WS
692000          MOVE  1244337 TO  COD-ERR-NORMA-WS
692100          PERFORM  GRAVA-ERROS
692200     END-IF.
692300
692400 114-NORMA-4-3-4.
692500     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '14'
692600     MOVE     ZEROS     TO   VAL-IS-4-3-4-1-WS
692700     MOVE     ZEROS     TO   VAL-IS-4-3-4-2-WS
692800     MOVE     ZEROS     TO   VAL-IS-4-3-4-3-WS
692900     MOVE     ZEROS     TO   VAL-IS-4-3-4-4-WS
693000     MOVE     ZEROS     TO   VAL-IS-4-3-4-5-WS
693100     MOVE     ZEROS     TO   VAL-IS-4-3-4-6-WS
693200     MOVE     ZEROS     TO   VAL-IS-4-3-4-7-WS
693300     MOVE     1         TO   IND-WS
693400     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
693500       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
693600           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
693700           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
693800               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-4-1-WS
693900               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-5-WS
694000           END-IF
694100           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
694200               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-2-WS
694300           END-IF
694400           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
694500               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-4-3-WS
694600           END-IF
694700           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
694800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-4-WS
694900               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-5-WS
695000           END-IF
695100           IF  TAB-COD-COBERT-WS(IND-WS) = '0007'
695200               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-4-WS
695300               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-5-WS
695400           END-IF
695500           IF  TAB-COD-COBERT-WS(IND-WS) = '0008'
695600               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-4-WS
695700               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-5-WS
695800           END-IF
695900           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
696000               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-4-WS
696100               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-5-WS
696200           END-IF
696300           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
696400               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-4-WS
696500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-4-5-WS
696600           END-IF
696700           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
696800               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-4-6-WS
696900           END-IF
697000           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
697100               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-4-7-WS
697200           END-IF
697300           ADD     1         TO   IND-WS
697400     END-PERFORM
697500
697600     IF COD-TARIF-S01U034 >= 952
697700        IF COD-CORR-CTRL EQUAL 0257307 OR 0358307 OR 0282507 OR
697800                               0331007 OR 0632007
697900          MOVE 20000000,00    TO VAL-IS-COMPARAR
698000        ELSE
698100          MOVE 15000000,00    TO VAL-IS-COMPARAR
698200        END-IF
698300     ELSE
698400        MOVE  15000000,00     TO VAL-IS-COMPARAR
698500     END-IF
698600     IF   VAL-IS-4-3-4-1-WS   >   VAL-IS-COMPARAR
698700          MOVE      10  TO  COD-IDEN-STAT-WS
698800          MOVE  1244341 TO  COD-ERR-NORMA-WS
698900          PERFORM  GRAVA-ERROS
699000     END-IF
699100
699200     IF   VAL-IS-4-3-4-2-WS   >   175000,00
699300          MOVE      10  TO  COD-IDEN-STAT-WS
699400          MOVE  1244342 TO  COD-ERR-NORMA-WS
699500          PERFORM  GRAVA-ERROS
699600     END-IF
699700
699800     IF   VAL-IS-4-3-4-3-WS   >   375000,00
699900          MOVE      10  TO  COD-IDEN-STAT-WS
700000          MOVE  1244343 TO  COD-ERR-NORMA-WS
700100          PERFORM  GRAVA-ERROS
700200     END-IF
700300
700400     IF   VAL-IS-4-3-4-4-WS   >   2500000,00
700500          MOVE      10  TO  COD-IDEN-STAT-WS
700600          MOVE  1244344 TO  COD-ERR-NORMA-WS
700700          PERFORM  GRAVA-ERROS
700800     END-IF
700900
701000     IF   VAL-IS-4-3-4-5-WS   >   VAL-IS-COMPARAR
701100          MOVE      10  TO  COD-IDEN-STAT-WS
701200          MOVE  1244345 TO  COD-ERR-NORMA-WS
701300          PERFORM  GRAVA-ERROS
701400     END-IF.
701500
701600     IF   VAL-IS-4-3-4-6-WS   >   1000000,00
701700          MOVE      10  TO  COD-IDEN-STAT-WS
701800          MOVE  1244346 TO  COD-ERR-NORMA-WS
701900          PERFORM  GRAVA-ERROS
702000     END-IF.
702100
702200     IF   VAL-IS-4-3-4-7-WS   >   2500000,00
702300          MOVE      10  TO  COD-IDEN-STAT-WS
702400          MOVE  1244347 TO  COD-ERR-NORMA-WS
702500          PERFORM  GRAVA-ERROS
702600     END-IF.
702700
702800 114-NORMA-4-3-5.
702900     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '15'
703000     MOVE     ZEROS     TO   VAL-IS-4-3-5-1-WS
703100     MOVE     ZEROS     TO   VAL-IS-4-3-5-2-WS
703200     MOVE     ZEROS     TO   VAL-IS-4-3-5-3-WS
703300     MOVE     ZEROS     TO   VAL-IS-4-3-5-4-WS
703400     MOVE     ZEROS     TO   VAL-IS-4-3-5-5-WS
703500     MOVE     ZEROS     TO   VAL-IS-4-3-5-6-WS
703600     MOVE     ZEROS     TO   VAL-IS-4-3-5-7-WS
703700     MOVE     1         TO   IND-WS
703800     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
703900       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
704000           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
704100           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
704200               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-5-1-WS
704300               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-5-WS
704400           END-IF
704500           IF  TAB-COD-COBERT-WS(IND-WS) = '0004'
704600               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-2-WS
704700           END-IF
704800           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
704900               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-5-3-WS
705000           END-IF
705100           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
705200               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-4-WS
705300               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-5-WS
705400           END-IF
705500           IF  TAB-COD-COBERT-WS(IND-WS) = '0007'
705600               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-4-WS
705700               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-5-WS
705800           END-IF
705900           IF  TAB-COD-COBERT-WS(IND-WS) = '0008'
706000               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-4-WS
706100               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-5-WS
706200           END-IF
706300           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
706400               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-4-WS
706500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-5-WS
706600           END-IF
706700           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
706800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-4-WS
706900               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-5-WS
707000           END-IF
707100           IF  TAB-COD-COBERT-WS(IND-WS) = '0019'
707200               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-6-WS
707300           END-IF
707400           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
707500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-5-7-WS
707600           END-IF
707700           ADD     1         TO   IND-WS
707800     END-PERFORM
707900
708000     IF COD-TARIF-S01U034 >= 952
708100        IF COD-CORR-CTRL EQUAL 0257307 OR 0358307 OR 0282507 OR
708200                               0331007 OR 0632007
708300          MOVE 20000000,00    TO VAL-IS-COMPARAR
708400        ELSE
708500          MOVE 5000000,00     TO VAL-IS-COMPARAR
708600        END-IF
708700     ELSE
708800        MOVE  5000000,00      TO VAL-IS-COMPARAR
708900     END-IF
709000
709100     IF   VAL-IS-4-3-5-1-WS   >   VAL-IS-COMPARAR
709200          MOVE      10  TO  COD-IDEN-STAT-WS
709300          MOVE  1244351 TO  COD-ERR-NORMA-WS
709400          PERFORM  GRAVA-ERROS
709500     END-IF
709600
709700     IF   VAL-IS-4-3-5-2-WS   >   175000,00
709800          MOVE      10  TO  COD-IDEN-STAT-WS
709900          MOVE  1244352 TO  COD-ERR-NORMA-WS
710000          PERFORM  GRAVA-ERROS
710100     END-IF
710200
710300     IF   VAL-IS-4-3-5-3-WS   >   375000,00
710400          MOVE      10  TO  COD-IDEN-STAT-WS
710500          MOVE  1244353 TO  COD-ERR-NORMA-WS
710600          PERFORM  GRAVA-ERROS
710700     END-IF
710800
710900     IF   VAL-IS-4-3-5-4-WS   >   2500000,00
711000          MOVE      10  TO  COD-IDEN-STAT-WS
711100          MOVE  1244354 TO  COD-ERR-NORMA-WS
711200          PERFORM  GRAVA-ERROS
711300     END-IF
711400
711500     IF   VAL-IS-4-3-5-5-WS   >   VAL-IS-COMPARAR
711600          MOVE      10  TO  COD-IDEN-STAT-WS
711700          MOVE  1244355 TO  COD-ERR-NORMA-WS
711800          PERFORM  GRAVA-ERROS
711900     END-IF.
712000
712100     IF   VAL-IS-4-3-5-6-WS   >   1000000,00
712200          MOVE      10  TO  COD-IDEN-STAT-WS
712300          MOVE  1244356 TO  COD-ERR-NORMA-WS
712400          PERFORM  GRAVA-ERROS
712500     END-IF.
712600
712700     IF   VAL-IS-4-3-5-7-WS   >   2500000,00
712800          MOVE      10  TO  COD-IDEN-STAT-WS
712900          MOVE  1244357 TO  COD-ERR-NORMA-WS
713000          PERFORM  GRAVA-ERROS
713100     END-IF.
713200
713300 114-NORMA-4-3-6.
713400
713500     IF  COD-CLASF  = '001 ' AND  COD-COMPL-CLASF  =  '16'
713600         MOVE      10  TO  COD-IDEN-STAT-WS
713700         MOVE  124441  TO  COD-ERR-NORMA-WS
713800         PERFORM  GRAVA-ERROS
713900     END-IF.
714000
714100 114-NORMA-4-3-7.
714200
714300*    IF  COD-CLASF  = '001 ' AND  COD-COMPL-CLASF  =  '17'
714400*        MOVE      10  TO  COD-IDEN-STAT-WS
714500*        MOVE  124442  TO  COD-ERR-NORMA-WS
714600*        PERFORM  GRAVA-ERROS
714700*    END-IF.
714800
714900     IF   COD-CLASF = '001' AND  COD-COMPL-CLASF = '17'
715000     MOVE     ZEROS     TO   VAL-IS-4-3-7-1-WS
715100     MOVE     ZEROS     TO   VAL-IS-4-3-7-2-WS
715200     MOVE     ZEROS     TO   VAL-IS-4-3-7-3-WS
715300     MOVE     ZEROS     TO   VAL-IS-4-3-7-4-WS
715400     MOVE     ZEROS     TO   VAL-IS-4-3-7-5-WS
715500     MOVE     ZEROS     TO   VAL-IS-4-3-7-6-WS
715600     MOVE     ZEROS     TO   VAL-IS-4-3-7-7-WS
715700     MOVE     ZEROS     TO   VAL-IS-4-3-7-8-WS
715800     MOVE     1         TO   IND-WS
715900     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
716000       TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
716100           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
716200           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
716300               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-7-1-WS
716400               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-7-5-WS
716500           END-IF
716600           IF  TAB-COD-COBERT-WS(IND-WS) = '0005'
716700               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-7-2-WS
716800           END-IF
716900           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
717000               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-7-4-WS
717100               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-7-5-WS
717200           END-IF
717300           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
717400               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-7-4-WS
717500               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-7-5-WS
717600           END-IF
717700           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
717800               ADD  VAL-IS-AUX  TO  VAL-IS-4-3-7-5-WS
717900           END-IF
718000           IF  TAB-COD-COBERT-WS(IND-WS) = '0026'
718100               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-7-3-WS
718200           END-IF
718300           IF  TAB-COD-COBERT-WS(IND-WS) = '0006'
718400               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-7-6-WS
718500           END-IF
718600           IF  TAB-COD-COBERT-WS(IND-WS) = '0020'
718700               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-7-7-WS
718800           END-IF
718900           IF  TAB-COD-COBERT-WS(IND-WS) = '0023'
719000               MOVE VAL-IS-AUX  TO  VAL-IS-4-3-7-8-WS
719100           END-IF
719200           ADD     1         TO   IND-WS
719300     END-PERFORM
719400
719500     IF   VAL-IS-4-3-7-1-WS   >   15000000,00
719600          MOVE      10  TO  COD-IDEN-STAT-WS
719700          MOVE  1244371 TO  COD-ERR-NORMA-WS
719800          PERFORM  GRAVA-ERROS
719900     END-IF
720000
720100     IF   VAL-IS-4-3-7-2-WS   >   375000,00
720200          MOVE      10  TO  COD-IDEN-STAT-WS
720300          MOVE  1244372 TO  COD-ERR-NORMA-WS
720400          PERFORM  GRAVA-ERROS
720500     END-IF
720600
720700     IF   VAL-IS-4-3-7-3-WS   >  3000000,00
720800          MOVE      10  TO  COD-IDEN-STAT-WS
720900          MOVE  1244373 TO  COD-ERR-NORMA-WS
721000          PERFORM  GRAVA-ERROS
721100     END-IF
721200
721300     IF   VAL-IS-4-3-7-4-WS   >   2500000,00
721400          MOVE      10  TO  COD-IDEN-STAT-WS
721500          MOVE  1244374 TO  COD-ERR-NORMA-WS
721600          PERFORM  GRAVA-ERROS
721700     END-IF
721800
721900     IF   VAL-IS-4-3-7-5-WS   >   15000000,00
722000          MOVE      10  TO  COD-IDEN-STAT-WS
722100          MOVE  1244375 TO  COD-ERR-NORMA-WS
722200          PERFORM  GRAVA-ERROS
722300     END-IF.
722400
722500     IF   VAL-IS-4-3-7-6-WS   >    2500000,00
722600          MOVE      10  TO  COD-IDEN-STAT-WS
722700          MOVE  1244376 TO  COD-ERR-NORMA-WS
722800          PERFORM  GRAVA-ERROS
722900     END-IF.
723000
723100     IF   VAL-IS-4-3-7-7-WS   >    2500000,00
723200          MOVE      10  TO  COD-IDEN-STAT-WS
723300          MOVE  1244377 TO  COD-ERR-NORMA-WS
723400          PERFORM  GRAVA-ERROS
723500     END-IF.
723600
723700     IF   VAL-IS-4-3-7-8-WS   >    4500000,00
723800          MOVE      10  TO  COD-IDEN-STAT-WS
723900          MOVE  1244378 TO  COD-ERR-NORMA-WS
724000          PERFORM  GRAVA-ERROS
724100     END-IF.
724200
724300 114-NORMA-4-5.
724400
724500     IF  NOT  RENOVA
724600         GO  TO  114-NORMA-4-6.
724700
724800     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
724900         GO  TO  114-NORMA-4-6.
725000
725100*    1200089 - RENOVACOES COM SINISTRO
725200*    PERFORM   200-00-BUSCA-RENOV
725300*    IF   QTD-RENOV-SIN NOT = ZEROS
725400*          MOVE      10  TO  COD-IDEN-STAT-WS
725500*          MOVE  124451  TO  COD-ERR-NORMA-WS
725600*          PERFORM  GRAVA-ERROS
725700*    END-IF.
725800
725900 114-NORMA-4-6.
726000
726100     MOVE    'SIM'    TO    CUMPRE-NORMA
726200     MOVE     1       TO   IND-WS
726300     PERFORM  UNTIL  IND-WS  >  NUM-OCOR-COBERT-WS   OR
726400            TAB-COD-COBERT-WS(IND-WS)  EQUAL ZEROS   OR
726500            CUMPRE-NORMA = 'NAO'
726600            IF  TAB-PER-DESC-COML-WS-R(IND-WS)  >  PERC-DSC-CML-WS
726700                MOVE       'NAO'    TO       CUMPRE-NORMA
726800            END-IF
726900        ADD     1         TO   IND-WS
727000     END-PERFORM.
727100
727200     IF   CUMPRE-NORMA = 'NAO'
727300          MOVE   10     TO  COD-IDEN-STAT-WS
727400          MOVE  124461  TO  COD-ERR-NORMA-WS
727500          PERFORM  GRAVA-ERROS
727600     END-IF.
727700
727800 114-NORMA-4-7.
727900* FICHA 901136 - AS CONSISTENCIAS IRAO FICAR SOMENTE NO SYAS
728000*    MOVE      ZEROS    TO    DAT-COMPARA-WS
728100*    MOVE     'SIM'     TO    CUMPRE-NORMA
728200*    MOVE      1        TO    IND-WS
728300*    PERFORM   UNTIL    IND-WS  >  NUM-OCOR-VENC-WS   OR
728400*              DAT-VENC-WS(IND-WS)  EQUAL ZEROS       OR
728500*              CUMPRE-NORMA = 'NAO'
728600*          IF  IND-WS  =  01
728700*              MOVE   DAT-VENC-WS(IND-WS)   TO   DAT-INI-S00U023
728800*              MOVE   DAT-PARC-WS           TO   DAT-TER-S00U023
728900*              MOVE   'C'                   TO   COD-TIP-S00U023
729000*              MOVE   ' '                   TO   COD-INDIC-S00U023
729100*              CALL   'S00U023'  USING  PRM-S00U023
729200*              CANCEL 'S00U023'
729300*              IF   DSC-MSG-S00U023    =    SPACES
729400*                   MOVE QTD-DIA-S00U023 (5:4)  TO  DAT-COMPARA-WS
729500*              END-IF
729600*              IF  DAT-COMPARA-WS      >      45
729700*                  MOVE 'NAO'   TO  CUMPRE-NORMA
729800*              END-IF
729900*          ELSE
730000*              MOVE   DAT-VENC-WS(IND-WS)   TO   DAT-INI-S00U023
730100*              MOVE   DAT-PARC-WS           TO   DAT-TER-S00U023
730200*              MOVE   'C'                   TO   COD-TIP-S00U023
730300*              MOVE   ' '                   TO   COD-INDIC-S00U023
730400*              CALL   'S00U023'  USING  PRM-S00U023
730500*              CANCEL 'S00U023'
730600*              IF   DSC-MSG-S00U023    =    SPACES
730700*                   MOVE QTD-DIA-S00U023 (5:4)  TO  DAT-COMPARA-WS
730800*              END-IF
730900*              IF  DAT-COMPARA-WS      >      30
731000*                  MOVE 'NAO'   TO  CUMPRE-NORMA
731100*              END-IF
731200*          END-IF
731300*       MOVE  DAT-VENC-WS(IND-WS)    TO     DAT-PARC-WS
731400*       ADD     1         TO   IND-WS
731500*    END-PERFORM.
731600*
731700*    IF   CUMPRE-NORMA = 'NAO'
731800*         MOVE   10  TO  COD-IDEN-STAT-WS
731900*         MOVE  124471  TO  COD-ERR-NORMA-WS
732000*         PERFORM  GRAVA-ERROS
732100*    END-IF.
732200
732300 114-NORMA-4-8.
732400**==================================================================
732500**         DESCONSIDERADO CONFORME E-MAIL SHIBA 27/07/2007
732600**==================================================================
732700
732800 114-NOTA-3.
732900
733000 1400-99-PROCESSA-114.
733100     EXIT.
733200
733300*=======================================*
733400 1500-00-PROCESSA-N-P SECTION.
733500*=======================================*
733600 1500-01-PROCESSA-N-P.
733700
733800     IF   ENDOSSO
733900          GO   TO   1500-99-PROCESSA-N-P.
734000
734100 125-NORMA-3-1.
734200
734300     MOVE ZEROS  TO  COD-ERR-NORMA-WS.
734400     IF   COD-RAMO     EQUAL  480
734500          MOVE  125311  TO   COD-ERR-NORMA-WS.
734600     IF   COD-RAMO     EQUAL  490
734700          MOVE  125312  TO   COD-ERR-NORMA-WS
734800     IF   COD-RAMO     EQUAL  730
734900          MOVE  125313  TO   COD-ERR-NORMA-WS
735000     IF   COD-RAMO     EQUAL  510    AND
735100         (COD-PRODUTO  EQUAL  51014  OR  51015)
735200          MOVE  125314  TO   COD-ERR-NORMA-WS
735300
735400     IF   COD-ERR-NORMA-WS  NOT EQUAL ZEROS
735500          MOVE   80     TO   COD-IDEN-STAT-WS
735600          PERFORM  GRAVA-ERROS
735700     END-IF.
735800
735900 125-NORMA-3-2.
736000*===================================================================
736100**  OS CRITERIOS PARA INSPECAO ESTAO SENDO TRATADOS NO PROGRAMA
736200**                          S01U027
736300*===================================================================
736400
736500 125-NORMA-3-3-1.
736600
736700     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
736800       IF TIP-CUST-EMIS  NOT EQUAL   4   AND   5
736900          MOVE   80     TO   COD-IDEN-STAT-WS
737000          MOVE  125331  TO   COD-ERR-NORMA-WS
737100          PERFORM  GRAVA-ERROS
737200     END-IF.
737300
737400 125-NORMA-3-3-2.
737500
737600     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
737700       IF QTD-PARC   >   07
737800          MOVE   80     TO   COD-IDEN-STAT-WS
737900          MOVE  125332  TO   COD-ERR-NORMA-WS
738000          PERFORM  GRAVA-ERROS
738100     END-IF.
738200
738300 125-NORMA-3-3-3.
738400
738500     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
738600       IF DAT-COMPARA-WS <   365
738700          MOVE   80     TO   COD-IDEN-STAT-WS
738800          MOVE  125333  TO   COD-ERR-NORMA-WS
738900          PERFORM  GRAVA-ERROS
739000     END-IF.
739100
739200 125-NORMA-3-3-4.
739300
739400 125-NORMA-3-4-1.
739500
739600 125-NORMA-4-1.
739700
739800**FICHA 0701423
739900**   IF   PERC-CORR-WS   >   20,00
740000**        MOVE   10     TO   COD-IDEN-STAT-WS
740100**        MOVE  125411  TO   COD-ERR-NORMA-WS
740200**        PERFORM  GRAVA-ERROS
740300**   END-IF.
740400
740500 125-NORMA-4-2-1.
740600
740700     IF   COD-RAMO          =   150
740800       IF VAL-IS-4-2-1-WS   >   100000,00
740900          MOVE      10  TO  COD-IDEN-STAT-WS
741000          MOVE  125421  TO  COD-ERR-NORMA-WS
741100          PERFORM  GRAVA-ERROS
741200     END-IF.
741300
741400 125-NORMA-4-2-2.
741500
741600     IF   COD-RAMO   NOT  EQUAL  480 AND 490 AND 730
741700          MOVE      10  TO  COD-IDEN-STAT-WS
741800          MOVE  125422  TO  COD-ERR-NORMA-WS
741900          PERFORM  GRAVA-ERROS
742000     END-IF.
742100
742200     IF   COD-RAMO    NOT  EQUAL  510 AND
742300         (COD-PRODUTO NOT EQUAL 51014 AND 51015)
742400          MOVE      10  TO  COD-IDEN-STAT-WS
742500          MOVE  125422  TO  COD-ERR-NORMA-WS
742600          PERFORM  GRAVA-ERROS
742700     END-IF.
742800
742900 125-NORMA-4-3-1.
743000
743100     IF   NOT  RENOVA
743200          GO  TO  125-NORMA-4-3-F.
743300
743400     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
743500          GO  TO  125-NORMA-4-3-F.
743600
743700     PERFORM   200-00-BUSCA-RENOV
743800     IF   QTD-RENOV-SIN NOT = ZEROS
743900          MOVE      10  TO  COD-IDEN-STAT-WS
744000          MOVE  125431  TO  COD-ERR-NORMA-WS
744100          PERFORM  GRAVA-ERROS
744200     END-IF.
744300
744400 125-NORMA-4-3-F.
744500
744600 125-NORMA-4-4.
744700
744800 125-NORMA-4-5.
744900
745000*===================================================================
745100**  OS CRITERIOS PARA INSPECAO ESTAO SENDO TRATADOS NO PROGRAMA
745200**                          S01U027
745300*===================================================================
745400
745500 125-NOTA-6.
745600
745700 125-NOTA-7.
745800
745900 1500-99-PROCESSA-N-P.
746000     EXIT.
746100
746200*=======================================*
746300 8200-00-PROCESSA-112 SECTION.
746400*=======================================*
746500 8200-01-PROCESSA-112.
746600
746700      IF  ENDOSSO
746800          GO   TO  812-NORMA-3-5.
746900
747000 812-NORMA-3-1.
747100
747200**FICHA 0701423
747300**   IF   PERC-CORR-WS   >   60,00
747400**        MOVE   80     TO   COD-IDEN-STAT-WS
747500**        MOVE  822311  TO   COD-ERR-NORMA-WS
747600**        PERFORM  GRAVA-ERROS
747700**   END-IF.
747800
747900 812-NORMA-3-2.
748000
748100     MOVE ZEROS  TO  COD-ERR-NORMA-WS.
748200     IF   COD-CLASF  = '002 ' AND  COD-COMPL-CLASF  =  '23'
748300          MOVE  822321  TO  COD-ERR-NORMA-WS.
748400     IF   COD-CLASF  = '004 ' AND  COD-COMPL-CLASF  =  '23'
748500          MOVE  822322  TO  COD-ERR-NORMA-WS.
748600     IF   COD-CLASF  = '008 ' AND  COD-COMPL-CLASF  =  '21'
748700          MOVE  822323  TO  COD-ERR-NORMA-WS.
748800     IF   COD-CLASF  = '008 ' AND  COD-COMPL-CLASF  =  '24'
748900          MOVE  822324  TO  COD-ERR-NORMA-WS.
749000     IF   COD-CLASF  = '017 '
749100          MOVE  822325  TO  COD-ERR-NORMA-WS.
749200     IF   COD-CLASF  = '060 ' AND  COD-COMPL-CLASF  =  '21'
749300          MOVE  822326  TO  COD-ERR-NORMA-WS.
749400     IF   COD-CLASF  = '102 ' AND  COD-COMPL-CLASF  =  '22'
749500          MOVE  822327  TO  COD-ERR-NORMA-WS.
749600     IF   COD-CLASF  = '102 ' AND  COD-COMPL-CLASF  =  '28'
749700          MOVE  822328  TO  COD-ERR-NORMA-WS.
749800     IF   COD-CLASF  = '105 ' AND  COD-COMPL-CLASF  =  '22'
749900          MOVE  822329  TO  COD-ERR-NORMA-WS.
750000     IF   COD-CLASF  = '117 ' AND  COD-COMPL-CLASF  =  '21'
750100          MOVE  8223210 TO  COD-ERR-NORMA-WS.
750200     IF   COD-CLASF  = '118 ' AND  COD-COMPL-CLASF  =  '21'
750300          MOVE  8223211 TO  COD-ERR-NORMA-WS.
750400     IF   COD-CLASF  = '118 ' AND  COD-COMPL-CLASF  =  '23'
750500          MOVE  8223212 TO  COD-ERR-NORMA-WS.
750600     IF   COD-CLASF  = '121 ' AND  COD-COMPL-CLASF  =  '23'
750700          MOVE  8223213 TO  COD-ERR-NORMA-WS.
750800     IF   COD-CLASF  = '122 ' AND  COD-COMPL-CLASF  =  '21'
750900          MOVE  8223214 TO  COD-ERR-NORMA-WS.
751000     IF   COD-CLASF  = '133 ' AND  COD-COMPL-CLASF  =  '23'
751100          MOVE  8223215 TO  COD-ERR-NORMA-WS.
751200     IF   COD-CLASF  = '203 '
751300          MOVE  8223216 TO  COD-ERR-NORMA-WS.
751400     IF   COD-CLASF  = '236 '
751500          MOVE  8223217 TO  COD-ERR-NORMA-WS.
751600     IF   COD-CLASF  = '260 ' AND  COD-COMPL-CLASF  =  '11'
751700          MOVE  8223218 TO  COD-ERR-NORMA-WS.
751800     IF   COD-CLASF  = '260 ' AND  COD-COMPL-CLASF  =  '12'
751900          MOVE  8223219 TO  COD-ERR-NORMA-WS.
752000     IF   COD-CLASF  = '261 '
752100          MOVE  8223220 TO  COD-ERR-NORMA-WS.
752200     IF   COD-CLASF  = '292 '
752300          MOVE  8223221 TO  COD-ERR-NORMA-WS.
752400     IF   COD-CLASF  = '329 '
752500          MOVE  8223222 TO  COD-ERR-NORMA-WS.
752600     IF   COD-CLASF  = '369 ' AND  COD-COMPL-CLASF  =  '24'
752700          MOVE  8223223 TO  COD-ERR-NORMA-WS.
752800     IF   COD-CLASF  = '370 ' AND  COD-COMPL-CLASF  =  '28'
752900          MOVE  8223224 TO  COD-ERR-NORMA-WS.
753000     IF   COD-CLASF  = '370 ' AND  COD-COMPL-CLASF  =  '31'
753100          MOVE  8223225 TO  COD-ERR-NORMA-WS.
753200     IF   COD-CLASF  = '402 ' AND  COD-COMPL-CLASF  =  '23'
753300          MOVE  8223226 TO  COD-ERR-NORMA-WS.
753400     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '28'
753500          MOVE  8223227 TO  COD-ERR-NORMA-WS.
753600     IF   COD-CLASF  = '403 ' AND  COD-COMPL-CLASF  =  '32'
753700          MOVE  8223228 TO  COD-ERR-NORMA-WS.
753800     IF   COD-CLASF  = '426 '
753900          MOVE  8223229 TO  COD-ERR-NORMA-WS.
754000     IF   COD-CLASF  = '490 ' AND  COD-COMPL-CLASF  =  '22'
754100          MOVE  8223230 TO  COD-ERR-NORMA-WS.
754200     IF   COD-CLASF  = '495 ' AND  COD-COMPL-CLASF  =  '21'
754300          MOVE  8223231 TO  COD-ERR-NORMA-WS.
754400     IF   COD-CLASF  = '499 '
754500          MOVE  8223232 TO  COD-ERR-NORMA-WS.
754600     IF   COD-CLASF  = '500 ' AND  COD-COMPL-CLASF  =  '22'
754700          MOVE  8223233 TO  COD-ERR-NORMA-WS.
754800
754900     IF   COD-ERR-NORMA-WS  NOT EQUAL ZEROS
755000          MOVE   80     TO   COD-IDEN-STAT-WS
755100          PERFORM  GRAVA-ERROS
755200     END-IF.
755300
755400 812-NORMA-3-3.
755500
755600     IF   LMG-WS         =  'SIM'
755700          MOVE   80     TO   COD-IDEN-STAT-WS
755800          MOVE  822331  TO   COD-ERR-NORMA-WS
755900          PERFORM  GRAVA-ERROS
756000     END-IF.
756100
756200 812-NORMA-3-4.
756300
756400*===================================================================
756500**  OS CRITERIOS PARA INSPECAO ESTAO SENDO TRATADOS NO PROGRAMA
756600**                          S01U027
756700*===================================================================
756800
756900 812-NORMA-3-5.
757000
757100     IF   NOT  ENDOSSO
757200          GO   TO  812-NORMA-3-6-1.
757300
757400 812-NORMA-3-5-1.
757500
757600     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   03
757700          MOVE  822351  TO   COD-ERR-NORMA-WS
757800          MOVE   80     TO   COD-IDEN-STAT-WS
757900          PERFORM  GRAVA-ERROS
758000     END-IF.
758100
758200 812-NORMA-3-5-2.
758300
758400     IF   COD-IDEN-ACES-WS  EQUAL  ZEROS
758500          MOVE   80     TO   COD-IDEN-STAT-WS
758600          MOVE  822352  TO   COD-ERR-NORMA-WS
758700          PERFORM  GRAVA-ERROS
758800     END-IF.
758900
759000 812-NORMA-3-5-3.
759100
759200     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   05
759300          MOVE  822353  TO   COD-ERR-NORMA-WS
759400          MOVE   80     TO   COD-IDEN-STAT-WS
759500          PERFORM  GRAVA-ERROS
759600     END-IF.
759700
759800     GO   TO    8200-99-PROCESSA-112.
759900
760000 812-NORMA-3-6-1.
760100
760200     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
760300       IF TIP-CUST-EMIS  NOT EQUAL   4   AND   5
760400          MOVE   80     TO   COD-IDEN-STAT-WS
760500          MOVE  822361  TO   COD-ERR-NORMA-WS
760600          PERFORM  GRAVA-ERROS
760700     END-IF.
760800
760900 812-NORMA-3-6-2.
761000
761100     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
761200       IF QTD-PARC   >  07
761300          MOVE   80     TO   COD-IDEN-STAT-WS
761400          MOVE  822362  TO   COD-ERR-NORMA-WS
761500          PERFORM  GRAVA-ERROS
761600     END-IF.
761700
761800 812-NORMA-3-6-3.
761900
762000     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
762100       IF DAT-COMPARA-WS <   365
762200          MOVE   80     TO   COD-IDEN-STAT-WS
762300          MOVE  822363  TO   COD-ERR-NORMA-WS
762400          PERFORM  GRAVA-ERROS
762500     END-IF.
762600
762700 812-NORMA-3-6-4.
762800
762900     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
763000          MOVE   80     TO   COD-IDEN-STAT-WS
763100          MOVE  822364  TO   COD-ERR-NORMA-WS
763200          PERFORM  GRAVA-ERROS
763300     END-IF.
763400
763500 812-NORMA-3-6-5.
763600
763700 812-NORMA-3-7-1.
763800
763900 812-NORMA-4-1-1.
764000
764100     MOVE     ZEROS     TO   VAL-IS-4-1-1-WS
764200     MOVE     1         TO   IND-WS
764300     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
764400        TAB-COD-COBERT-WS(IND-WS)  EQUAL ZEROS
764500           MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
764600           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
764700               MOVE VAL-IS-AUX  TO  VAL-IS-4-1-1-WS
764800           END-IF
764900        ADD     1         TO   IND-WS
765000     END-PERFORM.
765100
765200     IF   VAL-IS-4-1-1-WS   >   8000000,00
765300          MOVE      10  TO  COD-IDEN-STAT-WS
765400          MOVE  822411  TO  COD-ERR-NORMA-WS
765500          PERFORM  GRAVA-ERROS
765600     END-IF.
765700
765800 812-NORMA-4-2-1.
765900
766000 812-NORMA-4-3-1.
766100
766200*===================================================================
766300**  OS CRITERIOS PARA INSPECAO ESTAO SENDO TRATADOS NO PROGRAMA
766400**                          S01U027
766500*===================================================================
766600
766700 812-NORMA-4-4-1.
766800**==================================================================
766900**         DESCONSIDERADO CONFORME E-MAIL SHIBA 27/07/2007
767000**==================================================================
767100
767200
767300 8200-99-PROCESSA-112.
767400     EXIT.
767500
767600 9200-00-PROCESSA-912 SECTION.
767700*=======================================*
767800 9200-01-PROCESSA-912.
767900
768000      IF  ENDOSSO
768100          GO   TO  912-NORMA-3-5.
768200
768300 912-NORMA-3-1.
768400
768500**FICHA 0701423
768600**   IF   PERC-CORR-WS   >   60,00
768700**        MOVE   80     TO   COD-IDEN-STAT-WS
768800**        MOVE  922311  TO   COD-ERR-NORMA-WS
768900**        PERFORM  GRAVA-ERROS
769000**   END-IF.
769100
769200 912-NORMA-3-2.
769300
769400     PERFORM 100-00-CLASSE-CONSTRUCAO.
769500     IF   CUMPRE-NORMA   =  'NAO'
769600          MOVE   80     TO   COD-IDEN-STAT-WS
769700          MOVE  922321  TO  COD-ERR-NORMA-WS
769800          PERFORM  GRAVA-ERROS
769900     END-IF.
770000
770100 912-NORMA-3-3.
770200
770300     MOVE     1         TO   IND-WS
770400     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
770500        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
770600           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
770700               IF TAB-VAL-IS-WS-R (IND-WS) >  200000,00
770800                  MOVE   80         TO   COD-IDEN-STAT-WS
770900                  MOVE  922331      TO   COD-ERR-NORMA-WS
771000                  PERFORM  GRAVA-ERROS
771100               END-IF
771200           END-IF
771300        ADD     1         TO   IND-WS
771400     END-PERFORM.
771500
771600 912-NORMA-3-4.
771700
771800     IF   VAL-VR   >  300000,00
771900          MOVE   80     TO   COD-IDEN-STAT-WS
772000          MOVE  922341  TO   COD-ERR-NORMA-WS
772100          PERFORM  GRAVA-ERROS
772200     END-IF.
772300
772400 912-NORMA-3-5.
772500
772600     IF   NOT  ENDOSSO
772700          GO   TO  912-NORMA-3-6-1.
772800
772900 912-NORMA-3-5-1.
773000
773100     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   03
773200          MOVE  922351  TO   COD-ERR-NORMA-WS
773300          MOVE   80     TO   COD-IDEN-STAT-WS
773400          PERFORM  GRAVA-ERROS
773500     END-IF.
773600
773700 912-NORMA-3-5-2.
773800
773900     IF   COD-IDEN-ACES-WS  EQUAL  ZEROS
774000          MOVE   80     TO   COD-IDEN-STAT-WS
774100          MOVE  922352  TO   COD-ERR-NORMA-WS
774200          PERFORM  GRAVA-ERROS
774300     END-IF.
774400
774500 912-NORMA-3-5-3.
774600
774700     IF   LMG-WS   =  'SIM'  AND   COD-DIZER   =   05
774800          MOVE  922353  TO   COD-ERR-NORMA-WS
774900          MOVE   80     TO   COD-IDEN-STAT-WS
775000          PERFORM  GRAVA-ERROS
775100     END-IF.
775200
775300     GO   TO   9200-99-PROCESSA-912.
775400
775500 912-NORMA-3-5-4.
775600**==================================================================
775700**         DESCONSIDERADO CONFORME E-MAIL SHIBA 27/07/2007
775800**==================================================================
775900
776000 912-NORMA-3-6-1.
776100
776200     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
776300       IF TIP-CUST-EMIS  NOT EQUAL   4   AND   5
776400          MOVE   80     TO   COD-IDEN-STAT-WS
776500          MOVE  922361  TO   COD-ERR-NORMA-WS
776600          PERFORM  GRAVA-ERROS
776700     END-IF.
776800
776900 912-NORMA-3-6-2.
777000
777100     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
777200       IF QTD-PARC   >  07
777300          MOVE   80     TO   COD-IDEN-STAT-WS
777400          MOVE  922362  TO   COD-ERR-NORMA-WS
777500          PERFORM  GRAVA-ERROS
777600     END-IF.
777700
777800 912-NORMA-3-6-3.
777900
778000     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
778100       IF DAT-COMPARA-WS <   365
778200          MOVE   80     TO   COD-IDEN-STAT-WS
778300          MOVE  922363  TO   COD-ERR-NORMA-WS
778400          PERFORM  GRAVA-ERROS
778500     END-IF.
778600
778700 912-NORMA-3-6-4.
778800
778900     IF   RENOVA    AND   CONSTA-CANC-WS   =  'S'
779000          MOVE   80     TO   COD-IDEN-STAT-WS
779100          MOVE  922364  TO   COD-ERR-NORMA-WS
779200          PERFORM  GRAVA-ERROS
779300     END-IF.
779400
779500 912-NORMA-3-6-5.
779600
779700 912-NORMA-3-7-1.
779800
779900 912-NORMA-4-1.
780000
780100**FICHA 0701423
780200**   IF   PERC-CORR-WS   >   30,00
780300**        MOVE   10     TO   COD-IDEN-STAT-WS
780400**        MOVE  922411  TO   COD-ERR-NORMA-WS
780500**        PERFORM  GRAVA-ERROS
780600**   END-IF.
780700
780800 912-NORMA-4-2.
780900
781000     IF  NOT  RENOVA
781100         GO TO  912-NORMA-4-3.
781200
781300     IF  COD-USER-S01U034 = 'SYAS99' OR 'SYAS98'
781400         GO TO  912-NORMA-4-3.
781500
781600     PERFORM   200-00-BUSCA-RENOV
781700     IF   QTD-RENOV-SIN NOT = ZEROS
781800           MOVE      10  TO  COD-IDEN-STAT-WS
781900           MOVE  922421  TO  COD-ERR-NORMA-WS
782000           PERFORM  GRAVA-ERROS
782100     END-IF.
782200
782300 912-NORMA-4-3.
782400
782500     MOVE    'SIM'    TO    CUMPRE-NORMA
782600     MOVE     1       TO   IND-WS
782700     PERFORM  UNTIL  IND-WS  >  NUM-OCOR-COBERT-WS   OR
782800            TAB-COD-COBERT-WS(IND-WS)  EQUAL ZEROS   OR
782900            CUMPRE-NORMA = 'NAO'
783000            IF  TAB-PER-DESC-COML-WS-R(IND-WS)  >  PERC-DSC-CML-WS
783100                MOVE       'NAO'    TO       CUMPRE-NORMA
783200            END-IF
783300        ADD     1         TO   IND-WS
783400     END-PERFORM.
783500
783600     IF   CUMPRE-NORMA = 'NAO'
783700          MOVE   10     TO  COD-IDEN-STAT-WS
783800          MOVE  922431  TO  COD-ERR-NORMA-WS
783900          PERFORM  GRAVA-ERROS
784000     END-IF.
784100
784200 912-NOTA-4.
784300
784400
784500 9200-99-PROCESSA-912.
784600     EXIT.
784700
784800*=======================================*
784900 090-00-VERIFICA-LMG      SECTION.
785000*=======================================*
785100 090-01-VERIFICA-LMG.
785200
785300     MOVE    'NAO'    TO    LMG-WS
785400     MOVE     1       TO    IND-WS
785500     PERFORM  UNTIL   IND-WS   >   NUM-OCOR-COBERT-WS  OR
785600              TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS    OR
785700              LMG-WS  = 'SIM'
785800       MOVE     1                 TO     SUB-WS
785900       PERFORM  UNTIL  SUB-WS     >      NUM-OCOR-COBERT-WS  OR
786000                TAB-COD-COBERT-WS(SUB-WS)   EQUAL ZEROS      OR
786100                LMG-WS  =  'SIM'
786200         IF    TAB-COD-LIM-WS (IND-WS)
786300                               EQUAL    TAB-COD-COBERT-WS (SUB-WS)
786400               COMPUTE  VAL-LIM-MAX-WS  =  TAB-VAL-IS-WS-R(SUB-WS)
786500                                    * TAB-PER-LIM-MAX-WS-R(IND-WS)
786600                                    / 100
786700          IF   TAB-VAL-IS-WS-R (IND-WS)
786800                                     >     (VAL-LIM-MAX-WS + 1)
786900               MOVE 'SIM'   TO  LMG-WS
787000          END-IF
787100         END-IF
787200         ADD  1            TO     SUB-WS
787300       END-PERFORM
787400       ADD     1         TO   IND-WS
787500     END-PERFORM.
787600
787700 090-99-VERIFICA-LMG.
787800     EXIT.
787900
788000*=======================================*
788100 100-00-CLASSE-CONSTRUCAO SECTION.
788200*=======================================*
788300 100-01-CLASSE-CONSTRUCAO.
788400
788500     MOVE   1         TO     IND-2
788600     MOVE   'NAO'     TO     CUMPRE-NORMA
788700     PERFORM UNTIL  IND-2   >  NUM-OCOR-CONST-A
788800        IF  COD-RAMO        = COD-RAMO-CONST-A   (IND-2) AND
788900            COD-IDEN-TARIF >= COD-TARF-I-CONST-A (IND-2) AND
789000            COD-IDEN-TARIF <= COD-TARF-F-CONST-A (IND-2) AND
789100            COD-CONSTR      = COD-CONSTR-CONST-A (IND-2)
789200            IF    SIG-UF-RISCO = COD-UF-CONST-A(IND-2)   OR
789300                  COD-UF-CONST-A(IND-2) = SPACES
789400                  MOVE   'SIM'   TO CUMPRE-NORMA
789500            END-IF
789600        END-IF
789700        ADD  1            TO     IND-2
789800     END-PERFORM.
789900
790000 100-99-CLASSE-CONSTRUCAO.
790100     EXIT.
790200
790300*=======================================*
790400 120-00-COBERTURAS SECTION.
790500*=======================================*
790600 120-01-COBERTURAS.
790700
790800     MOVE   'SIM'     TO     CUMPRE-NORMA
790900     MOVE     1       TO     IND-WS
791000     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
791100       TAB-COD-COBERT-WS(IND-WS) =  ZEROS
791200       MOVE   1         TO     IND-2
791300       PERFORM UNTIL  IND-2   >  NUM-OCOR-COB-A
791400          IF  COD-RAMO        = COD-RAMO-COB-A  (IND-2) AND
791500              COD-IDEN-TARIF >= COD-TARF-I-COB-A(IND-2) AND
791600              COD-IDEN-TARIF <= COD-TARF-F-COB-A(IND-2)
791700              IF  (COD-CONSTR   = COD-CONSTR-COB-A(IND-2) OR
791800                   '99'         = COD-CONSTR-COB-A(IND-2))
791900                MOVE       ZEROS      TO    TAB-COB-LIB
792000                IF  CORR-LIB = 'SIM' OR (CORR-LIB-MARSH = 'SIM'
792100                     AND COD-TARIF-S01U034 < 950)
792200                    MOVE TAB-COD-COBERT-WS(IND-WS)  TO
792300                                            TAB-COB-LIB
792400                END-IF
792500                IF NOT  COB-LIB
792600                   IF  TAB-COD-COBERT-WS(IND-WS) =
792700                          COD-COB-A(IND-2)
792800                       OR '9999' = COD-COB-A(IND-2)
792900                       IF TIP-ACEIT-COB-A(IND-2) = COD-TIP-AUX
793000                          MOVE 'NAO'   TO CUMPRE-NORMA
793100                          MOVE COD-NORMA-COB-A(IND-2) TO
793200                                               COD-ERR-NORMA-WS
793300                          IF  COD-TIP-AUX  = 'N'
793400                              MOVE 80  TO  COD-IDEN-STAT-WS
793500                          ELSE
793600                              MOVE 10  TO  COD-IDEN-STAT-WS
793700                          END-IF
793800                          PERFORM  GRAVA-ERROS
793900                       END-IF
794000                   END-IF
794100                END-IF
794200              END-IF
794300          END-IF
794400          ADD  1  TO     IND-2
794500       END-PERFORM
794600       ADD  1     TO     IND-WS
794700     END-PERFORM.
794800
794900 120-99-COBERTURAS.
795000     EXIT.
795100
795200*=======================================*
795300 130-00-COBERTURAS SECTION.
795400*=======================================*
795500 130-01-COBERTURAS.
795600
795700     MOVE   'SIM'     TO     CUMPRE-NORMA
795800     MOVE     1       TO     IND-WS
795900     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
796000       TAB-COD-COBERT-WS(IND-WS) =  ZEROS
796100       MOVE   1       TO     IND-2
796200       PERFORM UNTIL  IND-2   >  NUM-OCOR-COB-B
796300          IF  COD-RAMO        = COD-RAMO-COB-B  (IND-2)
796400            IF (COD-CLASF       = COD-CLASF-B   (IND-2)   AND
796500                COD-COMPL-CLASF = COD-COMPL-CLASF-B(IND-2))
796600                IF  TAB-COD-COBERT-WS(IND-WS) = COD-COB-B(IND-2)
796700                    IF TIP-ACEIT-COB-B(IND-2) = COD-TIP-AUX
796800
796900                       IF CORR-LIB-MARINE = 'SIM' AND
797000                         (COD-NORMA-COB-B(IND-2) = 1233332 OR
797100                         COD-NORMA-COB-B(IND-2) = 1233342) AND
797200                         COD-TARIF-S01U034 >= 952
797300                         MOVE 'SIM' TO  CORR-LIB-MARINE
797400                       ELSE
797500                         MOVE 'NAO'   TO CUMPRE-NORMA
797600                         MOVE COD-NORMA-COB-B(IND-2) TO
797700                                            COD-ERR-NORMA-WS
797800                         IF  COD-TIP-AUX  = 'N'
797900                            MOVE 80  TO  COD-IDEN-STAT-WS
798000                         ELSE
798100                            MOVE 10  TO  COD-IDEN-STAT-WS
798200                         END-IF
798300                         PERFORM  GRAVA-ERROS
798400                       END-IF
798500                    END-IF
798600                END-IF
798700            END-IF
798800          END-IF
798900          ADD  1  TO     IND-2
799000       END-PERFORM
799100       ADD  1     TO     IND-WS
799200     END-PERFORM.
799300
799400 130-99-COBERTURAS.
799500     EXIT.
799600
799700*=======================================*
799800 160-00-INSPECAO      SECTION.
799900*=======================================*
800000 160-01-INSPECAO.
800100
800200     MOVE 'NAO'  TO   INSP-OBRIG-WS
800300     MOVE  1           TO     IND-WS
800400     PERFORM UNTIL  IND-WS  >   NUM-OCOR-COBERT-WS
800500       OR  TAB-COD-COBERT-WS (IND-WS) = ZEROS
800600       MOVE TAB-VAL-IS-WS-R(IND-WS)     TO  VAL-IS-AUX
800700       MOVE TAB-COD-COBERT-WS (IND-WS)  TO COD-COB-AUX
800800       MOVE     1                 TO     IND-2
800900       PERFORM  UNTIL  IND-2   >   NUM-OCOR-INSP
801000         OR     INSP-OBRIG-WS = 'SIM'
801100         IF COD-RAMO  = COD-RAMO-INSP (IND-2)
801200            IF (COD-CLASF       = COD-CLASF-INSP(IND-2)   AND
801300                COD-COMPL-CLASF = COD-COMPL-INSP(IND-2))
801400            OR ('9999'          = COD-CLASF-INSP(IND-2)   AND
801500                '99'            = COD-COMPL-INSP(IND-2))
801600              IF   COD-CONSTR   = COD-CONSTR-INSP(IND-2)  OR
801700                   '99'         = COD-CONSTR-INSP(IND-2)
801800                 IF  COD-COB-AUX = COD-COBERT-INSP(IND-2) OR
801900                     '9999'      = COD-COBERT-INSP(IND-2)
802000                     IF VAL-IS-AUX >  VAL-IS-DE-INSP(IND-2)
802100                         MOVE 'SIM'  TO   INSP-OBRIG-WS
802200                     END-IF
802300                 END-IF
802400              END-IF
802500            END-IF
802600         END-IF
802700         ADD  1          TO     IND-2
802800       END-PERFORM
802900       ADD   1           TO     IND-WS
803000     END-PERFORM.
803100
803200 160-99-INSPECAO.
803300     EXIT.
803400
803500*=======================================*
803600 170-00-INSPECAO-SIN  SECTION.
803700*=======================================*
803800 170-01-INSPECAO-SIN.
803900
804000     MOVE 'NAO'  TO   INSP-OBRIG-WS
804100     MOVE  1           TO     IND-WS
804200
804300     PERFORM UNTIL  IND-WS  >   NUM-OCOR-COB-SIN-WS
804400       OR  TAB-COD-COBERT-SIN-WS (IND-WS) = ZEROS
804500       MOVE TAB-NUM-ITEM-SIN-WS             TO  NUM-ITEM-AUX
804600       MOVE TAB-VAL-PAG-SIN-WS-R (IND-WS)   TO  VAL-IS-AUX
804700       MOVE TAB-COD-COBERT-SIN-WS (IND-WS)  TO  COD-COB-AUX
804800
804900       MOVE     1                 TO     IND-2
805000       PERFORM  UNTIL  IND-2   >   NUM-OCOR-INSP-SIN
805100         OR     INSP-OBRIG-WS = 'SIM'
805200         IF COD-RAMO  = COD-RAMO-INSP-SIN (IND-2)
805300             IF  NUM-ITEM-AUX    = NUM-ITEM-SIN
805400                 IF  COD-COB-AUX = COD-COBERT-INSP-SIN(IND-2) OR
805500                     '9999'      = COD-COBERT-INSP-SIN(IND-2)
805600                     IF VAL-IS-AUX >  VAL-IS-DE-INSP-SIN(IND-2)
805700                         MOVE 'SIM'  TO   INSP-OBRIG-WS
805800                     END-IF
805900                 END-IF
806000             END-IF
806100         END-IF
806200         ADD  1          TO     IND-2
806300       END-PERFORM
806400       ADD   1           TO     IND-WS
806500     END-PERFORM.
806600
806700 170-99-INSPECAO-SIN.
806800     EXIT.
806900
807000*=======================================*
807100 200-00-BUSCA-RENOV   SECTION.
807200*=======================================*
807300 200-01-BUSCA-RENOV.
807400
807500     MOVE  NUM-APOL-ANT-CTRL   TO  NUM-APOL-SIN
807600     MOVE  NUM-ITEM            TO  NUM-ITEM-SIN
807700     MOVE  ZEROS               TO  QTD-RENOV-SIN
807800
           MOVE SPACES TO TAB-CONTEUDO-SQL-WS
           MOVE ZEROS TO QTD-CONTEUDO-SQL-WS
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'EXEC SQL                                                   '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '     SELECT  COUNT(*)                                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       INTO :QTD-RENOV-SIN                                 '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '       FROM      TAB_SIN_PAG                               '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '      WHERE  COD_SEGURA    =      641                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  COD_LID       =      641                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  NUM_APOL      =     :NUM-APOL-SIN             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  NUM_ITEM      =     :NUM-ITEM-SIN             '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  COD_IDEN_ESTOR_SIN = 0                        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '        AND  COD_IDEN_LIBER_SIN = "P"                      '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           'END-EXEC.                                                  '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           ADD 1 TO QTD-CONTEUDO-SQL-WS
           MOVE
           '******* AND  COD_IDEN_RENOV =     2                        '
              TO DSC-CONTEUDO-SQL-WS (QTD-CONTEUDO-SQL-WS)
           MOVE ZEROS TO TAB-MOSTRA-HOST
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00176)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00171)
           MOVE 1 TO COD-IDEN-MOSTRA-HOST  (00172)
807900     EXEC SQL
808000          SELECT  COUNT(*)
808100            INTO :QTD-RENOV-SIN
808200            FROM      TAB_SIN_PAG
808300           WHERE  COD_SEGURA    =      641
808400             AND  COD_LID       =      641
808500             AND  NUM_APOL      =     :NUM-APOL-SIN
808600             AND  NUM_ITEM      =     :NUM-ITEM-SIN
808700             AND  COD_IDEN_ESTOR_SIN = 0
808800             AND  COD_IDEN_LIBER_SIN = 'P'
808900     END-EXEC.
809000************ AND  COD_IDEN_RENOV =     2
809100
809200 200-99-BUSCA-RENOV.
809300     EXIT.
809400
809500*=======================================*
809600 5112-00-RESSEGURO-112 SECTION.
809700*=======================================*
809800 112-RESSEG-1.
809900
810000     IF   COD-CLASF  = '010 '  OR
810100          COD-CLASF  = '018 '  OR
810200          COD-CLASF  = '019 '  OR
810300          COD-CLASF  = '103 '  OR
810400          COD-CLASF  = '012 '  OR
810500          COD-CLASF  = '235 '  OR
810600          COD-CLASF  = '125 '  OR
810700          COD-CLASF  = '231 '  OR
810800          COD-CLASF  = '004 '  OR
810900          COD-CLASF  = '235 '  OR
811000          COD-CLASF  = '364 '  OR
811100          COD-CLASF  = '433 '  OR
811200          COD-CLASF  = '527 '
811300          MOVE 1  TO  TAB-CLASSE-112
811400     ELSE
811500          MOVE 2  TO  TAB-CLASSE-112
811600     END-IF
811700
811800     MOVE     1         TO   IND-WS
811900     MOVE     ZEROS     TO   VAL-IS-AUX
812000     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
812100        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
812200           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'
812300               MOVE   TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
812400               MOVE   NUM-OCOR-COBERT-WS  TO IND-WS
812500           END-IF
812600           ADD     1         TO   IND-WS
812700     END-PERFORM.
812800     IF   CLASSE-4-112
812900          IF   VAL-IS-AUX        >  41250000,00
813000               MOVE      35  TO  COD-IDEN-STAT-WS
813100               MOVE  6121 TO  COD-ERR-NORMA-WS
813200               PERFORM  GRAVA-ERROS
813300          END-IF
813400     ELSE
813500          IF   VAL-IS-AUX        >  60000000,00
813600               MOVE      35  TO  COD-IDEN-STAT-WS
813700               MOVE 6122  TO  COD-ERR-NORMA-WS
813800               PERFORM  GRAVA-ERROS
813900          END-IF
814000     END-IF.
814100
814200 112-RESSEG-2.
814300
814400     MOVE     1         TO   IND-WS
814500     MOVE     ZEROS     TO   VAL-IS-AUX
814600     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
814700        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
814800           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'  OR
814900               TAB-COD-COBERT-WS(IND-WS) = '0039'  OR
815000               TAB-COD-COBERT-WS(IND-WS) = '0032'  OR
815100               TAB-COD-COBERT-WS(IND-WS) = '0003'  OR
815200               TAB-COD-COBERT-WS(IND-WS) = '0042'  OR
815300               TAB-COD-COBERT-WS(IND-WS) = '0084'  OR
815400               TAB-COD-COBERT-WS(IND-WS) = '0022'  OR
815500               TAB-COD-COBERT-WS(IND-WS) = '0057'  OR
815600               TAB-COD-COBERT-WS(IND-WS) = '0058'  OR
815700               TAB-COD-COBERT-WS(IND-WS) = '0059'  OR
815800               TAB-COD-COBERT-WS(IND-WS) = '0060'  OR
815900               TAB-COD-COBERT-WS(IND-WS) = '0061'  OR
816000               TAB-COD-COBERT-WS(IND-WS) = '0062'
816100               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
816200           END-IF
816300           ADD     1         TO   IND-WS
816400     END-PERFORM.
816500     IF   CLASSE-4-112
816600          IF   VAL-IS-AUX        >  41250000,00
816700               MOVE      35  TO  COD-IDEN-STAT-WS
816800               MOVE 6123  TO  COD-ERR-NORMA-WS
816900               PERFORM  GRAVA-ERROS
817000          END-IF
817100     ELSE
817200          IF   VAL-IS-AUX        >  60000000,00
817300               MOVE      35  TO  COD-IDEN-STAT-WS
817400               MOVE 6124  TO  COD-ERR-NORMA-WS
817500               PERFORM  GRAVA-ERROS
817600          END-IF
817700     END-IF.
817800
817900 112-RESSEG-3.
818000
818100     MOVE     1         TO   IND-WS
818200     MOVE     ZEROS     TO   VAL-IS-AUX
818300     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
818400        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
818500           IF  TAB-COD-COBERT-WS(IND-WS) = '0039'  OR
818600               TAB-COD-COBERT-WS(IND-WS) = '0032'  OR
818700               TAB-COD-COBERT-WS(IND-WS) = '0042'  OR
818800               TAB-COD-COBERT-WS(IND-WS) = '0084'
818900               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
819000           END-IF
819100           ADD     1         TO   IND-WS
819200     END-PERFORM.
819300     IF   VAL-IS-AUX        >  12500000,00
819400          MOVE      35  TO  COD-IDEN-STAT-WS
819500          MOVE  6125 TO  COD-ERR-NORMA-WS
819600          PERFORM  GRAVA-ERROS
819700     END-IF.
819800
819900 112-RESSEG-4.
820000
820100     MOVE     1         TO   IND-WS
820200     MOVE     ZEROS     TO   VAL-IS-AUX
820300     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
820400        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
820500           IF  TAB-COD-COBERT-WS(IND-WS) = '0040'  OR
820600               TAB-COD-COBERT-WS(IND-WS) = '0043'  OR
820700               TAB-COD-COBERT-WS(IND-WS) = '0085'
820800               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
820900           END-IF
821000           ADD     1         TO   IND-WS
821100     END-PERFORM.
821200     IF   VAL-IS-AUX        >  12500000,00
821300          MOVE      35  TO  COD-IDEN-STAT-WS
821400          MOVE 6126  TO  COD-ERR-NORMA-WS
821500          PERFORM  GRAVA-ERROS
821600     END-IF.
821700
821800 112-RESSEG-5.
821900
822000     MOVE     1         TO   IND-WS
822100     MOVE     ZEROS     TO   VAL-IS-AUX
822200     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
822300        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
822400           IF  TAB-COD-COBERT-WS(IND-WS) = '0041'  OR
822500               TAB-COD-COBERT-WS(IND-WS) = '0050'  OR
822600               TAB-COD-COBERT-WS(IND-WS) = '0068'  OR
822700               TAB-COD-COBERT-WS(IND-WS) = '0069'  OR
822800               TAB-COD-COBERT-WS(IND-WS) = '0070'  OR
822900               TAB-COD-COBERT-WS(IND-WS) = '0071'  OR
823000               TAB-COD-COBERT-WS(IND-WS) = '0044'  OR
823100               TAB-COD-COBERT-WS(IND-WS) = '0047'  OR
823200               TAB-COD-COBERT-WS(IND-WS) = '0072'  OR
823300               TAB-COD-COBERT-WS(IND-WS) = '0073'  OR
823400               TAB-COD-COBERT-WS(IND-WS) = '0074'  OR
823500               TAB-COD-COBERT-WS(IND-WS) = '0075'  OR
823600               TAB-COD-COBERT-WS(IND-WS) = '0086'  OR
823700               TAB-COD-COBERT-WS(IND-WS) = '0087'
823800               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
823900           END-IF
824000           ADD     1         TO   IND-WS
824100     END-PERFORM.
824200     IF   VAL-IS-AUX        >  12500000,00
824300          MOVE      35  TO  COD-IDEN-STAT-WS
824400          MOVE 6127  TO  COD-ERR-NORMA-WS
824500          PERFORM  GRAVA-ERROS
824600     END-IF.
824700
824800 112-RESSEG-6.
824900
825000     MOVE     1         TO   IND-WS
825100     MOVE     ZEROS     TO   VAL-IS-AUX
825200     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
825300        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
825400           IF  TAB-COD-COBERT-WS(IND-WS) = '0022'  OR
825500               TAB-COD-COBERT-WS(IND-WS) = '0058'  OR
825600               TAB-COD-COBERT-WS(IND-WS) = '0059'  OR
825700               TAB-COD-COBERT-WS(IND-WS) = '0060'  OR
825800               TAB-COD-COBERT-WS(IND-WS) = '0061'  OR
825900               TAB-COD-COBERT-WS(IND-WS) = '0062'
826000               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
826100           END-IF
826200           ADD     1         TO   IND-WS
826300     END-PERFORM.
826400     IF   VAL-IS-AUX        >   2500000,00
826500          MOVE      35  TO  COD-IDEN-STAT-WS
826600          MOVE 6128  TO  COD-ERR-NORMA-WS
826700          PERFORM  GRAVA-ERROS
826800     END-IF.
826900
827000 112-RESSEG-7.
827100
827200     MOVE     1         TO   IND-WS
827300     MOVE     ZEROS     TO   VAL-IS-AUX
827400     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
827500        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
827600           IF  TAB-COD-COBERT-WS(IND-WS) = '0057'  OR
827700               TAB-COD-COBERT-WS(IND-WS) = '0058'  OR
827800               TAB-COD-COBERT-WS(IND-WS) = '0059'  OR
827900               TAB-COD-COBERT-WS(IND-WS) = '0060'  OR
828000               TAB-COD-COBERT-WS(IND-WS) = '0061'  OR
828100               TAB-COD-COBERT-WS(IND-WS) = '0062'
828200               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
828300           END-IF
828400           ADD     1         TO   IND-WS
828500     END-PERFORM.
828600     IF   VAL-IS-AUX        >   2500000,00
828700          MOVE      35  TO  COD-IDEN-STAT-WS
828800          MOVE  6129 TO  COD-ERR-NORMA-WS
828900          PERFORM  GRAVA-ERROS
829000     END-IF.
829100
829200 112-RESSEG-8.
829300
829400     MOVE     1         TO   IND-WS
829500     MOVE     ZEROS     TO   VAL-IS-AUX
829600     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
829700        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
829800           IF  TAB-COD-COBERT-WS(IND-WS) = '0009'  OR
829900               TAB-COD-COBERT-WS(IND-WS) = '0010'
830000               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
830100           END-IF
830200           ADD     1         TO   IND-WS
830300     END-PERFORM.
830400     IF   VAL-IS-AUX        >    625000,00
830500          MOVE      35  TO  COD-IDEN-STAT-WS
830600          MOVE 61210 TO  COD-ERR-NORMA-WS
830700          PERFORM  GRAVA-ERROS
830800     END-IF.
830900
831000 112-RESSEG-9.
831100
831200     MOVE     1         TO   IND-WS
831300     MOVE     ZEROS     TO   VAL-IS-AUX
831400     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
831500        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
831600           IF  TAB-COD-COBERT-WS(IND-WS) = '0011'  OR
831700               TAB-COD-COBERT-WS(IND-WS) = '0012'
831800               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
831900           END-IF
832000           ADD     1         TO   IND-WS
832100     END-PERFORM.
832200     IF   VAL-IS-AUX        >    625000,00
832300          MOVE      35  TO  COD-IDEN-STAT-WS
832400          MOVE 61211 TO  COD-ERR-NORMA-WS
832500          PERFORM  GRAVA-ERROS
832600     END-IF.
832700
832800 112-RESSEG-10.
832900
833000     MOVE     1         TO   IND-WS
833100     MOVE     ZEROS     TO   VAL-IS-AUX
833200     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
833300        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
833400           IF  TAB-COD-COBERT-WS(IND-WS) = '0013'  OR
833500               TAB-COD-COBERT-WS(IND-WS) = '0014'  OR
833600               TAB-COD-COBERT-WS(IND-WS) = '0015'  OR
833700               TAB-COD-COBERT-WS(IND-WS) = '0016'  OR
833800               TAB-COD-COBERT-WS(IND-WS) = '0017'
833900               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
834000           END-IF
834100           ADD     1         TO   IND-WS
834200     END-PERFORM.
834300     IF   VAL-IS-AUX        >    625000,00
834400          MOVE      35  TO  COD-IDEN-STAT-WS
834500          MOVE 61212 TO  COD-ERR-NORMA-WS
834600          PERFORM  GRAVA-ERROS
834700     END-IF.
834800
834900 112-RESSEG-11.
835000
835100     MOVE     1         TO   IND-WS
835200     MOVE     ZEROS     TO   VAL-IS-AUX
835300     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
835400        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
835500           IF  TAB-COD-COBERT-WS(IND-WS) = '0025'  OR
835600               TAB-COD-COBERT-WS(IND-WS) = '0026'
835700               ADD    TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
835800           END-IF
835900           ADD     1         TO   IND-WS
836000     END-PERFORM.
836100     IF   VAL-IS-AUX        >   488000,00
836200          MOVE      35  TO  COD-IDEN-STAT-WS
836300          MOVE 61213 TO  COD-ERR-NORMA-WS
836400          PERFORM  GRAVA-ERROS
836500     END-IF.
836600
836700 112-RESSEG-12.
836800
836900     MOVE     1         TO   IND-WS
837000     MOVE     ZEROS     TO   VAL-IS-AUX
837100     MOVE     ZEROS     TO   VAL-IS-AUX2
837200     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
837300        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
837400           IF  TAB-COD-COBERT-WS(IND-WS) = '0032'
837500               MOVE  TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
837600           END-IF
837700           IF  TAB-COD-COBERT-WS(IND-WS) = '0039' OR '0084'
837800                                        OR '0042'
837900               IF TAB-VAL-IS-WS-R (IND-WS) >  VAL-IS-AUX2
838000                 MOVE  TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX2
838100               END-IF
838200           END-IF
838300           ADD     1         TO   IND-WS
838400     END-PERFORM.
838500     IF   VAL-IS-AUX        >   VAL-IS-AUX2 AND
838600          VAL-IS-AUX2       >   ZEROES
838700          MOVE      35  TO  COD-IDEN-STAT-WS
838800          MOVE 61214 TO  COD-ERR-NORMA-WS
838900          PERFORM  GRAVA-ERROS
839000          MOVE ZEROES TO VAL-IS-AUX2
839100     END-IF.
839200
839300 112-RESSEG-13.
839400
839500     MOVE     1         TO   IND-WS
839600     MOVE     ZEROS     TO   VAL-IS-AUX
839700     MOVE     ZEROS     TO   VAL-IS-AUX2
839800     MOVE     ZEROS     TO   VAL-IS-AUX3
839900     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
840000        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
840100           IF  TAB-COD-COBERT-WS(IND-WS) = '0022'
840200               MOVE  TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
840300           END-IF
840400           IF  TAB-COD-COBERT-WS(IND-WS) = '0058' OR '0061'
840500                                        OR '0062'
840600               MOVE  TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX2
840700           END-IF
840800           IF VAL-IS-AUX2 > ZEROES AND VAL-IS-AUX > ZEROES
840900              COMPUTE VAL-IS-AUX3 = VAL-IS-AUX / 2
841000              IF   VAL-IS-AUX2       >   VAL-IS-AUX3
841100                   MOVE      35  TO  COD-IDEN-STAT-WS
841200                   MOVE 61216 TO  COD-ERR-NORMA-WS
841300                   PERFORM  GRAVA-ERROS
841400              END-IF
841500              MOVE ZEROES TO VAL-IS-AUX2
841600              MOVE ZEROES TO VAL-IS-AUX3
841700           END-IF
841800           ADD     1         TO   IND-WS
841900     END-PERFORM.
842000
842100 112-RESSEG-14.
842200
842300     PERFORM 5500-00-VER-LIM-RESSEG.
842400     IF   CUMPRE-NORMA = 'NAO'
842500          MOVE      35  TO  COD-IDEN-STAT-WS
842600          MOVE 61215 TO  COD-ERR-NORMA-WS
842700          PERFORM  GRAVA-ERROS
842800     END-IF.
842900 5112-99-RESSEGURO-112.
843000     EXIT.
843100
843200*=======================================*
843300 5113-00-RESSEGURO-113  SECTION.
843400*=======================================*
843500
843600 113-RESSEG-1.
843700
843800     MOVE     1         TO   IND-WS
843900     MOVE     ZEROS     TO   VAL-IS-AUX
844000     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
844100        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
844200           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'  OR
844300               TAB-COD-COBERT-WS(IND-WS) = '0002'  OR
844400               TAB-COD-COBERT-WS(IND-WS) = '0006'
844500               ADD  TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
844600           END-IF
844700           ADD     1         TO   IND-WS
844800     END-PERFORM.
844900     IF   VAL-IS-AUX        >  1800000,00
845000          MOVE      35  TO  COD-IDEN-STAT-WS
845100          MOVE 6131  TO  COD-ERR-NORMA-WS
845200          PERFORM  GRAVA-ERROS
845300     END-IF.
845400
845500 113-RESSEG-2.
845600
845700     PERFORM 5500-00-VER-LIM-RESSEG.
845800     IF   CUMPRE-NORMA = 'NAO'
845900          MOVE      35  TO  COD-IDEN-STAT-WS
846000          MOVE 6132  TO  COD-ERR-NORMA-WS
846100          PERFORM  GRAVA-ERROS
846200     END-IF.
846300 5113-99-RESSEGURO-113.
846400     EXIT.
846500
846600*=======================================*
846700 5114-00-RESSEGURO-114   SECTION.
846800*=======================================*
846900
847000 114-RESSEG-1.
847100
847200     MOVE     1         TO   IND-WS
847300     MOVE     ZEROS     TO   VAL-IS-AUX
847400     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
847500        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
847600           IF  TAB-COD-COBERT-WS(IND-WS) = '0001'  OR
847700               TAB-COD-COBERT-WS(IND-WS) = '0002'  OR
847800               TAB-COD-COBERT-WS(IND-WS) = '0006'  OR
847900               TAB-COD-COBERT-WS(IND-WS) = '0007'  OR
848000               TAB-COD-COBERT-WS(IND-WS) = '0008'  OR
848100               TAB-COD-COBERT-WS(IND-WS) = '0019'  OR
848200               TAB-COD-COBERT-WS(IND-WS) = '0023'
848300               ADD  TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
848400           END-IF
848500           ADD     1         TO   IND-WS
848600     END-PERFORM.
848700     IF   VAL-IS-AUX        >  60000000,00
848800          MOVE      35  TO  COD-IDEN-STAT-WS
848900          MOVE 6141  TO  COD-ERR-NORMA-WS
849000          PERFORM  GRAVA-ERROS
849100     END-IF.
849200
849300 114-RESSEG-2.
849400
849500     MOVE     1         TO   IND-WS
849600     MOVE     ZEROS     TO   VAL-IS-AUX
849700     PERFORM  UNTIL  IND-WS > NUM-OCOR-COBERT-WS OR
849800        TAB-COD-COBERT-WS(IND-WS) EQUAL ZEROS
849900           IF  TAB-COD-COBERT-WS(IND-WS) = '0006' OR
850000               TAB-COD-COBERT-WS(IND-WS) = '0007' OR
850100               TAB-COD-COBERT-WS(IND-WS) = '0008' OR
850200               TAB-COD-COBERT-WS(IND-WS) = '0019' OR
850300               TAB-COD-COBERT-WS(IND-WS) = '0020'
850400               ADD  TAB-VAL-IS-WS-R (IND-WS) TO VAL-IS-AUX
850500           END-IF
850600           ADD     1         TO   IND-WS
850700     END-PERFORM.
850800     IF   VAL-IS-AUX        >   2500000,00
850900          MOVE      35  TO  COD-IDEN-STAT-WS
851000          MOVE 6142  TO  COD-ERR-NORMA-WS
851100          PERFORM  GRAVA-ERROS
851200     END-IF.
851300
851400 114-RESSEG-3.
851500
851600     PERFORM 5500-00-VER-LIM-RESSEG.
851700     IF   CUMPRE-NORMA = 'NAO'
851800          MOVE      35  TO  COD-IDEN-STAT-WS
851900          MOVE 6143  TO  COD-ERR-NORMA-WS
852000          PERFORM  GRAVA-ERROS
852100     END-IF.
852200
852300 5114-99-RESSEGURO-114.
852400     EXIT.
852500
852600*=======================================*
852700 5500-00-VER-LIM-RESSEG   SECTION.
852800*=======================================*
852900
853000     MOVE   'SIM'     TO     CUMPRE-NORMA
853100     MOVE     1         TO   IND-WS
853200     PERFORM  UNTIL  IND-WS  >    NUM-OCOR-COBERT-WS OR
853300       TAB-COD-COBERT-WS(IND-WS) =  ZEROS
853400       MOVE  TAB-VAL-IS-WS-R (IND-WS)  TO VAL-IS-AUX
853500       MOVE   1         TO     IND-2
853600       PERFORM UNTIL  IND-2   >  NUM-OCOR-RESS
853700          IF  COD-RAMO        = COD-RAMO-LIM  (IND-2) AND
853800              COD-IDEN-TARIF >= COD-TARF-I-LIM(IND-2) AND
853900              COD-IDEN-TARIF <= COD-TARF-F-LIM(IND-2) AND
854000              TAB-COD-COBERT-WS(IND-WS) = COD-COBERT-LIM(IND-2)
854100              IF  VAL-IS-AUX  >  VAL-IS-LIM(IND-2)
854200                  MOVE 'NAO'   TO CUMPRE-NORMA
854300              END-IF
854400          END-IF
854500          ADD  1  TO     IND-2
854600       END-PERFORM
854700       ADD  1     TO     IND-WS
854800     END-PERFORM.
854900
855000 5500-99-VER-LIM-RESSEG.
855100     EXIT.
855200
855300*-------------------------------*
855400 0016-00-AJUSTE-PONTUAL SECTION.
855500*-------------------------------*
855600 0016-01-AJUSTE-PONTUAL.
855700***FICHA 1000975
855800      IF CORR-LIB-VOLKS-RES = 'SIM'
855900         IF VAL-IS-AUX < 20000,01
856000              CONTINUE
856100         ELSE
856200              MOVE 'NAO'   TO CUMPRE-NORMA
856300              MOVE 124344  TO COD-ERR-NORMA-WS
856400              MOVE 10  TO  COD-IDEN-STAT-WS
856500              PERFORM  GRAVA-ERROS
856600         END-IF
856700      ELSE
856800         IF CORR-LIB-HELLNER = 'SIM'
856900               CONTINUE
857000         ELSE
857100              MOVE 'NAO'   TO CUMPRE-NORMA
857200               MOVE 123433  TO COD-ERR-NORMA-WS
857300               MOVE 10  TO  COD-IDEN-STAT-WS
857400               PERFORM  GRAVA-ERROS
857500         END-IF
857600      END-IF.
857700
857800 0016-99-AJUSTE-PONTUAL.
857900     EXIT.
858000
858100*-------------------------------*
858200 0016-00-AJUSTE-PONTUAL-ANTES SECTION.
858300*-------------------------------*
858400 0016-01-AJUSTE-PONTUAL-ANTES.
858500
858600     IF CORR-LIB-VOLKS-RES = 'SIM'
858700        IF VAL-IS-AUX < 20000,01
858800             CONTINUE
858900        ELSE
859000             MOVE 'NAO'   TO CUMPRE-NORMA
859100             MOVE 124344  TO COD-ERR-NORMA-WS
859200             MOVE 10  TO  COD-IDEN-STAT-WS
859300             PERFORM  GRAVA-ERROS
859400        END-IF
859500     ELSE
859600         IF CORR-LIB-MERCEDES = 'SIM' OR
859700            CORR-LIB-HELLNER = 'SIM' OR
859800            CORR-LIB-RESIDENCIAL = 'SIM'
859900               CONTINUE
860000         ELSE
860100            IF CORR-LIB-LAZAM = 'SIM'
860200               CONTINUE
860300            ELSE
860400               MOVE 'NAO'   TO CUMPRE-NORMA
860500               MOVE 123433  TO COD-ERR-NORMA-WS
860600               MOVE 10  TO  COD-IDEN-STAT-WS
860700               PERFORM  GRAVA-ERROS
860800            END-IF
860900         END-IF
861000     END-IF.
861100
861200 0016-99-AJUSTE-PONTUAL-ANTES.
861300     EXIT.
861400
861500*-------------------------------*
861600 0029-00-AJUSTE-PONTUAL SECTION.
861700*-------------------------------*
861800 0029-01-AJUSTE-PONTUAL.
861900      IF  CORR-LIB-RESIDENCIAL = 'SIM' OR
862000          CORR-LIB-MARINE = 'SIM' OR
862100          CORR-LIB-HELLNER = 'SIM' OR
862200          CORR-LIB-VOLKS-RES = 'SIM' OR
862300          CORR-LIB-MERCEDES = 'SIM'
862400          IF VAL-IS-AUX < 10000,01
862500             CONTINUE
862600          ELSE
862700             MOVE 'NAO'   TO CUMPRE-NORMA
862800             MOVE 123340  TO COD-ERR-NORMA-WS
862900             MOVE 10  TO  COD-IDEN-STAT-WS
863000             PERFORM  GRAVA-ERROS
863100          END-IF
863200      ELSE
863300          IF  CORR-LIB-AON-HOLD = 'SIM'  OR
863400              CORR-LIB-AON-HOLD-SP = 'SIM'
863500              IF VAL-IS-AUX < 20000,01
863600                 CONTINUE
863700              ELSE
863800                 MOVE 'NAO'   TO CUMPRE-NORMA
863900                 MOVE 124340  TO COD-ERR-NORMA-WS
864000                 MOVE 10  TO  COD-IDEN-STAT-WS
864100                 PERFORM  GRAVA-ERROS
864200                 MOVE   'NAO'  TO  LMG-WS
864300              END-IF
864400          ELSE
864500              IF  CORR-LIB-LAZAM = 'SIM'
864600                 IF VAL-IS-AUX < 100000,01
864700                    CONTINUE
864800                 ELSE
864900                    MOVE 'NAO'   TO CUMPRE-NORMA
865000                    MOVE 123340  TO COD-ERR-NORMA-WS
865100                    MOVE 10  TO  COD-IDEN-STAT-WS
865200                    PERFORM  GRAVA-ERROS
865300                    MOVE   'NAO'  TO  LMG-WS
865400                 END-IF
865500              ELSE
865600                 MOVE 'NAO'   TO CUMPRE-NORMA
865700                 MOVE 123340  TO COD-ERR-NORMA-WS
865800                 MOVE 10  TO  COD-IDEN-STAT-WS
865900                 PERFORM  GRAVA-ERROS
866000              END-IF
866100          END-IF
866200      END-IF.
866300
866400 0029-99-AJUSTE-PONTUAL.
866500     EXIT.
866600
866700*-------------------------------*
866800 0029-00-AJUSTE-PONTUAL-ANTES SECTION.
866900*-------------------------------*
867000 0029-01-AJUSTE-PONTUAL-ANTES.
867100
867200     IF CORR-LIB-MARINE = 'SIM'
867300        IF VAL-IS-AUX < 10000,01
867400           CONTINUE
867500        ELSE
867600           MOVE 'NAO'   TO CUMPRE-NORMA
867700           MOVE 123340  TO COD-ERR-NORMA-WS
867800           MOVE 10  TO  COD-IDEN-STAT-WS
867900           PERFORM  GRAVA-ERROS
868000        END-IF
868100     ELSE
868200        IF CORR-LIB-RESIDENCIAL = 'SIM'
868300           IF VAL-IS-AUX < 100000,01
868400              CONTINUE
868500           ELSE
868600              MOVE 'NAO'   TO CUMPRE-NORMA
868700              MOVE 123340  TO COD-ERR-NORMA-WS
868800              MOVE 10  TO  COD-IDEN-STAT-WS
868900              PERFORM  GRAVA-ERROS
869000           END-IF
869100        ELSE
869200          IF CORR-LIB-MERCEDES = 'SIM'
869300             IF VAL-IS-AUX < 10000,01
869400                CONTINUE
869500             ELSE
869600                MOVE 'NAO'   TO CUMPRE-NORMA
869700                MOVE 124340  TO COD-ERR-NORMA-WS
869800                MOVE 10  TO  COD-IDEN-STAT-WS
869900                PERFORM  GRAVA-ERROS
870000                MOVE   'NAO'  TO  LMG-WS
870100             END-IF
870200          ELSE
870300            IF CORR-LIB-AON-HOLD = 'SIM'  OR
870400               CORR-LIB-AON-HOLD-SP = 'SIM'
870500               IF VAL-IS-AUX < 20000,01
870600                  CONTINUE
870700               ELSE
870800                  MOVE 'NAO'   TO CUMPRE-NORMA
870900                  MOVE 124340  TO COD-ERR-NORMA-WS
871000                  MOVE 10  TO  COD-IDEN-STAT-WS
871100                  PERFORM  GRAVA-ERROS
871200                  MOVE   'NAO'  TO  LMG-WS
871300               END-IF
871400            ELSE
871500               IF CORR-LIB-VOLKS-RES = 'SIM'
871600                  IF VAL-IS-AUX < 10000,01
871700                     CONTINUE
871800                  ELSE
871900                     MOVE 'NAO'   TO CUMPRE-NORMA
872000                     MOVE 124340  TO COD-ERR-NORMA-WS
872100                     MOVE 10  TO  COD-IDEN-STAT-WS
872200                     PERFORM  GRAVA-ERROS
872300                     MOVE   'NAO'  TO  LMG-WS
872400                  END-IF
872500               ELSE
872600                  IF CORR-LIB-LAZAM = 'SIM'
872700                     IF VAL-IS-AUX < 100000,01
872800                        CONTINUE
872900                     ELSE
873000                        MOVE 'NAO'   TO CUMPRE-NORMA
873100                        MOVE 123340  TO COD-ERR-NORMA-WS
873200                        MOVE 10  TO  COD-IDEN-STAT-WS
873300                        PERFORM  GRAVA-ERROS
873400                        MOVE   'NAO'  TO  LMG-WS
873500                     END-IF
873600                  ELSE
873700                     MOVE 'NAO'   TO CUMPRE-NORMA
873800                     MOVE 123340  TO COD-ERR-NORMA-WS
873900                     MOVE 10  TO  COD-IDEN-STAT-WS
874000                     PERFORM  GRAVA-ERROS
874100                  END-IF
874200               END-IF
874300             END-IF
874400           END-IF
874500         END-IF
874600     END-IF.
874700
874800 0029-99-AJUSTE-PONTUAL-ANTES.
874900     EXIT.
875000
875100
875200
875300
875400*---------------------------------------*
875500 GRAVA-ERROS-FATAL  SECTION.
875600*---------------------------------------*
875700
875800     ADD 1  TO   IND-ERR
875900     MOVE  DSC-ERR-NORMA-WS
876000                      TO DSC-ERR-NORMA-S01U034(IND-ERR)
876100     MOVE  40         TO COD-STAT-IRREG-S01U034(IND-ERR)
876200     MOVE  9555       TO COD-ERR-NORMA-S01U034(IND-ERR)
876300
876400     PERFORM  900-00-FIM.
876500
876600 GRAVA-ERROS-FATAL-E.
876700     EXIT.
876800
876900*---------------------------*
877000 GRAVA-ERROS  SECTION.
877100*---------------------------*
877200     ADD 1  TO   IND-ERR
877300
877400     MOVE  COD-IDEN-STAT-WS  TO COD-STAT-IRREG-S01U034(IND-ERR)
877500     MOVE  COD-ERR-NORMA-WS  TO COD-ERR-NORMA-S01U034(IND-ERR)
877600
877700     MOVE  ZEROS             TO COD-IDEN-STAT-WS
877800     MOVE  ZEROS             TO COD-ERR-NORMA-WS.
877900
878000 GRAVA-ERROS-F.
878100     EXIT.
878200
878300*---------------------------*
878400 TRATA-SQL-ERRO  SECTION.
878500*---------------------------*
878600     COPY C00P005B.CPY.
878700     IF  SQLSTATE  =   23000 OR '999SJ'
878800     COMENTAR ESSA LINHA E O IF ABAIXO NO NETCOBOL
878900     IF  SQLSTATE  =   23000
879000         MOVE 'REGISTRO EM DUPLICIDADE VERIFIQUE COM O SISTEMAS'
879100                          TO  DSC-ERR-NORMA-WS
879200     ELSE
879300         MOVE  DSC-SQL-ERRO-WS  TO  DSC-ERR-NORMA-WS
879400     END-IF
879500
879600     PERFORM  GRAVA-ERROS-FATAL.
879700
879800 TRATA-SQL-ERRO-X.
879900     EXIT.
880000
880100*---------------------------*
880200 MSG-CONSOLE      SECTION.
880300*---------------------------*
880400     COPY C00P004A.CPY.
880500     COPY C00P007B.CPY.
880600
880700*---------------------------------------*
880800 900-00-FIM  SECTION.
880900*---------------------------------------*
881000
881100     EXIT     PROGRAM.
881200 900-99-FIM.
881300     EXIT.
881400
       MOSTRA-CONTEUDO-HOST SECTION.
           IF COD-IDEN-MOSTRA-HOST         (00001) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-ORG                        '
                           '='      COD-ORG                        '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00002) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-RAMO                       '
                           '='      COD-RAMO                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00003) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-PED                        '
                           '='      NUM-PED                        '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00004) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-BILHETE                    '
                           '='      NUM-BILHETE                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00005) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-APOL                       '
                           '='      NUM-APOL                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00006) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-REG                        '
                           '='      COD-REG                        '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00007) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-BCO-COBR                   '
                           '='      COD-BCO-COBR                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00008) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-AGEN-ANGAR                 '
                           '='      COD-AGEN-ANGAR                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00009) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-AGEN-INDICR                '
                           '='      COD-AGEN-INDICR                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00010) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-CTA-INDICR                 '
                           '='      NUM-CTA-INDICR                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00011) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-UNID-PROD                  '
                           '='      COD-UNID-PROD                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00012) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-PROD                       '
                           '='      COD-PROD                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00013) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-AGEN-BAS-COR               '
                           '='      COD-AGEN-BAS-COR               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00014) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-CTA-BAS-COR                '
                           '='      NUM-CTA-BAS-COR                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00015) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-SEGURADO                   '
                           '='      COD-SEGURADO                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00016) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NOM-SEGURADO                   '
                           '='      NOM-SEGURADO                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00017) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DSC-COMPL-SEGURADO             '
                           '='      DSC-COMPL-SEGURADO             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00018) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-CGC-CPF                    '
                           '='      NUM-CGC-CPF                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00019) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-TIP-LOGR                   '
                           '='      COD-TIP-LOGR                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00020) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NOM-LOGR                       '
                           '='      NOM-LOGR                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00021) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DSC-COMPL-LOGR                 '
                           '='      DSC-COMPL-LOGR                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00022) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NOM-BAIRRO                     '
                           '='      NOM-BAIRRO                     '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00023) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NOM-CID                        '
                           '='      NOM-CID                        '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00024) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'SIG-UF                         '
                           '='      SIG-UF                         '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00025) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-CEP                        '
                           '='      NUM-CEP                        '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00026) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-FONE                       '
                           '='      NUM-FONE                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00027) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-ESTIP                      '
                           '='      COD-ESTIP                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00028) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-COEF-CMS-PAD               '
                           '='      VAL-COEF-CMS-PAD               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00029) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-INI-VIG                    '
                           '='      DAT-INI-VIG                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00030) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-TER-VIG                    '
                           '='      DAT-TER-VIG                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00031) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-EMIS                       '
                           '='      DAT-EMIS                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00032) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-MOED                       '
                           '='      COD-MOED                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00033) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-JURO-FRAC                  '
                           '='      PER-JURO-FRAC                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00034) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'QTD-PARC                       '
                           '='      QTD-PARC                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00035) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'QTD-ANEXO                      '
                           '='      QTD-ANEXO                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00036) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PRAZ                  '
                           '='      COD-IDEN-PRAZ                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00037) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-PR-MIN-ENDO                '
                           '='      COD-PR-MIN-ENDO                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00038) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-PR-MIN-PARC                '
                           '='      COD-PR-MIN-PARC                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00039) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PR-ANTEC                   '
                           '='      VAL-PR-ANTEC                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00040) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-ADIC-FORM-PAG              '
                           '='      PER-ADIC-FORM-PAG              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00041) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-DESC-FORM-PAG              '
                           '='      PER-DESC-FORM-PAG              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00042) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-IS                         '
                           '='      VAL-IS                         '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00043) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PR                         '
                           '='      VAL-PR                         '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00044) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-ALT-CORR              '
                           '='      COD-IDEN-ALT-CORR              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00045) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-USER-DIGIT                 '
                           '='      COD-USER-DIGIT                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00046) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-DIGIT                      '
                           '='      DAT-DIGIT                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00047) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'HOR-DIGIT                      '
                           '='      HOR-DIGIT                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00048) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-USER-LIBER                 '
                           '='      COD-USER-LIBER                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00049) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-LIBER                      '
                           '='      DAT-LIBER                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00050) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'HOR-LIBER                      '
                           '='      HOR-LIBER                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00051) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-SIT-PED                    '
                           '='      COD-SIT-PED                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00052) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-TIP-DOC                    '
                           '='      COD-TIP-DOC                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00053) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-DIZER                      '
                           '='      COD-DIZER                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00054) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'QTD-COPIA                      '
                           '='      QTD-COPIA                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00055) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-CUST-EMIS                  '
                           '='      VAL-CUST-EMIS                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00056) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'TIP-CUST-EMIS                  '
                           '='      TIP-CUST-EMIS                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00057) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PR-REF-TARIF               '
                           '='      VAL-PR-REF-TARIF               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00058) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PR-REF-RESG                '
                           '='      VAL-PR-REF-RESG                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00059) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-INI-VIAG                   '
                           '='      DAT-INI-VIAG                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00060) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-POSI-ATUAL                 '
                           '='      COD-POSI-ATUAL                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00061) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-CAMBIO-EMIS                '
                           '='      VAL-CAMBIO-EMIS                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00062) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'IDEN                           '
                           '='      IDEN                           '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00063) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-BLOQ-CTRL                  '
                           '='      NUM-BLOQ-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00064) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PR-TOT-CTRL                '
                           '='      VAL-PR-TOT-CTRL                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00065) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-UNID-CTRL                  '
                           '='      COD-UNID-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00066) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-CLASSE-CTRL           '
                           '='      COD-IDEN-CLASSE-CTRL           '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00067) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-RAMO-CTRL                  '
                           '='      COD-RAMO-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00068) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-COBR-CTRL             '
                           '='      COD-IDEN-COBR-CTRL             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00069) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-INI-VIG-CTRL               '
                           '='      DAT-INI-VIG-CTRL               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00070) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-PROP-CTRL                  '
                           '='      NUM-PROP-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00071) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-TER-VIG-CTRL               '
                           '='      DAT-TER-VIG-CTRL               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00072) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-CANC-APOL-CTRL             '
                           '='      DAT-CANC-APOL-CTRL             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00073) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-CORR-CTRL                  '
                           '='      COD-CORR-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00074) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-TIP-DOC-CTRL               '
                           '='      COD-TIP-DOC-CTRL               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00075) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-CORR-CTRL                  '
                           '='      PER-CORR-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00076) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-REC-CIA-CTRL               '
                           '='      DAT-REC-CIA-CTRL               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00077) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-CORR-2-CTRL                '
                           '='      COD-CORR-2-CTRL                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00078) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-REF-CORR-CTRL              '
                           '='      NUM-REF-CORR-CTRL              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00079) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-CORR-2-CTRL                '
                           '='      PER-CORR-2-CTRL                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00080) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-EMIS-CTRL                  '
                           '='      DAT-EMIS-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00081) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-CORR-3-CTRL                '
                           '='      COD-CORR-3-CTRL                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00082) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-APOL-CTRL                  '
                           '='      NUM-APOL-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00083) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-CORR-3-CTRL                '
                           '='      PER-CORR-3-CTRL                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00084) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-ENDO-CTRL                  '
                           '='      NUM-ENDO-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00085) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NOM-SEG-CTRL                   '
                           '='      NOM-SEG-CTRL                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00086) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PR-EMIS-CTRL               '
                           '='      VAL-PR-EMIS-CTRL               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00087) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'QTD-ANEX-CTRL                  '
                           '='      QTD-ANEX-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00088) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PR-LIQ-CTRL                '
                           '='      VAL-PR-LIQ-CTRL                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00089) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-APOL-ANT-CTRL              '
                           '='      NUM-APOL-ANT-CTRL              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00090) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-TOT-COSS-CTRL              '
                           '='      PER-TOT-COSS-CTRL              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00091) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DSC-OBS-PROP-CTRL              '
                           '='      DSC-OBS-PROP-CTRL              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00092) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'QTD-PARC-CTRL                  '
                           '='      QTD-PARC-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00093) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-JUROS-NEG-CTRL             '
                           '='      PER-JUROS-NEG-CTRL             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00094) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-STAT-RESP-CTRL        '
                           '='      COD-IDEN-STAT-RESP-CTRL        '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00095) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-ENVI-DOC-CTRL              '
                           '='      COD-ENVI-DOC-CTRL              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00096) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SAC-CTRL              '
                           '='      COD-IDEN-SAC-CTRL              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00097) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-STAT-ACAO-CTRL        '
                           '='      COD-IDEN-STAT-ACAO-CTRL        '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00098) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-PROD-CTRL                  '
                           '='      COD-PROD-CTRL                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00099) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-DIGIT-MF-CTRL              '
                           '='      DAT-DIGIT-MF-CTRL              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00100) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-IS-CTRL                    '
                           '='      VAL-IS-CTRL                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00101) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'HOR-DIGIT-MF-CTRL              '
                           '='      HOR-DIGIT-MF-CTRL              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00102) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-DESC-COML-CTRL             '
                           '='      PER-DESC-COML-CTRL             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00103) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-USER-DIGIT-MF-CTRL         '
                           '='      COD-USER-DIGIT-MF-CTRL         '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00104) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-PI-CTRL                    '
                           '='      NUM-PI-CTRL                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00105) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-CGC-CPF-CTRL               '
                           '='      NUM-CGC-CPF-CTRL               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00106) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-DIGIT-CTRL                 '
                           '='      DAT-DIGIT-CTRL                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00107) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PESSOA-CTRL           '
                           '='      COD-IDEN-PESSOA-CTRL           '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00108) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PAG-ANTEC-CTRL        '
                           '='      COD-IDEN-PAG-ANTEC-CTRL        '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00109) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-TIP-LOGR-RISCO             '
                           '='      COD-TIP-LOGR-RISCO             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00110) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NOM-LOGR-RISCO                 '
                           '='      NOM-LOGR-RISCO                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00111) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DSC-COMPL-RISCO                '
                           '='      DSC-COMPL-RISCO                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00112) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NOM-BAIRRO-RISCO               '
                           '='      NOM-BAIRRO-RISCO               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00113) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NOM-CID-RISCO                  '
                           '='      NOM-CID-RISCO                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00114) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'SIG-UF-RISCO                   '
                           '='      SIG-UF-RISCO                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00115) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-CEP-RISCO                  '
                           '='      NUM-CEP-RISCO                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00116) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-DESC-APAR                  '
                           '='      PER-DESC-APAR                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00117) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-DESC-PROGRES               '
                           '='      PER-DESC-PROGRES               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00118) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-IS-VR                      '
                           '='      PER-IS-VR                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00119) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-COEF-IS-VR                 '
                           '='      VAL-COEF-IS-VR                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00120) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-VR                         '
                           '='      VAL-VR                         '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00121) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'TAB-CLASF                      '
                           '='      TAB-CLASF                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00122) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-CLASF                      '
                           '='      COD-CLASF                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00123) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-COMPL-CLASF                '
                           '='      COD-COMPL-CLASF                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00124) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-CLASSE-OCUP                '
                           '='      COD-CLASSE-OCUP                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00125) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-CONSTR                     '
                           '='      COD-CONSTR                     '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00126) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-SIT-ITEM                   '
                           '='      COD-SIT-ITEM                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00127) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-BONUS                      '
                           '='      PER-BONUS                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00128) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'QTD-EMPREG                     '
                           '='      QTD-EMPREG                     '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00129) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DSC-CLASF                      '
                           '='      DSC-CLASF                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00130) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-INSP-TAB                   '
                           '='      NUM-INSP-TAB                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00131) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-01              '
                           '='      COD-IDEN-SEGUR-01              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00132) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-02              '
                           '='      COD-IDEN-SEGUR-02              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00133) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-03              '
                           '='      COD-IDEN-SEGUR-03              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00134) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-04              '
                           '='      COD-IDEN-SEGUR-04              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00135) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-05              '
                           '='      COD-IDEN-SEGUR-05              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00136) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-06              '
                           '='      COD-IDEN-SEGUR-06              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00137) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-07              '
                           '='      COD-IDEN-SEGUR-07              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00138) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-08              '
                           '='      COD-IDEN-SEGUR-08              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00139) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-09              '
                           '='      COD-IDEN-SEGUR-09              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00140) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-SEGUR-10              '
                           '='      COD-IDEN-SEGUR-10              '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00141) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-TOT-SEGUR                  '
                           '='      PER-TOT-SEGUR                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00142) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-01             '
                           '='      COD-IDEN-PROTEC-01             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00143) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-02             '
                           '='      COD-IDEN-PROTEC-02             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00144) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-03             '
                           '='      COD-IDEN-PROTEC-03             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00145) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-04             '
                           '='      COD-IDEN-PROTEC-04             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00146) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-05             '
                           '='      COD-IDEN-PROTEC-05             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00147) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-06             '
                           '='      COD-IDEN-PROTEC-06             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00148) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-07             '
                           '='      COD-IDEN-PROTEC-07             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00149) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-08             '
                           '='      COD-IDEN-PROTEC-08             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00150) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-09             '
                           '='      COD-IDEN-PROTEC-09             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00151) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-PROTEC-10             '
                           '='      COD-IDEN-PROTEC-10             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00152) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-TOT-PROTEC                 '
                           '='      PER-TOT-PROTEC                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00153) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-PRODUTO                    '
                           '='      COD-PRODUTO                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00154) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-REGIAO                     '
                           '='      COD-REGIAO                     '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00155) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-IDEN-TARIF                 '
                           '='      COD-IDEN-TARIF                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00156) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-ITEM                       '
                           '='      NUM-ITEM                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00157) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-PARC-VENC                  '
                           '='      NUM-PARC-VENC                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00158) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DAT-VENC-VENC                  '
                           '='      DAT-VENC-VENC                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00159) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-CORR-COR                   '
                           '='      PER-CORR-COR                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00160) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-ORDEM-CORR-COR             '
                           '='      NUM-ORDEM-CORR-COR             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00161) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-CLAU                       '
                           '='      COD-CLAU                       '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00162) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-COBERT-PD                  '
                           '='      COD-COBERT-PD                  '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00163) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-IS-PD                      '
                           '='      VAL-IS-PD                      '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00164) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-TAXA-PD                    '
                           '='      PER-TAXA-PD                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00165) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-DESC-COML-PD               '
                           '='      PER-DESC-COML-PD               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00166) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-DESC-EXP-PD                '
                           '='      PER-DESC-EXP-PD                '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00167) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PR-COBERT-PD               '
                           '='      VAL-PR-COBERT-PD               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00168) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'PER-LIM-MAX-COBERT             '
                           '='      PER-LIM-MAX-COBERT             '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00169) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-LIM-COBERT                 '
                           '='      COD-LIM-COBERT                 '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00170) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'COD-GRUPO-COBERT               '
                           '='      COD-GRUPO-COBERT               '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00171) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-APOL-SIN                   '
                           '='      NUM-APOL-SIN                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00172) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-ITEM-SIN                   '
                           '='      NUM-ITEM-SIN                   '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00173) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'DSC-INSTR-REMES-SIN            '
                           '='      DSC-INSTR-REMES-SIN            '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00174) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'VAL-PAG-SIN                    '
                           '='      VAL-PAG-SIN                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00175) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'NUM-ITEM-WS                    '
                           '='      NUM-ITEM-WS                    '/'
              UPON CONSOLE
           END-IF
           IF COD-IDEN-MOSTRA-HOST         (00176) = 1
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
                                 'QTD-RENOV-SIN                  '
                           '='      QTD-RENOV-SIN                  '/'
              UPON CONSOLE
           END-IF
           .
       MOSTRA-CONTEUDO-SQL SECTION.
           MOVE 1 TO P99B004-IND-SQL-WS
           PERFORM UNTIL P99B004-IND-SQL-WS > QTD-CONTEUDO-SQL-WS
              DISPLAY        '++ '     NOM-PROG-WS         '+++ '
              DSC-CONTEUDO-SQL-WS (P99B004-IND-SQL-WS)
              UPON CONSOLE
              ADD 1 TO P99B004-IND-SQL-WS
           END-PERFORM
           .
